{"0": {"Date": " Jan 6, 2017", "Summary": "\"Crew worker\"", "Pros": "It is a good way to advance your career. Only if you are working with people with a positive attitude.", "Cons": "It is a problem when the managers are being rude towards the works because they are in a high position and mistreat the people that are working for them."}, "1": {"Date": " Jan 6, 2017", "Summary": "\"McDonald's\"", "Pros": "The other crew members and some managers are really down to earth and cool, and I've been with McDonald's for 7 years.", "Cons": "If you don't want to become a manager not much money you can make. Have to do lots of multitasking, and sometimes end up doing other people jobs. Some Managers can't handle the pressure of being busy, and people come and go too quickly."}, "2": {"Date": " Jan 6, 2017", "Summary": "\"Decent place to work\"", "Pros": "Decent place to work at.", "Cons": "Not exciting or fulfilling really"}, "3": {"Date": " Jan 6, 2017", "Summary": "\"Cashier\"", "Pros": "Fast pace environment and it's pretty easy", "Cons": "It doesn't pay employees enough money."}, "4": {"Date": " Jan 7, 2017", "Summary": "\"100% not beef and where'd the 1 stuff go\"", "Pros": "If you need the weight gain you find your career", "Cons": "I have never seen beef that color"}, "5": {"Date": " Dec 22, 2016", "Summary": "\"Outsourced\"", "Pros": "I loved working for McDonalds. The Columbus Accounting Center was an amazing place with amazing people. McDonalds really set the standard for the business office environment. Growth and development was phenomenal, employees were challenged and held accountable. Focus on teamwork and customer service was unparalleled.", "Cons": "The CEO decided to outsource our jobs to India. It was lame how they seemed to just pick and choose who go to keep their jobs. Naturally, directors and managers are still employed. I guess somebody has to answer the phone when India calls. Too bad for the other 150 people they laid off."}, "6": {"Date": " Dec 22, 2016", "Summary": "\"Great Opportunities\"", "Pros": "You can most definitely make a great career out of \"flipping\" burgers. Advancing is a reality. It def not an easy job, but they offer many many courses, classes and they not only support your decision to go back to school but they pay partially for it. The benefits are great! All that at the Corporate McDs.", "Cons": "Start salaries arent that great"}, "7": {"Date": " Jan 5, 2017", "Summary": "\"Cashier\"", "Pros": "It was a lot of fun.", "Cons": "Sometimes the hot grease splattered."}, "8": {"Date": " Jan 5, 2017", "Summary": "\"McDonalds\"", "Pros": "You meet great, funny people. Get to learn a little about machinery etc", "Cons": "Because of the bad reputation customers are automatically rude sometimes."}, "9": {"Date": " Dec 21, 2016", "Summary": "\"Employee\"", "Pros": "So far a great place to work", "Cons": "I have no cons about the job"}}