{"0": {"Date": " Dec 8, 2016", "Summary": "\"Crew Member\"", "Pros": "The people I worked with made the work a little more tolerable.", "Cons": "Busy 24/7, sometimes it was really hard to be nice to rude customers."}, "1": {"Date": " Dec 8, 2016", "Summary": "\"It is McDonald's\"", "Pros": "Pay is getting better. Flexible hours. Easy to move up.", "Cons": "No work life balance. Long hard hours. Lots of grease and customer abuse."}, "2": {"Date": " Nov 21, 2016", "Summary": "\"ver fast paced\"", "Pros": "the co-workers are friendy, the managers are cool, You get a discount on the menu...But more importantly, a job at any chain business such as Mcdonalds looks great on your resume. You get great experience in the food AND business industry, and no Employer will need to ask \"What is McDonalds?\". It is a very well recognized chain and if you stick with it, it can help lead you to much greater success in life.", "Cons": "It's pretty gross at timee, It's almost always busy. There is a lot of hot things so if you're not careful you can burn yourself"}, "3": {"Date": " Nov 23, 2016", "Summary": "\"Worked at McDonalds\"", "Pros": "Great benefits, great food, great discounts", "Cons": "Oily food, not enough hours"}, "4": {"Date": " Nov 23, 2016", "Summary": "\"awesome\"", "Pros": "fun, really fun to work at night and great people to work with, really had fun. would definitely do again", "Cons": "long hours, have to know how to deal with angry customers, and sometimes your feet hurt from standing up so much"}, "5": {"Date": " Nov 24, 2016", "Summary": "\"Burger Flipper\"", "Pros": "Flexible hours for gamng, free food, excellent fries.", "Cons": "Not alot of sleep, bossy supervisors."}, "6": {"Date": " Dec 30, 2016", "Summary": "\"Sale associate\"", "Pros": "I love it tbh it's like the best place to work at and I get to eat.", "Cons": "The people are annoying and so are customers like ughhhhhh"}, "7": {"Date": " Dec 8, 2016", "Summary": "\"CSR\"", "Pros": "Fast. Fun. Everyone is pretty nice, but some are not. Advancement is possible. A lot of possible trainings to occur.", "Cons": "Bad pay. Food smells bad. Terrible management. No benefits offered to part time employees. You will get fat. Some coworkers are horrible. Serving people isn't fun."}, "8": {"Date": " Nov 23, 2016", "Summary": "\"Server\"", "Pros": "Good atmosphere and friendly stuff", "Cons": "Nothing specific to complain about."}, "9": {"Date": " Nov 23, 2016", "Summary": "\"Not a bad place to work!\"", "Pros": "Very fast paced, leadership opportunities (crew trainer, shift manager), good place for a high school student. Learned a lot during my time there.", "Cons": "Fast food jobs in general, nothing out of the norm"}}