{"0": {"Date": " Sep 26, 2017", "Summary": "\"Average\"", "Pros": "Free food and discounts for employees", "Cons": "Lack of opportunity and benefits as an employee"}, "1": {"Date": " Sep 26, 2017", "Summary": "\"Additions\"", "Pros": "Are nice to you, friendly workers, good job for young teens.", "Cons": "I don't have any cons with the mcdonalds industry."}, "2": {"Date": " Sep 27, 2017", "Summary": "\"Crew\"", "Pros": "I get along with people i work with", "Cons": "Doesnt pay enough to pay bills"}, "3": {"Date": " Sep 11, 2017", "Summary": "\"Shift Manager\"", "Pros": "Great Staff and Great Benefits", "Cons": "Long Hours and Crappy Customers"}, "4": {"Date": " Oct 17, 2017", "Summary": "\"Poor store management\"", "Pros": "Management sometimes would work with my days off if requested on a timely manner. Free meals as a manager.", "Cons": "Did not work with my needed schedule. Did not accommodate me during my pregnancy. As a manger you don't get a full meal break. Did not work as a team. When things went wrong it turned everyone into a chaotic state. Unorganized. Other managers were rude and aggressive towards fellow managers and crew. When you try and seek info for management classes to go further your given the run around."}, "5": {"Date": " Oct 17, 2017", "Summary": "\"crew\"", "Pros": "nice crew and managers who help", "Cons": "its always busy don't get breaks on time"}, "6": {"Date": " Sep 27, 2017", "Summary": "\"I was a crew member at my local McDonald’s during my senior year of high school and when I came home for college breaks.\"", "Pros": "Due to the fact that I was a good employee and my managers really liked me, they were always willing to take me back when I’d come home for breaks from college, even if it was for only a couple weeks.", "Cons": "Disorganized, people always calling off for dumb reasons, managers who would play favorites. Also, whenever you had an issue involving your paycheck or your raise, it was a total hassle to get it handled and the managers would just keep pushing it off."}, "7": {"Date": " Sep 11, 2017", "Summary": "\"good work for high schoolers\"", "Pros": "flexible schedule , over time, ect", "Cons": "rude customers , other things"}, "8": {"Date": " Sep 11, 2017", "Summary": "\"Great Company\"", "Pros": "Lots of opportunity to work on big, exciting projects. They are old school in a lot of ways but there is very little arrogance and generally a meritocracy.", "Cons": "The organization has changed a lot over the past few years so some groups are very inefficient and disorganized. Several below-VP level employees just do what they want and are not held accountable."}, "9": {"Date": " Sep 11, 2017", "Summary": "\"McDonalds is not awful, but not the start you want.\"", "Pros": "Good people, flexible hours, discount food", "Cons": "Long day, bad salary, cleaning"}}