{"0": {"Date": " Jun 19, 2017", "Summary": "\"cashier\"", "Pros": "Worked with a lot of cool people.", "Cons": "Not the most fun work, but easy."}, "1": {"Date": " Jul 2, 2017", "Summary": "\"Good people. Bad company\"", "Pros": "-Great CoworkersI love all of my coworkers including all of the managers, you get to be pretty good friends with people-Learn people skills.This might not apply if you work anywhere other than cashier or drive-thru, but I've found that I've become a lot more of a people person after having to interact with 100s a day.-Advancement opportunitiesMany of the higher-ups in my location only took a handful of months to go from crew member to trainer, and then only a year or so to go from that to shift manager. If you don't burn out and stay on for a few years, it's virtually guaranteed you can become a manager", "Cons": "-McUnderstaffedWe don't have enough people, period (location specific)-McTerriblewagesI get paid a wage that in my area would be less thank half of the poverty line yearly-McUnflexiblehoursGod help you if you have something you HAVE to do during one of your scheduled days."}, "2": {"Date": " Jul 3, 2017", "Summary": "\"it was ok, management ok\"", "Pros": "friendly staffeasy taskdiscounts for meal", "Cons": "managementsalaryno vacationno Career Opportunities"}, "3": {"Date": " Jul 3, 2017", "Summary": "\"Ok starting job\"", "Pros": "Gives you job experience and some spending cash", "Cons": "The people are terrible"}, "4": {"Date": " Jun 17, 2017", "Summary": "\"seeking\"", "Pros": "Blast to work with fun people", "Cons": "over working is always terrible"}, "5": {"Date": " Jul 23, 2017", "Summary": "\"Stressful\"", "Pros": "flexible hours, guaranteed 30 hrs a week minimum, employee discount", "Cons": "questionable ethics, improper training, mismanaged franchise, impossible standards, supervisors believe in screaming and belittling you rather than explanation and talking, expects you to put the job before family"}, "6": {"Date": " Jul 2, 2017", "Summary": "\"Bad Atmosphere\"", "Pros": "not really any almost no benefits", "Cons": "way too many to name"}, "7": {"Date": " Jul 3, 2017", "Summary": "\"Department manager\"", "Pros": "Crew is fun to work with on slow days but that is about it.", "Cons": "No raises in over a year no appreciation for the work. No one in upper management cares unless your numbers are good."}, "8": {"Date": " Jul 1, 2017", "Summary": "\"Cashier\"", "Pros": "Nice management and flexible schedule", "Cons": "Minimum wage and low mobility"}, "9": {"Date": " Jul 1, 2017", "Summary": "\"Cashier, headset, handout food and frontline\"", "Pros": "Everyone is nice at McDonald's I like the people that work with me most of the time", "Cons": "Managers can be very rude and inconsiderate at McDonald's about others with disabilities"}}