{"0": {"Date": " Sep 6, 2016", "Summary": "\"mantience\"", "Pros": "add reasonable amount of money to your savings keep you on top of home fincial problems.", "Cons": "on lopng term bases it may not be equvilent of some job for family use."}, "1": {"Date": " Sep 6, 2016", "Summary": "\"Stressful, but not horrible.\"", "Pros": "A lot of opportunities to advance, a diverse environment, schedule flexibility. Insurance provided for some franchisee Dep. Heads", "Cons": "Can be very stressful. They will use you for everything if you're good."}, "2": {"Date": " Sep 7, 2016", "Summary": "\"McDonalds' Review\"", "Pros": "Flexible scheduleAble to change availability at any time (takes three weeks to take effect)Able to get time off whenever (three weeks in advance)", "Cons": "Not the best pay ($8 minimum)High turnover, many new employees most of the timeNo benefits and sometimes poor hours"}, "3": {"Date": " Aug 23, 2016", "Summary": "\"Great Job\"", "Pros": "Flexible hours, room for growth", "Cons": "Upper management was not able to communicate or relate well to staff members. Big hierarchy in place."}, "4": {"Date": " Sep 6, 2016", "Summary": "\"They work you hard for a little bit of money...\"", "Pros": "They have great food and the employees are hard workers", "Cons": "They work you hard for a little bit of money and they dont give you enough hours"}, "5": {"Date": " Aug 22, 2016", "Summary": "\"Not bad. However, management could do some improving\"", "Pros": "You can have a lot of fun with co-workers and even customers!", "Cons": "Not every employee are exactly hard-working, if not working at all"}, "6": {"Date": " Aug 23, 2016", "Summary": "\"Working at the corporate office\"", "Pros": "You get to wear many hats, in terms of roles played and considerations required for the work. The job has never been routine from year to year. You get to see the impact of your work at the restaurants.", "Cons": "The culture and structure is changing, so I cannot speak to the future. McDonald's can a difficult environment for new employees to navigate, due the the number of decision makers and stakeholders. Complaints from family and relatives when they have a bad visit at their local restaurant."}, "7": {"Date": " Sep 5, 2016", "Summary": "\"Cashier\"", "Pros": "Shift hours, the people in some way", "Cons": "The smell and food"}, "8": {"Date": " Sep 5, 2016", "Summary": "\"Great place for advancement from entry level.\"", "Pros": "Management training available from 30 days after hire.", "Cons": "Not looked upon as a job with any skill set."}, "9": {"Date": " Sep 26, 2016", "Summary": "\"TERRIBLE\"", "Pros": "there are no Pros to this job", "Cons": "Very low hours, bad management"}}