{"0": {"Date": " Dec 30, 2017", "Summary": "\"M.I.T.\"", "Pros": "Tuition Assistance and quick advancement for those who chose to embrace the job", "Cons": "Too many teens and young adults in one setting for an extended period of time=drama"}, "1": {"Date": " Dec 30, 2017", "Summary": "\"Crew\"", "Pros": "Gain customer experience, learn how to interact with customers", "Cons": "The attitudes from customers"}, "2": {"Date": " Dec 15, 2017", "Summary": "\"cook\"", "Pros": "fun place to work but I got a batter job.", "Cons": "I don't know of many cons. they were all honest folks."}, "3": {"Date": " Dec 15, 2017", "Summary": "\"I am a high school student my last year in high school looking for a after school job\"", "Pros": "I have work experiences and I am energetic", "Cons": "I would like the weekends off"}, "4": {"Date": " Jan 20, 2018", "Summary": "\"Okay for little while\"", "Pros": "Free food during the midnight shift", "Cons": "Boring Boring Boring Boring Boring"}, "5": {"Date": " Dec 16, 2017", "Summary": "\"Easy job, difficult people\"", "Pros": "As long as you get to the right store, it's like a family environment. Worked at one store for almost two years, even met my now boyfriend there. They did everything to make sure you were treated right and you felt like you were part of the family.", "Cons": "Be careful with certain stores. When I got transferred to a literal just built new location, everything went down south. No one had respect for each other and there was no teamwork. The managers decided to treat you like you are their slave. There's good stores and then there's those bad stores that make you wish you never got hired."}, "6": {"Date": " Dec 16, 2017", "Summary": "\"stocker, quick hands, sanitation\"", "Pros": "Quick thinker love teamwork hands on motivator", "Cons": "Transportation was my main problem"}, "7": {"Date": " Dec 29, 2017", "Summary": "\"Okay Job\"", "Pros": "Discounts, Flexible Hours based on school hours, etc", "Cons": "Horrible Managers, Full of Drama"}, "8": {"Date": " Dec 29, 2017", "Summary": "\"McDonald's review\"", "Pros": "Some great people to work with, regular customers add some interests in the day.", "Cons": "Very unorganized, schedule comes is spontaneously ready to be shown to the workers and sometimes it's not ready."}, "9": {"Date": " Dec 15, 2017", "Summary": "\"Former employee\"", "Pros": "My amazing crew, of course!!!", "Cons": "I can unfortunately, only speak English :("}}