{"0": {"Date": " Jun 24, 2016", "Summary": "\"Cashier\"", "Pros": "Enjoy working with the public, greeting customers and providing friendly service.", "Cons": "Not enough hours and pay is low."}, "1": {"Date": " Jul 8, 2016", "Summary": "\"Decent\"", "Pros": "Good pay, decent hours of work", "Cons": "Bad conditions, hot in kitchen"}, "2": {"Date": " Jun 22, 2016", "Summary": "\"Great place for a high school student\"", "Pros": "Great people and managers and never a dull day.", "Cons": "The pay wasnt the best."}, "3": {"Date": " Jul 29, 2016", "Summary": "\"McDonald's\"", "Pros": "Getting payed im always doing what i was told to do im always stocking up and cleaning i had no problem with anybody im always friendly to others always respect nd greet others when they come in.", "Cons": "I dont like it when thier always bossing me around. Always getting picked on. Thier taking advantage of me."}, "4": {"Date": " Jul 7, 2016", "Summary": "\"Crew Member... I am loving it!\"", "Pros": "Great managersGreat crew to get to know", "Cons": "No free mealsOnly half-off when you work"}, "5": {"Date": " Jul 7, 2016", "Summary": "\"May I take your order?\"", "Pros": "The good thing about working for this McDonalds is that you get to meet a lot of people.", "Cons": "The cons, the list is too long to write it down. This McDonald is located in So. Texas, what I know about this company I would have never applied."}, "6": {"Date": " Jul 7, 2016", "Summary": "\"No growth in company\"", "Pros": "Great crew , works with schedule", "Cons": "Management is horrible, favoritism is a big thing"}, "7": {"Date": " Jun 23, 2016", "Summary": "\"flexable\"", "Pros": "Enployee Mealcrew appreciation weekflexable hours", "Cons": "papay is lowhours can be random"}, "8": {"Date": " Jun 23, 2016", "Summary": "\"McDonald's\"", "Pros": "Provided fast service to customers", "Cons": "Disrespectful to some customers. Poor people"}, "9": {"Date": " Jul 6, 2016", "Summary": "\"Easy Money Fast Flexible\"", "Pros": "This job is very easy. Im able to get better hours than anywhere retail, and 8/hr is better than a lot of part time jobs. I work at a 24 hr. store and my availability changes a lot for school and my second job, the managers are SUPER flexible as long as you're friendly to guests, show up on time, suck up every once in a while and only check your phone every once in a while. Coworkers are friendly and the rude ones don't last too long at my store.", "Cons": "This job is very easy. I get really bored after 5 hours, usually I try not to work more than 6 because Ill start eating all of the nuggets or something. Customers can be so terrible and one even pulled a gun on my coworker, a lot of drunks come through too, and homeless people. You learn to ignore it but Ill pop off on someone every once in a while (and I get away with it because its shade this isn't the Ritz)"}}