{"0": {"Date": " Oct 27, 2016", "Summary": "\"Great Employees/Awful Management\"", "Pros": "-The workers were fun and energetic and loving-free/discounted food at intervals", "Cons": "-the kitchen staff would make constant mistakes that the chasier and runners would pay for with verbal abuse.-managers were good people, but recieved so much stress forced upon them they took it out on employees."}, "1": {"Date": " Oct 28, 2016", "Summary": "\"Good for high school kids\"", "Pros": "Flexible with my high school schedule, most managers I had were really nice. They always gave me holidays off. It was a decent first job. Got me experience in cash handling.", "Cons": "What you would expect. The general public is annoying. Got called in a lot. Stayed late a lot. But that's good if you want the extra hours."}, "2": {"Date": " Oct 12, 2016", "Summary": "\"Good place to work\"", "Pros": "Always room to grow if wanted", "Cons": "The uniforms are pretty bad"}, "3": {"Date": " Oct 13, 2016", "Summary": "\"certified manager\"", "Pros": "very professional flexible schedule", "Cons": "be able to talk with other managers that understand your point of view"}, "4": {"Date": " Oct 13, 2016", "Summary": "\"Clean the store and help cook food.\"", "Pros": "Great job for helping others and feeding the public, taking the time to listen to the needs of the customer and for filling their needs without personal opinion or view being used.", "Cons": "Employees treating each other like dogs and putting down employees in front of customers while looking for ways to stab them in the back, and get their friends hired in."}, "5": {"Date": " Nov 17, 2016", "Summary": "\"Review\"", "Pros": "Free food, nobody cares what you do", "Cons": "unorganized, dirty, will hire anyone off the street without doing a background check"}, "6": {"Date": " Oct 27, 2016", "Summary": "\"Crew Member\"", "Pros": "Excellent hours; decent benefits : work around school", "Cons": "Customers complain about everything! Upset about bar b que sauce when the order doesn't have chicken nuggets!"}, "7": {"Date": " Oct 27, 2016", "Summary": "\"Crew Member\"", "Pros": "A lot of the time it's not very busy, so you're just cleaning your station.", "Cons": "The schedule tend to be unpredictable, and sometimes unfair."}, "8": {"Date": " Oct 27, 2016", "Summary": "\"It was a good first job\"", "Pros": "You get to meet a lot of different and new peoplehalf of foodflexible schedule", "Cons": "you get treated like you're not a personcustomers can be very \"questionable\"the management suckedyou have to deal with a lot of ridiculous complaintsyou have to be able to learn fast"}, "9": {"Date": " Oct 28, 2016", "Summary": "\"Review\"", "Pros": "-You get a lot of hours-You get customer service experience-You learn how to work in a fast pace environment-You learn how to juggle multiple task", "Cons": "-Management changes a lot-Low pay"}}