{"0": {"Date": " Aug 18, 2016", "Summary": "\"This was my first job, but it still could've been better.\"", "Pros": "Plenty of available hours, if you're willing to ask for them. Great communication with most of the managers. Some organization.", "Cons": "There was a lot of favoritism going on in areas where there shouldn't have been any. A lot of the managers would go and sit in the office, rather than helping out like they should have been, especially when help was needed the most. They were too lenient with letting people call out, so we were short handed a lot of the time. The maintenance staff was allowed to walk around with headphones in a lot of the time. It was just very unprofessional."}, "1": {"Date": " Sep 8, 2016", "Summary": "\"no good\"", "Pros": "something to do not really a good place for advancment", "Cons": "if you sucking up you will get hours other than that no days which causes shifts to struggle"}, "2": {"Date": " Sep 9, 2016", "Summary": "\"It's a job that teaches you not to work at a job like this.\"", "Pros": "-Teamwork-Another word-Another word-Really there are no more pros-This place is terrible to work at and order from", "Cons": "-Sexual harassment-High intensity-Managers and employees don't care about doing things right by the customer, only doing things fast-High expectations of commitment for you with no leeway from them"}, "3": {"Date": " Aug 3, 2016", "Summary": "\"Working at McDonalds\"", "Pros": "Fast paced environment that pushes you out of your comfort zone. Being in such environment allows you to bond with your co-workers because you are empathetic to each other.", "Cons": "Long hours, standing a lot."}, "4": {"Date": " Aug 3, 2016", "Summary": "\"Pretty Standard Experience\"", "Pros": "They work with your schedule. I was a full time student and still got decent hours. They liked me because I showed up and did the job right. Job reviews and performance-based raises happened every six months. I liked the people I worked with, but most of them didn't stay that long. I felt like I was wanted, though, and that's important.", "Cons": "High turnover. Lack of employee motivation. Overworked managerial staff that can't dedicate enough time to employee needs. Pretty standard fast food industry stuff."}, "5": {"Date": " Aug 4, 2016", "Summary": "\"Ehhhh\"", "Pros": "Its a job, do not expect much. You get paid minimum", "Cons": "Its a job do not expect much from management"}, "6": {"Date": " Aug 2, 2016", "Summary": "\"Great job placement organization\"", "Pros": "Because there is always work ready", "Cons": "Sometimes the commute to some of the job sites is complicated"}, "7": {"Date": " Aug 2, 2016", "Summary": "\"McDonald's Cashier\"", "Pros": "It pays decently in Washington/Seattle thanks to wage raises", "Cons": "You have to work at McDonalds"}, "8": {"Date": " Sep 7, 2016", "Summary": "\"Long hours, terrible pay\"", "Pros": "Some of the people you meet are truly awesome, and are coming to you from a variety of experiences.", "Cons": "Combative environment, required by contract to work 60 hours (minimum) and brutally low pay. Impossible expectations (there have been numerous investigations that have found it is impossible to make a variety of menu items in the stated time allowed)."}, "9": {"Date": " Sep 8, 2016", "Summary": "\"Lake Wylie, SC the worst ever\"", "Pros": "Anyone can become a manager", "Cons": "Shift managers are great to work with, but he General Manager has not respect for anyone."}}