{"0": {"Date": " Dec 19, 2017", "Summary": "\"Balance\"", "Pros": "Good afternoon work hours offering flexibility.Team oriented group with a get it done approach. Positive environment but can be challenging at times.", "Cons": "Fast and chaotic at times A Hierarchy with Wages thatare low."}, "1": {"Date": " Jan 2, 2018", "Summary": "\"worked there for a summer\"", "Pros": "never a dull moment. always busy so theres something to do.", "Cons": "management was not organized. no communication. schedule was all over the place"}, "2": {"Date": " Dec 18, 2017", "Summary": "\"Crew member.\"", "Pros": "Would love to basically just get around and learn things about companies I just started working for.", "Cons": "Do to lack of high school diploma,G.e.d,and a college degree i'm still in the process of obtaining though job hirement is scarce."}, "3": {"Date": " Dec 19, 2017", "Summary": "\"I Genuinely Love What I Do As A Guest Experience Leader\"", "Pros": "+ Helping customers is genuinely satisfying and rewardingFrom my own experience, 85-90% of the customers I interact with are extremely polite, respectful, and well mannered. Helping them is a great feeling, and knowing that customers appreciate my hospitality also makes this a very rewarding position to have.+ Probably the easiest and most relaxed positions to have at McD's!When it gets busy, it does get a little hectic behind the scenes, but that only happens for the Breakfast, lunch, and dinner rush hours. Otherwise, it's nice, slow, relaxed, and just the right of customers come it at a given time.You'll be refilling people's coffees, help taking their orders at the kiosks and ring them up at the register, chat with the elder regulars who have interesting stories to tell, clean some tablets, etc.It's physically not a hard job at all. Your feet get a little sore at the end of the day, but what on-your-feet job doesn't?", "Cons": "- You will often be in charge of filling other people's roles when no one else can, and you'll get flak for itLike most positions in McDonald's, you're trained a bit in all roles. Cooking, using the register, taking orders out, etc. With this specific position, you can be assigned to any of these when no one else is able to fulfill that role at the moment.Being in charge of other people's roles isn't the issue, it's when other coworkers who don't know you're assigned to that role temporarily that will get mad at you for doing it despite being told to.No one's manning the registers? You'll do that, and it's not a big deal. Someone else doesn't know you're using their register, they get mad for you not being where you should be even if you don't need to be there at the moment. It can get annoying explaining yourself constantly, but that's only a tiny tiny con about this position."}, "4": {"Date": " Jan 23, 2018", "Summary": "\"Screen person\"", "Pros": "if You like making food doing things for customers so customers have a excellent experience", "Cons": "Managers need to learn how to talk about there employees to people and treat employees better"}, "5": {"Date": " Jan 3, 2018", "Summary": "\"Clean it up\"", "Pros": "Not many pros to talk about its an entry level job", "Cons": "You smell like the food"}, "6": {"Date": " Jan 3, 2018", "Summary": "\"Macdonalds work/life balance\"", "Pros": "Its a great start for kids to gain experience in the working world.", "Cons": "Very little tolerance for when \"life\" happens"}, "7": {"Date": " Jan 1, 2018", "Summary": "\"easy work, difficult people\"", "Pros": "simple and repetitive tasks, the easiest job youll ever have on paper", "Cons": "anxiety and stress will peak within the first 3 months. even the most social butterflies will eventually hate everyone who breathes."}, "8": {"Date": " Jan 2, 2018", "Summary": "\"cashier\"", "Pros": "the hours are not bad", "Cons": "people are not patient when they don't get what they want immediately"}, "9": {"Date": " Dec 17, 2017", "Summary": "\"McDonald’s makes a great first job for teens.\"", "Pros": "McDonald’s prepares you to become a very fast paced worker. Once you are moved to drive thru you are faced with serving food or taking orders and cash. You are constantly engaged in customer service.", "Cons": "Very long hours. Pay should definitely be better for the work you do. Majority of customers are very rude. Multitasking is a must, and breaks are a bit short."}}