{"0": {"Date": " Aug 3, 2017", "Summary": "\"McDonalds Lobby\"", "Pros": "Gaining knowledge about requirements and skills to help in life or for future jobs. Hard working crew. Great way to teach working under pressure.", "Cons": "Not strict enough to maintain work requirements. Too many people showing up late. Not strict on the people they hire."}, "1": {"Date": " Aug 3, 2017", "Summary": "\"10 year employee\"", "Pros": "Advancement opportunities, paid vacations, insurance, crew has very flexible hours to work with. 6 month reviews with pay increases based on performance.", "Cons": "My store is so focused on labor that they are making guests suffer with crappy service. I'm sorry, but it is impossible to give Gold Standard service with 3 crew people and a manager (myself) during dinner rush. You're expected to do all kinds of reports and walk-throughs but are never given time to do it."}, "2": {"Date": " Aug 3, 2017", "Summary": "\"Good\"", "Pros": "Flexible with school, good for first time job", "Cons": "Not getting many hours"}, "3": {"Date": " Aug 3, 2017", "Summary": "\"Review of an overall experience.\"", "Pros": "The crew I worked with were a decent group.", "Cons": "The pay was not what I was looking for."}, "4": {"Date": " Aug 17, 2017", "Summary": "\"swing management\"", "Pros": "Great benefits to move through company", "Cons": "pay is not enough. work to many hours"}, "5": {"Date": " Aug 17, 2017", "Summary": "\"Good Food, Bad Pay\"", "Pros": "You can get customer`s food which they dont pick up--For Free!", "Cons": "The food is bad--Like really bad"}, "6": {"Date": " Aug 17, 2017", "Summary": "\"Crew Worker\"", "Pros": "It was a good job for a high school student that needed experience.", "Cons": "Some managers need to enjoy what they do a little more."}, "7": {"Date": " Aug 18, 2017", "Summary": "\"Cashiers\"", "Pros": "Its a job and you get paid every 2 weeks", "Cons": "Only two times for drawer come up short you get fired seen one girl get fired and she was a great worker"}, "8": {"Date": " Aug 2, 2017", "Summary": "\"same old same old\"", "Pros": "really good work environment and i loved it", "Cons": "i hate the food a lot"}, "9": {"Date": " Sep 7, 2017", "Summary": "\"Horrible\"", "Pros": "Nothing at all horrible place", "Cons": "Rverything this place is horrible"}}