{"0": {"Date": " Feb 16, 2016", "Summary": "\"Good pay, bad managment\"", "Pros": "McDonald's gives good pay and is always on top of doing the best for their employees. Always got breaks and they alowed us to get drinks whenever.", "Cons": "The management is horrible, the low level managers hardly do their job and end up making us crew do it, they stay on their phone and good off but still give them selfs priority on getting hours."}, "1": {"Date": " Feb 16, 2016", "Summary": "\"good for those looking for extra cash\"", "Pros": "good for night time ppl", "Cons": "a lot of things to get use to"}, "2": {"Date": " Feb 16, 2016", "Summary": "\"Cashier\"", "Pros": "Pretty good atmosphere, decent people", "Cons": "Pay, hours, cleanliness, time, bathrooms"}, "3": {"Date": " Mar 2, 2016", "Summary": "\"ok company\"", "Pros": "Great co-workers. Flexable scheduling. Days off request usually honored", "Cons": "Dont get treated fairly. No repect from management"}, "4": {"Date": " Feb 15, 2016", "Summary": "\"cook\"", "Pros": "meet new people,learn how this restaurant runs, the benefits", "Cons": "sometimes you work at a really fast pace"}, "5": {"Date": " Mar 22, 2016", "Summary": "\"General manager\"", "Pros": "Salary based pay so you can easily manage bills with knowing what your income is.", "Cons": "No real personal time, low pay for work load and compared to other fast food restaurants, bad upper management,"}, "6": {"Date": " Feb 11, 2016", "Summary": "\"Great environment!\"", "Pros": "Great people, fun at work, great benefits", "Cons": "Nothing comes to mind as a con."}, "7": {"Date": " Feb 15, 2016", "Summary": "\"Good for first job!\"", "Pros": "Good job experience, you have the chance to be cross-trained, and learn some life lessons. Works around school schedule.", "Cons": "Manager's are not extensively interviewed and can be a manager from the first day if they applied and were accepted. Can be stressful and non motivative."}, "8": {"Date": " Feb 15, 2016", "Summary": "\"Been there for four months and still have a positive outcome.\"", "Pros": "The best reason of me working at Mc.donalds is, how if I do my job and do the stuff I got to do I get treated with the respect I diserve and they get the same back.", "Cons": "One of the challenges is definitely putting up with the mangers bad days. But I guess your gonna get that at any job."}, "9": {"Date": " Feb 16, 2016", "Summary": "\"Great company to work for when you have the right people in upper management\"", "Pros": "Great benefits and you get to model your own immediate environment", "Cons": "The wrong people in upper management can sometimes make the job impossible"}}