{"0": {"Date": " Feb 28, 2018", "Summary": "\"McDonald’s\"", "Pros": "Good for a first job lol", "Cons": "Personally I didn’t like it lol they want you to serve people like it’s a restaurant and it’s not"}, "1": {"Date": " Feb 28, 2018", "Summary": "\"Overall good place to join the work force.\"", "Pros": "Get to meet new people. Easy job to learn people skills and time management skills. People you work with and generally nice.", "Cons": "Customers think they know more than people who work there. Management can sometimes be favoritists and disregard good workplace ideas."}, "2": {"Date": " Mar 14, 2018", "Summary": "\"Okay place to work at\"", "Pros": "Co-workers and managers were good.", "Cons": "Pay was low, no vacation time"}, "3": {"Date": " Mar 14, 2018", "Summary": "\"Sanchez Family Corporation/Management\"", "Pros": "The owners of this franchise branch of Mcdonalds are very kind, they always treat their employees with respect and help them in areas of need.", "Cons": "Management can be all over the place. Never let you out at time you need to leave, even if you have school or other priorities. They act surprised when you tell them you have to leave early when you have school. Also, the break system is all over the place. Some enter at 8:30 and those who entered way earlier get their breaks hours after the ones who went in early."}, "4": {"Date": " Mar 15, 2018", "Summary": "\"The good / the bad\"", "Pros": "The people that I worked with was fun and funny.", "Cons": "Nothing was organized we didn’t get any hours"}, "5": {"Date": " Mar 14, 2018", "Summary": "\"crew member\"", "Pros": "discount on food delicious food", "Cons": "no benefits rude customers management is terrible"}, "6": {"Date": " Feb 27, 2018", "Summary": "\"Assistant Manager\"", "Pros": "Opportunity, free meals, people, flexibility", "Cons": "Benefits, hours, politics, pay could be better"}, "7": {"Date": " Feb 27, 2018", "Summary": "\"Crew Member\"", "Pros": "Being able to see new people, working with money, creating strong bonds with other crew members.", "Cons": "Standing for long periods at a time and little to no job training."}, "8": {"Date": " Mar 13, 2018", "Summary": "\"Team Member\"", "Pros": "Flexible Schedule, Solid pay, Free food", "Cons": "Unprofessional, unnecessary drama, childish ways"}, "9": {"Date": " Mar 13, 2018", "Summary": "\"It’s a very fast past environment to work in.\"", "Pros": "Lots of shift hours, if you want it.", "Cons": "Not much communication between employees and management, rude customers."}}