{"0": {"Date": " Dec 15, 2016", "Summary": "\"More Stress than Opportunities\"", "Pros": "Growing management experience, meeting a very diverse group of people (employees and customers), interesting and engaging management courses for different leadership levels (MIT, department manager capstone, etc)", "Cons": "Lack of resources: worked in a franchise, everybody was paid very poorly by the owner, as a store manager I did not receive adequate support to fill leadership gaps left from high turnover when previous store manager was terminated. Within the store, there was little to no control over wages employees receive, not providing much incentive to the workers. Bonuses were available, but the work required to hit these targets far outweighed their dollar amounts"}, "1": {"Date": " Dec 16, 2016", "Summary": "\"Not a good place to be\"", "Pros": "nothing everyone is bad they dont care about you only themselves, they make you work fast even if you are new and have never done this before", "Cons": "everyone is equally terrible every one was cursing and cracking jokes that aren't even funny wouldn't recommend to my worse enemy"}, "2": {"Date": " Nov 25, 2016", "Summary": "\"Okay\"", "Pros": "Positive work culture, amazing world class training program. Plenty of opportunity for overtime.", "Cons": "Not much room for advancement(unless someone quits)."}, "3": {"Date": " Nov 9, 2016", "Summary": "\"Crew Member\"", "Pros": "flexible schedules, fun coworkers, and a good job for a student. Understanding management that will work with your schedule. 50% off meals. Good first job.", "Cons": "minimum wage, and very little room to go above that. After a significant amount of time you can get a fifty cent raise, and that is usually it. Customers can be rude. Can be stressful when very busy."}, "4": {"Date": " Nov 9, 2016", "Summary": "\"Team Member Review\"", "Pros": "This was a pretty good first job. I didn't exactly love work, but it wasn't the worst job I've ever had. The amount of things to learn can be a little overwhelming if you have no fast food experience but is actually fairly easy to get down once you start working. My manager was a good guy, friendly and sometimes strict but hey, he was just doing his job.", "Cons": "Sometimes we would be understaffed and you left work smelling all greasy and gross. Also, it's really hot in the back."}, "5": {"Date": " Nov 9, 2016", "Summary": "\"Cashier\"", "Pros": "It's what you expect with very flexible hours", "Cons": "Sometimes people drop shifts and you have to take them so it gets a little annoying"}, "6": {"Date": " Nov 21, 2016", "Summary": "\"Cashier\"", "Pros": "Fairly easy. Everyone can do it", "Cons": "Tiring and repetition of works"}, "7": {"Date": " Nov 23, 2016", "Summary": "\"The Payyyy\"", "Pros": "The pay is pretty low but overall it is a great starter job and the fact the locations are pretty close to schools and stuff really helps out too", "Cons": "Most of your coworkers are rude and they leave you to do things by yourself. The pay is sorta terrible with the cut outs they take out on each pay check."}, "8": {"Date": " Nov 24, 2016", "Summary": "\"Cashier\"", "Pros": "Free food, and good employeers", "Cons": "No help with the training"}, "9": {"Date": " Nov 8, 2016", "Summary": "\"Admin\"", "Pros": "Fantastic Food and Perks, Work here!", "Cons": "Leave smelling like fries and shakes"}}