{"0": {"Date": " Jul 14, 2016", "Summary": "\"Mcdonals Review\"", "Pros": "Get to know how to do certain things and work all around the store. You understand how to speak up and work hard to succeed and learn life lessons at times.", "Cons": "Sometimes you make mistakes and can either mess you up badly for just a simple fix like customers are sometimes hard to handle."}, "1": {"Date": " Aug 18, 2016", "Summary": "\"unprofessional\"", "Pros": "there wasn't anything good about working here except that i developed thick skin from working here", "Cons": "everything was pretty bad from the employees, to the customers, and management as well"}, "2": {"Date": " Jul 28, 2016", "Summary": "\"Manager\"", "Pros": "They hire great peope for work", "Cons": "Old style of doing things"}, "3": {"Date": " Jul 28, 2016", "Summary": "\"Job review\"", "Pros": "Nice side job during college years", "Cons": "Low pay terrible management disorganized"}, "4": {"Date": " Jul 29, 2016", "Summary": "\"Cashier\"", "Pros": "Its really easy to do most of the tasks", "Cons": "You work like a horse but get paid little to nothing"}, "5": {"Date": " Jul 14, 2016", "Summary": "\"Pretty Cool\"", "Pros": "Had a great manager who never had a bad attitude", "Cons": "Pay was minimum wage but it was a good first job"}, "6": {"Date": " Jul 27, 2016", "Summary": "\"An okay first job\"", "Pros": "Not sure it was an okay job to start off with the hours were okay. If you're in need of a first job with customer service this one is it.", "Cons": "Haven't eaten mcds since working there. I hated going home smelling like beef and fries. The customers can be rude if they get their order wrong not you."}, "7": {"Date": " Jul 12, 2016", "Summary": "\"Crew\"", "Pros": "Awesome co-workers great food love it", "Cons": "They need bigger space in the kitchen"}, "8": {"Date": " Jul 12, 2016", "Summary": "\"Crew member.\"", "Pros": "Flexible hours, no matter what.", "Cons": "Misguided management, as well as improper training, sometimes."}, "9": {"Date": " Jul 13, 2016", "Summary": "\"Crew/ Crew Tainer\"", "Pros": "The Benefits. and the work Experience given", "Cons": "Missing out on the communication side. Sometimes lack of teamwork."}}