{"0": {"Date": " Oct 25, 2016", "Summary": "\"Decent\"", "Pros": "Got some money to spend while still in high school. Nice flexible hours. Workplace was not too cold or hot. Nice coworkers, most were friends at the local high school.", "Cons": "Low pay, as expected. Work could get out of hand quickly around lunch break or all the time on busy intersections. Didn't like the uniforms."}, "1": {"Date": " Oct 26, 2016", "Summary": "\"None\"", "Pros": "This offered an early morning shift, management for the most part was easy going and flexible if you needed time off", "Cons": "There were no set pay raises, health coverage was not an affordable option also there was little chance of advancement beyond the position you originally were hired for."}, "2": {"Date": " Oct 26, 2016", "Summary": "\"Stressed\"", "Pros": "A lot of time to move up in the company, a lot of good leadership and training roles available.", "Cons": "Managers are over worked and under paid for what they are expected to do"}, "3": {"Date": " Nov 8, 2016", "Summary": "\"Cashier\"", "Pros": "Very nice people to work with. Not much extra to do besides what you do on a daily basis. Overall a good environment in terms of employees.", "Cons": "Rude customers, can't talk back. Not enough pay for what you do. Managers can sometimes be mean."}, "4": {"Date": " Nov 8, 2016", "Summary": "\"Assistant Manager\"", "Pros": "Fast pace which helps day go faster. Amazing people to work for and with. Amazing customer base.", "Cons": "Promotions are infrequent. Need more pay for what you do."}, "5": {"Date": " Nov 8, 2016", "Summary": "\"Hard work\"", "Pros": "not many, ate some food but i wouldn't call that a pro", "Cons": "wage, attitude of customers,"}, "6": {"Date": " Nov 8, 2016", "Summary": "\"1st Job Experience\"", "Pros": "Working there was a great way to learn how to interact with different people and work in a fast-paced environment.", "Cons": "Although I set my maximum working hours at 25/week, they would constantly over schedule me to 30+ hours a week. Managers were sometimes rude and was not a fun work environment."}, "7": {"Date": " Oct 24, 2016", "Summary": "\"Decent sales\"", "Pros": "I learned a great deal of dealing with different people and was able to hone my customer service skills.", "Cons": "It got too slow at times and i felt like i wasnt working. I prefer to work hard when i am working."}, "8": {"Date": " Oct 25, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Build long lasting relationshipsGreat first jobManagement was very understanding", "Cons": "if you work 2nd shift 9 times out of 10 you will work 3rd shift too."}, "9": {"Date": " Nov 7, 2016", "Summary": "\"bad experience\"", "Pros": "met new people and flexible hours", "Cons": "bad managers. bad food. bad work appreciation."}}