{"0": {"Date": " Mar 26, 2017", "Summary": "\"Relaxed environment\"", "Pros": "Easy scheduling, flexible hours for all.", "Cons": "Dealing with people can get tough."}, "1": {"Date": " Apr 15, 2017", "Summary": "\"server\"", "Pros": "cool stuff and theyre nice and the manager was cool with everyone", "Cons": "there were annoying and th eoften mistreated eachother in an unprofessional work environment"}, "2": {"Date": " Mar 25, 2017", "Summary": "\"Job at McDOnald\"", "Pros": "They offer Good benifitsfor employees", "Cons": "Its become too stressful no concern for employees"}, "3": {"Date": " Mar 10, 2017", "Summary": "\"Department manager\"", "Pros": "Flexible schedule, Awesome people, Customers , crew", "Cons": "Pay, Rude Customers, a lot of Stress little pay"}, "4": {"Date": " Mar 24, 2017", "Summary": "\"My 2 Cents\"", "Pros": "Flexible hours, Overtime, easy job, employee meal discount", "Cons": "having to deal with all kinds of customers (typical in the service industry), not having enough employees at times which makes it hard for us to do our jobs"}, "5": {"Date": " Mar 9, 2017", "Summary": "\"Great company\"", "Pros": "Good work, good pay, needs are met for every employee", "Cons": "needs to focus on getting things done for employees to move up"}, "6": {"Date": " Apr 14, 2017", "Summary": "\"mcdonalds\"", "Pros": "no really any pros at all", "Cons": "was really bad horrible had terrible time"}, "7": {"Date": " Apr 14, 2017", "Summary": "\"yikes\"", "Pros": "it is very easy to get hired, if you are absolutely desperate for work then this is an option", "Cons": "I was 16 when I worked there, my manager was sexist and called me \"sexy lady\" and told me I had \"the body of a woman.\" After a year of working I received a 10 cent raise. Most of the upper management was very rude and spoke poorly to the employees. They also had illegal business practices like making employees clock out during the hours they were scheduled to work when business was slow. I believe management has changed hands since I worked there so hopefully these problems have been resolved"}, "8": {"Date": " Mar 9, 2017", "Summary": "\"i love it\"", "Pros": "it is good but i want a closer job", "Cons": "it is so far away"}, "9": {"Date": " Mar 23, 2017", "Summary": "\"Eh\"", "Pros": "Fun, good experience, learning experience", "Cons": "Loud, noisy, stressful, annoying customers"}}