{"0": {"Date": " Feb 11, 2016", "Summary": "\"Better than you'd think\"", "Pros": "Flexible hours, my GM would always work with me to pick the best schedule; Free food on breaks; Amazing training program that's interactive and fun; Supportive upper management; Fun environment, I am friends with many of my coworkers;", "Cons": "McDonald's corporate changes their ideas on how to improve the business a lot; as an upper manager I tend to have to work many random shifts and past the time I'm scheduled; little time for administrative work;"}, "1": {"Date": " Feb 11, 2016", "Summary": "\"Good High School Job\"", "Pros": "Good Hours, working 23 hours a week, going to school, and yet, I can still have a social lifeAdvancement Opportunities, started working drive thru, and I got a .50$ raiseAbility to request time off if your request 2 weeks in advance50% discount of food when working, 25% when notFree drinksFree meal tickets", "Cons": "It's difficult for the managers to get fired, so if your manager isn't doing a good job, you can expect to see that manager for a long timeManagers get mad when you take holidays off"}, "2": {"Date": " Feb 11, 2016", "Summary": "\"Okay\"", "Pros": "money, experience, uniforms, flexible hours", "Cons": "crazy people, fast paced, smell after shift,"}, "3": {"Date": " Feb 11, 2016", "Summary": "\"Hated working there\"", "Pros": "Easy to get hired with no education and no experience so good to gain experience there. Plus discount on the food.", "Cons": "No body likes to work so you have to practically work for everyone else. Managers dont respect you AT ALL. Very dirty place to work in. Rarely get a raise even if you are their BEST employee. I know its a changing schedule but if you ever NEED off they will not give it to you but when other girls ask for off guaranteed they will have it off. Ask anyone they will agree!!!"}, "4": {"Date": " Feb 12, 2016", "Summary": "\"Great 1st Job!\"", "Pros": "you learn a lot working a minimum wage job. the experience of interacting with people of all types and co-workers goes a long way. builds character. perfect for college students or people in high school. i paid all my books and classes by saving up my checks without financial aid.", "Cons": "fast paced, a lot of routine work, multitasking is hard. even after months of working there, i still stumble over small things. people are also ruthless, thinking mistakes are personal to them."}, "5": {"Date": " Feb 25, 2016", "Summary": "\"Crew Member\"", "Pros": "Time goes quick, so 8 hours doesn't really seem like 8 hours. My manager has been a great mentor to me years later.", "Cons": "The pay wasn't very good. If you don't like dealing with other people, this definitely is not for you. Hungry customers can be really angry."}, "6": {"Date": " Feb 25, 2016", "Summary": "\"Crew\"", "Pros": "Good paying job for the moment", "Cons": "Messy people to work with"}, "7": {"Date": " Feb 26, 2016", "Summary": "\"Cashier\"", "Pros": "Free food. Good people. Funny place to worl.", "Cons": "Customers are rude. DO NOT DO IT."}, "8": {"Date": " Feb 26, 2016", "Summary": "\"Cashier\"", "Pros": "Easy job and works around schedule", "Cons": "Difficult customers and gross environment"}, "9": {"Date": " Feb 10, 2016", "Summary": "\"Cook Job\"", "Pros": "It is a good starter job for high school kids.", "Cons": "Scheduled hours range from a few hours a week to working almost every day the next week."}}