{"0": {"Date": " Feb 23, 2017", "Summary": "\"Review\"", "Pros": "A relaxed environment, nice people,", "Cons": "An Uneasy schedule, miscommunication"}, "1": {"Date": " Feb 23, 2017", "Summary": "\"What you would expect working at a McDonald's\"", "Pros": "Free food, Free drinks, Free desserts", "Cons": "Some lower managers were kinda mean"}, "2": {"Date": " Feb 23, 2017", "Summary": "\"Asst manager\"", "Pros": "Great place to work at", "Cons": "Nothing Bab to say about them"}, "3": {"Date": " Mar 9, 2017", "Summary": "\"Meh\"", "Pros": "Free food, employee discount, flexible hours", "Cons": "Take a day off and you`re treated poorly, for the amount of the stress not paid enough, so understaffed you have to pick up the slack by working 2-3 positions."}, "4": {"Date": " Mar 9, 2017", "Summary": "\"Nothing Special\"", "Pros": "As a student this was a good summer job. Overall the job itself was easy. Coworkers were laid back and did their jobs, they were straight up, worked as a team, respectful to one another (unless you get on their bad side). As a new comer of course I was slow at first what to do, coworkers were willing to pick up my slack and they were also encouraging.", "Cons": "The only thing I didn't like about this job were the customers, not all but a handful of customers were rude and inconsiderate. A lot of customers don't treat Mcdonalds workers human beings."}, "5": {"Date": " Mar 10, 2017", "Summary": "\"Manager\"", "Pros": "Great opportunity to meet future potential employers/contacts if you have a great personality and really enjoy working with people. I enjoyed my job only because of my guest not so much co-workers.", "Cons": "Often you have to work with really immature, disrespectful, bias managers. Everyone thinks they're a manager."}, "6": {"Date": " Feb 22, 2017", "Summary": "\"CREW\"", "Pros": "A very maintained and clean safe environment.", "Cons": "need to work on services."}, "7": {"Date": " Mar 31, 2017", "Summary": "\"Terrible\"", "Pros": "I don't have anything positive to say about this company.", "Cons": "I quit after my first training shift, which was 4 hours. I showed up for my supposed to be \"first day of training\", but got thrown to the cash register in the front of the store, with no training! Mind you it was during the breakfast rush, and I stayed up there for my entire 4 hour shift, it was terrible! No training whatsoever and rude managers! Never had a job where I came home crying on the first day!"}, "8": {"Date": " Feb 22, 2017", "Summary": "\"Customer Service\"", "Pros": "Great family feel. Wonderful place to wrok.", "Cons": "Sometimes the management treat the customers poorly."}, "9": {"Date": " Mar 8, 2017", "Summary": "\"Work experience\"", "Pros": "Good starting payClose to home", "Cons": "During rushes things can get hectic"}}