{"0": {"Date": " May 2, 2017", "Summary": "\"Fry Cook\"", "Pros": "I was able to get free food", "Cons": "A lot of work to do."}, "1": {"Date": " May 2, 2017", "Summary": "\"Good\"", "Pros": "Good place to work, friendly environment", "Cons": "Too many long shifts and druggies"}, "2": {"Date": " May 2, 2017", "Summary": "\"Company\"", "Pros": "Benefits, Easy to transfer locations", "Cons": "The company reputation as a employer. Difficult to find hourly employees."}, "3": {"Date": " May 3, 2017", "Summary": "\"General Manager\"", "Pros": "People, Flexible scheduling, hiring, free food, travelling", "Cons": "Can become your life if you let it."}, "4": {"Date": " Apr 17, 2017", "Summary": "\"Crew Member\"", "Pros": "Awesome. Learned to work with all walks of life.", "Cons": "None. Wish could work and go to college."}, "5": {"Date": " May 23, 2017", "Summary": "\"Crew\"", "Pros": "Great as a first job, constantly needed for work, keeps worker occupied, improves memory by consistency, learn how to maintain a clean work area, helps with communication with the general public, willing to work around school when scheduling, and a somewhat friendly atmosphere.", "Cons": "Management was discriminating, complaints were not taken care of or looked into, treated as if you were forced to work there, harassment was over looked, wouldn't hire people for personal reasons, and management were careless."}, "6": {"Date": " May 24, 2017", "Summary": "\"Terribly Unfair and Poor Management\"", "Pros": "I could not find any Pros for this position. I guess I get more than nothing?", "Cons": "Terrible management... I hated it"}, "7": {"Date": " May 24, 2017", "Summary": "\"Crew Trainer\"", "Pros": "None they were not good leaders at all.", "Cons": "Racism &favoritism. Spanish workers were granted Overtime while other workers hours were being cut."}, "8": {"Date": " May 2, 2017", "Summary": "\"40th st McDonalds\"", "Pros": "No pros just horrible wish I could say more but Im to scared to relive my experience", "Cons": "Everything to the ice cream machine make it say machine to the fries just horrible, PSnot every McDonald's is bad just 40th St. Philadelphia pa"}, "9": {"Date": " Apr 17, 2017", "Summary": "\"Shift Manager\"", "Pros": "Good friendly team members and encountering friendly customers who seems to rely on great service.", "Cons": "The long hours and low pay are not a good way to recruit long term employees."}}