{"0": {"Date": " Dec 9, 2015", "Summary": "\"customer service\"", "Pros": "I did learn a lot about working with a team, improved my English. I worn a lot of hats in this job.", "Cons": "Very low salary, constant changes....sometime manager did not listen to employees."}, "1": {"Date": " Dec 9, 2015", "Summary": "\"Imperial Mcdonalds\"", "Pros": "good food, discounts, great management", "Cons": "bad computers, equipment needs updated, very small space"}, "2": {"Date": " Dec 9, 2015", "Summary": "\"McDonald's has amazing food and I'd eat there all the time\"", "Pros": "It would be great to work at McDonald's I have a friend who works at McDonald's she always tells me about how it's a great first time job. So that why I would like to try out", "Cons": "The cons about working at McDonald's is that they would work me all night and not have enough time for school I'd rather work after school"}, "3": {"Date": " Dec 9, 2015", "Summary": "\"McDonald's crew\"", "Pros": "Very fast-paced and always interacting with other people. Room for career advancement despite what most people think", "Cons": "Work became repetitive after a while (although most jobs are like that), and customers assume you are a lower class citizen because you work there and treat you accordingly (so you get a lot of very rude customers). Not great pay starting out (minimum wage)"}, "4": {"Date": " Dec 23, 2015", "Summary": "\"Crew Member\"", "Pros": "The experience just by serving the cutomers.", "Cons": "The employees that are not hte best but thats at every job its always going to be that one group or person that want ever stop annoying untill you fail."}, "5": {"Date": " Dec 23, 2015", "Summary": "\"McDonald's\"", "Pros": "Room for advancement even for younger employees.", "Cons": "Even with advancement, pay is not good."}, "6": {"Date": " Jan 13, 2016", "Summary": "\"crew member\"", "Pros": "A lot of hours, meet a lot of people, great for networking", "Cons": "Over worked, little pay, expect so much for little pay, some co-workers are immature, sometime did not get breaks if the day was very busy, does not care about co-workers, late responces"}, "7": {"Date": " Jan 14, 2016", "Summary": "\"Horrible\"", "Pros": "Good opportunities to advance if you want to spend your entire life in fast food. Training was not that hard and customers are friendly.", "Cons": "Terrible boss and employee relations. Nothing ever gets done right and they never follow the schedules that you give them. All over thumbs down."}, "8": {"Date": " Dec 8, 2015", "Summary": "\"Cashier\"", "Pros": "Hands on training, and patient staff. Work alongside some of the hardest working people you'll ever meet.", "Cons": "Pay raises are in the cents to quarters. The people you have to deal with."}, "9": {"Date": " Dec 8, 2015", "Summary": "\"Job\"", "Pros": "No skills required. Flexible work schedule and decent pay. Easy going supervisors overall great work atmosphere to gain some experience in", "Cons": "The customers can at times be very rude and overbearing. Again pay is decent not a lot considering no skills are required"}}