{"0": {"Date": " Jun 5, 2017", "Summary": "\"nice job\"", "Pros": "nice job to have during the summer for me while waiting for school to start. This job is for everybody, young , old and in between.", "Cons": "Can get a bit hectic at times and customers can try your patience. But that is with any job I suppose."}, "1": {"Date": " Jun 19, 2017", "Summary": "\"Decent\"", "Pros": "Flexibility with schedule, decent hours", "Cons": "Rude people high turnover rate"}, "2": {"Date": " Jun 19, 2017", "Summary": "\"Ok\"", "Pros": "Always have something to do, generous with work hours, good for first job experience, discount on food for lunch break", "Cons": "Can get very busy any day, extremely busy on Sunday's and Saturdays, inconsistent hours, told them I was available 9 to 7, regularly asked to close at midnight"}, "3": {"Date": " Jun 19, 2017", "Summary": "\"Mcdonalds Review\"", "Pros": "flexible hours, learn to make up for weak links in the chain", "Cons": "having to cover for others, sometimes can be a drag to get through the day"}, "4": {"Date": " Jun 20, 2017", "Summary": "\"mcdonalds\"", "Pros": "good first job for student", "Cons": "no cons at this time"}, "5": {"Date": " Jun 20, 2017", "Summary": "\"Decent place to work\"", "Pros": "Flexible schedule, team outings, fun coworkers", "Cons": "Pay is only minimum wage"}, "6": {"Date": " Jun 20, 2017", "Summary": "\"Was good untill\"", "Pros": "Free drinks and friendly employees.", "Cons": "Everything was fine untill we got a new manager and she ruined everything. She made me go in the kitchen everyday but my strengths were in customer service. She was also very rude about everything and did not follow procedure herself."}, "7": {"Date": " Jun 4, 2017", "Summary": "\"It's Mickey D's. What can you expect?\"", "Pros": "Nice people, relaxed environment. GM always wore wacky ties on Fridays.", "Cons": "Low pay. Sorry! But it's true!"}, "8": {"Date": " Jun 4, 2017", "Summary": "\"Good\"", "Pros": "The crew members are great they make working there better. My McDonald's is on a busy street it's very fast paced. There's never a boring day. I like that you can move up quickly. I was there the shortest amount of time of everyone and I was already offered a manager position.", "Cons": "It's always busy day or night. When you run out of a product the customers get really upset at you."}, "9": {"Date": " Jun 18, 2017", "Summary": "\"OK for highschoolers...\"", "Pros": "You develop a great relationship with frequent customers. Helping others is always rewarding.", "Cons": "Low hours, low pay. Too much high school drama from management. Call-in if you're sick and legally can't work and you get punished"}}