{"0": {"Date": " Jan 31, 2017", "Summary": "\"Dm\"", "Pros": "It's better that what you think. You get benefits as discount, bonuses, etc", "Cons": "May be stressful sometimes but all the jobs are :)"}, "1": {"Date": " Feb 1, 2017", "Summary": "\"Shift manager\"", "Pros": "They teach leadership. You always are learning new thing.and some of the benefits are great... Health insurance, u invest in stock. They have a family setting", "Cons": "They have no understanding when it comes to your family needs you too. Especially single mothers. U get no holidays off as a manager"}, "2": {"Date": " Jan 16, 2017", "Summary": "\"Great Jon\"", "Pros": "Great job to work for. Nice place", "Cons": "Great job to work for great place good people"}, "3": {"Date": " Jan 16, 2017", "Summary": "\"Shift Manager\"", "Pros": "I love communication with customers", "Cons": "Always worked weekends and nights and was always away from my family"}, "4": {"Date": " Jan 16, 2017", "Summary": "\"Crew\"", "Pros": "It's easy and fun yeah", "Cons": "People are mean lol Smily face"}, "5": {"Date": " Jan 16, 2017", "Summary": "\"Care trainer\"", "Pros": "Great place to work, good hours, etc!", "Cons": "Can be stressful and not well working with hours"}, "6": {"Date": " Jan 17, 2017", "Summary": "\"cashier\"", "Pros": "fun, loving work environment, would work there again", "Cons": "nothing to say bad about the job"}, "7": {"Date": " Feb 21, 2017", "Summary": "\"maintenance\"", "Pros": "people nice to get along with", "Cons": "management need some help being around employees"}, "8": {"Date": " Jan 31, 2017", "Summary": "\"Cashier\"", "Pros": "fun to be there sometimes all the time", "Cons": "lost of work fun at times"}, "9": {"Date": " Jan 16, 2017", "Summary": "\"Good job for a College Student\"", "Pros": "Flexable hours, free uniforms, free meals, free drinks, and you work with patient people. Our store often has themed days to boost morale!", "Cons": "Fast paced and stressful for those who are just looking to earn cash quick. It is a business and there is no hand holding or cushy work."}}