{"0": {"Date": " Jul 5, 2016", "Summary": "\"My experience as a worker in the fast food.\"", "Pros": "Decent pay.Free lunch.Nice employees.Great atmosphere.", "Cons": "Overworked.Horrible hours.Management will sweat you over the littlest things."}, "1": {"Date": " Jul 5, 2016", "Summary": "\"Cashier\"", "Pros": "I needed a job and they were hiring.", "Cons": "Not enough hours or pay."}, "2": {"Date": " Jul 5, 2016", "Summary": "\"Fast food not worth\"", "Pros": "Flexible hours free food somewhat", "Cons": "Bad management bad pay crappy job"}, "3": {"Date": " Jul 5, 2016", "Summary": "\"Cashier\"", "Pros": "- Good place to learn work ethic for young employees- Management is always supportive and helpful- Good training system so employees are aware of the duties of their job", "Cons": "- While the job is good for part-time workers, there was a high number of fulltime employees being paid a low minimum wage- The amount of menu items is ridiculous and employees often get overwhelmed- Shifts could get long and erratic. some would go 9 or 10 hours and I could find myself working at random times in the day."}, "4": {"Date": " Jun 20, 2016", "Summary": "\"cashier\"", "Pros": "awesome food and quick service", "Cons": "there are no cons of working at mcdonalds"}, "5": {"Date": " Jun 21, 2016", "Summary": "\"swing manager\"", "Pros": "you meet all sorts of people you get to deal with a diffeerent problem everyday", "Cons": "there is not adownside at mcdonalds"}, "6": {"Date": " Jul 26, 2016", "Summary": "\"Treated like used Toilet paper\"", "Pros": "Easy to get hired. I literally showed up to the interview after preparing extensively for everything. I was hired almost before I could utter a word.", "Cons": "You will get screamed at, cussed out, and spoken to like trash on the sidewalk over pennies, free water cups or cookies not being hot. And managers encourage employees to basically dehumanize themselves and be a punching bag for customers who have as much respect for you as they do for a dead bug. You can be a mother of three or a veteran and you could get spoken to in ways you never imagined. Be careful. This job is for incredibly thick-skinned people."}, "7": {"Date": " Jul 5, 2016", "Summary": "\"Instill better vaules\"", "Pros": "Free mealsGreat management and staff", "Cons": "Bad hoursHalf shiftsBetter choice of co workers"}, "8": {"Date": " Jul 6, 2016", "Summary": "\"Guest Service Manager\"", "Pros": "Very busy time goes by quickly!", "Cons": "Disrespectful young employees that think they know it all. Young managers that treat older managers with disrespect. Lack of cleanliness!"}, "9": {"Date": " Jun 16, 2016", "Summary": "\"Worker\"", "Pros": "Great benefits, good hours, fair compensation. Perks of the food, and the opportunities to move ahead in the corporate ladder.", "Cons": "Busy, customers can be rude sometimes. Overnight shifts can be tiring as well."}}