{"0": {"Date": " Apr 26, 2016", "Summary": "\"Alright\"", "Pros": "Has some good benefits for its employees, flexible scheduling, multiple locations, and management opportunities.", "Cons": "Pay scale is very low, health concerns for employees, availability of healthy employee meals, very demeaning employee training."}, "1": {"Date": " Apr 26, 2016", "Summary": "\"Awful Company\"", "Pros": "50% off food on days that you work", "Cons": "Everything else, the drama, the people, it's awful"}, "2": {"Date": " Apr 5, 2016", "Summary": "\"Shift Manager\"", "Pros": "Hours were convenient I guess. Love the repeat customers. $1 drinks.", "Cons": "To many to list, I would never take my family to my restaurant to eat. That sort of says everything you need to know."}, "3": {"Date": " Mar 20, 2016", "Summary": "\"Miscellaneous\"", "Pros": "Flexiable hours and a good job for a high school student", "Cons": "Working there was long, hot and not the greatest experience."}, "4": {"Date": " Mar 20, 2016", "Summary": "\"Salary\"", "Pros": "The management team is extremely helpful and supportive. The starting base salary is great and they allow you to take time off if needed.", "Cons": "The work itself can be very tedious and exhausting. Plus, the hours are very long and dealing with customers can be a pain"}, "5": {"Date": " Mar 21, 2016", "Summary": "\"Good start to a Resume\"", "Pros": "Great training, good start on an application especially if you can move up quickly", "Cons": "Bad management can put the employees down really fast. Especially when the managers do not follow their own rules set in place such as no cell phones out during work or to stay busy and clean as you go."}, "6": {"Date": " Apr 3, 2016", "Summary": "\"The job is quite good for earning some money to get off your feet, and much can be learnt from it.\"", "Pros": "The experiences with coworkers and how relaxed it is typically. Free food is also a benefit and very nice discounts. Some managers are lovely and really helpful.", "Cons": "The managers can range from very different levels of quality, with some not being exactly the best. Long hours can draw on as well, and dealing with customers sometimes can be rough."}, "7": {"Date": " Apr 3, 2016", "Summary": "\"Cashier\"", "Pros": "Great leadership, great people to work with", "Cons": "Low pay, high turnover. This is a good job for people who are starting"}, "8": {"Date": " Apr 3, 2016", "Summary": "\"part time\"", "Pros": "Good food free meals great training", "Cons": "More beneficial for young people and older Spanish workers. Friends of friends"}, "9": {"Date": " Apr 3, 2016", "Summary": "\"It is what it is\"", "Pros": "It's exactly what you would expect from a fast food restaurant. I really enjoyed my manager and coworkers they were fun and made the day go faster.", "Cons": "Long hours and terrible pay. A lot of the customers were rude and I felt belittled many times. One time when I was working at the drive through window someone played a prank on me and it ruined my day."}}