{"0": {"Date": " May 28, 2017", "Summary": "\"Breakfast cook\"", "Pros": "Meeting a lot of customers is the only high point of working there.", "Cons": "Received better offer but left due to unsafe conditions and bad management"}, "1": {"Date": " May 29, 2017", "Summary": "\"Ehhh\"", "Pros": "Work many hours, easy, learn everything quickly", "Cons": "Don't respect employees the one i worked at paid the managers poorly."}, "2": {"Date": " May 13, 2017", "Summary": "\"Decent Part Time Job\"", "Pros": "Extremely flexible scheduling, competitive wages compared to most other jobs, rather relaxed work as long as you keep on top of your orders, most managers are really friendly, there is an included free meal for your break", "Cons": "You're not allowed to sit down on your shift, even when it's not busy and everything is cleaned. You leave work really greasy."}, "3": {"Date": " May 13, 2017", "Summary": "\"Shift Supervisor\"", "Pros": "I'm a very good leader and strong at my position.", "Cons": "Everybody can always learn something new."}, "4": {"Date": " May 25, 2017", "Summary": "\"Great People, Poor Management\"", "Pros": "- Flexible to your schedule- Fun environment for the most part- Teamwork is encouraged- Good training- Good discount for shift meal- Clear understanding to advance. The opportunity is there", "Cons": "I only have one real complaint working there, management was awful. Constantly were understaffed and it made things much more stressful. Worse time was when I was working 4th of July and when evening came it was only me and two others. They only had us three scheduled to work so drive-through was a nightmare.Also became difficult to do my job due to impossible expectations. I would do what my manager asked me to do and while I do it they would get upset since I was not doing what I was originally doing. If we weren't so understaffed this wouldn't have been a problem.While I worked there, within a month 3 people quit. They all had similar complaints."}, "5": {"Date": " May 27, 2017", "Summary": "\".......\"", "Pros": "Depends on the shift you're working. If you work in the afternoons and mornings you aren't required to do much. If you open depending on the manager the night before your store is basically already opened for you. If you close well you don't often get the chance to take a break (because they schedule all the managers during the day) like anywhere else you're expected to do all of the cleaning. Day side will leave any and all messes for you to clean up.", "Cons": "Raises are few and far between. Managers can't call off. More is expected of you over time but without giving you more (ex. Raises, more paid time off, ect.)"}, "6": {"Date": " May 27, 2017", "Summary": "\"Crew member\"", "Pros": "I get paid every week", "Cons": "The custumers are rude and i don't get steady hours."}, "7": {"Date": " May 27, 2017", "Summary": "\"It was an okay first job\"", "Pros": "met some really cool people", "Cons": "dealing with rude customers, management"}, "8": {"Date": " May 12, 2017", "Summary": "\"Burgers are yummy\"", "Pros": "Plenty of burgers to eat", "Cons": "Customers are not very fun"}, "9": {"Date": " May 12, 2017", "Summary": "\"Department Manager\"", "Pros": "always friendly staff in McDonald's", "Cons": "Pay rate is very bad"}}