{"0": {"Date": " Aug 1, 2017", "Summary": "\"Cashier\"", "Pros": "Fun, Good hours, flexible hours", "Cons": "Hot conditions customers get annoying"}, "1": {"Date": " Aug 2, 2017", "Summary": "\"Cashier\"", "Pros": "very flexible schedulepay fair based on work expected", "Cons": "management can treat you like you're less of a person because of your postion"}, "2": {"Date": " Jul 17, 2017", "Summary": "\"👍🏾👍🏾👍🏾\"", "Pros": "Your pay is nice", "Cons": "You standing up all day in one spot"}, "3": {"Date": " Jul 17, 2017", "Summary": "\"great food\"", "Pros": "boss was lax and chill loved the staff too super funny", "Cons": "customers sometimes are crabby but thats okay"}, "4": {"Date": " Jul 17, 2017", "Summary": "\"Good employment for a part time job!\"", "Pros": "McDonald's allows people who just need a part time job to make extra money on the side.", "Cons": "Some of the managers were employed longer than they should have been."}, "5": {"Date": " Aug 2, 2017", "Summary": "\"taking advantage of you all the time\"", "Pros": "pay kind ofits mcdonalds, not really any pros", "Cons": "favoritismembarrassmentunderpaid overworked and greasefailed on promise for benefitsfailed promised tuition"}, "6": {"Date": " Jul 17, 2017", "Summary": "\"Cashier\"", "Pros": "Flexible scheduling was a great perk", "Cons": "I don't like the smell of hamburgers"}, "7": {"Date": " Jul 18, 2017", "Summary": "\"Review of McDonald's employment\"", "Pros": "One of the top pros to working for this company is flexible hours.", "Cons": "One of the top cons of working for this company would be a high turnover rate of fellow employees."}, "8": {"Date": " Jul 18, 2017", "Summary": "\"Great for first time jobs.\"", "Pros": "It gives you experience in customer service and gives you real world situations and helps you learn how to deal with them. It is good if you are a teenager and looking for a job for the weekend.", "Cons": "Cons depend on the exact store you are working at."}, "9": {"Date": " Jul 31, 2017", "Summary": "\"Fun first job, got worse with time.\"", "Pros": "If you have a fun manager and work off hours it's really fun since there are hardly any customers and you don't do a whole lot unless you're closing.", "Cons": "Typically either under or over staffed. When understaffed people would have more responsibilities than normal. Managers used to be cool but then two of them quit. Food got kinda gross to me after a while."}}