{"0": {"Date": " Oct 4, 2017", "Summary": "\"Crew\"", "Pros": "None, just a basic check for people needing it to start out.", "Cons": "Crappy job, you get paid for basic work."}, "1": {"Date": " Oct 4, 2017", "Summary": "\"terrible\"", "Pros": "none i could think of", "Cons": "they hate their customers. unclean working conditions"}, "2": {"Date": " Sep 13, 2017", "Summary": "\"Good\"", "Pros": "Good job for high school", "Cons": "It is not a long term job"}, "3": {"Date": " Aug 28, 2017", "Summary": "\"Marketing Manager\"", "Pros": "McDonald's is a great company that provides endless opportunities to people who are willing to work hard. Training is ongoing, which means you will continually grow your skillset and stretch your capabilities.", "Cons": "Workload can be tough sometimes. But the good news is that you are usually invested in the success of the projects that are piling up on your plate, which inspires you to keep going."}, "4": {"Date": " Aug 29, 2017", "Summary": "\"Ur store is slow and some of you guys need to change ur attitude but the is very busy and runs well\"", "Pros": "Good hours nice people fast pase when packed. Good food it's not badly made or made with a bad attitude", "Cons": "The customers being rude to a employee at the front counter for no reason at all. We never get breaks when we are working"}, "5": {"Date": " Sep 11, 2017", "Summary": "\"Review\"", "Pros": "Easy job responsibilties for cook", "Cons": "Very poor training for cook"}, "6": {"Date": " Sep 11, 2017", "Summary": "\"Tough life but can be rewarding.\"", "Pros": "Easy Interview, Flexible hours, Competitive Pay", "Cons": "Hard work not noticed, High turnover"}, "7": {"Date": " Sep 11, 2017", "Summary": "\"McDonalds\"", "Pros": "The co-workers are fun to work with depending on how good you get along with.", "Cons": "You never get the days you want off and the workers don't really come in. They do what they call a NO SHOW NO CALL. Which means they keep constantly calling you if you wanna come in and work. There is quite a lot of drama with the females."}, "8": {"Date": " Sep 11, 2017", "Summary": "\"Not America's Best First Job\"", "Pros": "Guaranteed lots of hours, opportunities for promotion", "Cons": "Working under idiots, bad pay, they take advantage of you, ignore OSHA laws"}, "9": {"Date": " Aug 27, 2017", "Summary": "\"Good First Job\"", "Pros": "Flexible hours , higher pay than most", "Cons": "They never keep good employees"}}