{"0": {"Date": " Apr 25, 2017", "Summary": "\"Mcreview\"", "Pros": "You are able to meet new people", "Cons": "It is hard to making a living working at McDonald's"}, "1": {"Date": " Apr 4, 2017", "Summary": "\"Good Experience\"", "Pros": "Meeting new people, good food", "Cons": "Rude customers, long hours"}, "2": {"Date": " Mar 20, 2017", "Summary": "\"the review would be\"", "Pros": "steady work, benefits as well", "Cons": "low pay, no advancement really"}, "3": {"Date": " Mar 21, 2017", "Summary": "\"Assistant Manager\"", "Pros": "You get what you put in to it", "Cons": "Hours may not be the best at time, sometimes work life balance is not the greatest."}, "4": {"Date": " Mar 21, 2017", "Summary": "\"McDonald's Review\"", "Pros": "A good starting job with a flexible schedule. A great way to start and learn about people and business in general.", "Cons": "Depending on where you work or how your manager is, you may have to do more than what is required of you, but this can also be considered as gaining experience."}, "5": {"Date": " Apr 3, 2017", "Summary": "\"Sweet and Sour\"", "Pros": "McDonald's has a lot of pros to working there if you get a location that has a good SM/GM, ASM, and shift managers. This store has several helpful managers.The pay is above-average for the location. The discount is nice if you're struggling. The system is easy enough to use. They are accommodating with the scheduling for people who have restrictions. They are helpful with transportation issues. There are plenty of hours because the store is a high-volume location.", "Cons": "Mostly young people work there, so you have to deal with a lot of immaturity. Your boss might be 12. Just kidding, but he might be 18. Older people may act out like kids, too. You may act like a kid one day after you've had enough.Customers can be very rude and leave nasty presents in the bathroom. Make sure you can handle doing humble work and hearing unkind words before you sign up for this gig. Be prepared for high school. You can make it if you like customer service that much. You'll need lots of patience, and you'll need to be willing to forgive others on a daily basis."}, "6": {"Date": " Apr 3, 2017", "Summary": "\"Don't Give Too Much\"", "Pros": "It can be a very rewarding and fast paced, fun place to work.", "Cons": "Most stores have their own \"in-crowd\" full of drama and gossip."}, "7": {"Date": " Apr 3, 2017", "Summary": "\"Worked the Window\"", "Pros": "Easy Job and access to tasty food.", "Cons": "Poor work environment with low pay"}, "8": {"Date": " Apr 24, 2017", "Summary": "\"You can always do better\"", "Pros": "half off foodmade good friends", "Cons": "horrible mangersyou are nothing but labor"}, "9": {"Date": " Apr 3, 2017", "Summary": "\"Incredibly emotionally draining, independent of pay schedule.\"", "Pros": "- Getting hired was almost absurdly easy (many locations have on the spot interviews on certain days)- Very engaging and pleasantly paced when working with the right people (ie. Not the general manager)- At least one of the managers was very reassuring and worked to place employees in positions where they were comfortable working (ie. Placing more naturally outgoing individuals at the front register, more shy individuals on fry duty or assembly duty, allowing trainees to work more stressful and complicated jobs during slower periods rather than forcing them into the drive thru during peak operating hours and reprimanding them for their performance, etc) at no cost to the efficiency of the store, while most managers were pleasant or tolerable to work under- Very flexible hours so long as you give advance notice of days you need off", "Cons": "- General Manager constantly reprimanding other employees and I for small infractions, very rarely offering constructive criticism (is not uncommon to come into work feeling down only to be reprimanded for being gloomy, and then being threatened with termination for not being able to feign happiness after being harshly criticized)- Manager would often chastise other employees behind their backs to other employees, even crew members (I was often told not to act like X employee or how \"[expletive]\" of an attitude Y employee had)- Not at all forgiving or well-suited to those that have external sources of stress or cannot deal with rude management, if happiness cannot be feigned then you will be reprimanded and/or terminated- Will very rarely be given an accurate perception of your progress or performance, it seems the highest echelon of management is more focused on \"weeding out\" poor performers than it is helping them improve. Expect to be threatened with termination to incentivise improvement, and to be subject to undue scrutiny if the manager doesn't like you on a personal level"}}