{"0": {"Date": " Oct 11, 2017", "Summary": "\"mcdonalsds cashier\"", "Pros": "i got a lot of hours and they were all nice", "Cons": "the rude customers and sometimes drama"}, "1": {"Date": " Oct 11, 2017", "Summary": "\"Idk\"", "Pros": "salary, meet new people, and the discounts.", "Cons": "Managers, too many workers, unappreciated."}, "2": {"Date": " Oct 11, 2017", "Summary": "\"Entry-Level ok\"", "Pros": "Entry-level, basic work for anybody looking for their first job. Nice people", "Cons": "Can be fast paced and stressful. Customers can be very unreasonable"}, "3": {"Date": " Sep 25, 2017", "Summary": "\"Cashier\"", "Pros": "discount on food, helped you with school and a good job for your first job", "Cons": "Manager didn't keep restaurant clean and yelled at her employees"}, "4": {"Date": " Sep 26, 2017", "Summary": "\"McDonald's\"", "Pros": "Flexible, great high school job to have and work after school or on weekends.", "Cons": "Terrible benefits and little pay. Also, work meals should be 100% paid for after a shift."}, "5": {"Date": " Sep 26, 2017", "Summary": "\"Overall good experience\"", "Pros": "Flexible schedules, easy work, nice coworkers; worked in high school and had another job, and the management was mostly accepting of my hectic schedule. Work was often pretty laid back, mostly worked the closing shifts with a lot of other young people. It was a really good learning experience, I worked there long enough that I got to train new employees and really got the hang of everything.", "Cons": "Management was a hit or miss, some managers were really nice, others not so much. Some coworkers were nice, some were high a lot of the time. Customers can be mean sometimes too. Manager would call me into a shift at the last minute \"Hey can you work in 15 minutes?\" a lot of the time we were understaffed"}, "6": {"Date": " Oct 31, 2017", "Summary": "\"cashier\"", "Pros": "it helped me be motivated", "Cons": "the reason why i left was because the last Gm dave was a little to touchy"}, "7": {"Date": " Oct 10, 2017", "Summary": "\"only if you're desperate\"", "Pros": "Stable employment (if you're willing to stay), interesting people", "Cons": "mediocre pay , horrible under-staffing, and dealing with terrible human beings on a regular basis"}, "8": {"Date": " Oct 10, 2017", "Summary": "\"Crew Member\"", "Pros": "Good first job experience, trains you how to deal with people on a professional level. Usually fun people to work with.", "Cons": "Very fast paced, stressful, always smell like french fries."}, "9": {"Date": " Sep 25, 2017", "Summary": "\"Group interview . Store manager and assistant store manager were doing the interview.\"", "Pros": "you get free lunch during break.you get employee discount.", "Cons": "they don't pay you enough for the hours you worked"}}