{"0": {"Date": " Jan 11, 2018", "Summary": "\"A\"", "Pros": "I loved being at this job. I loved being at this job.", "Cons": "I dont have any, at all. I dont have any, at all"}, "1": {"Date": " Jan 11, 2018", "Summary": "\"Management\"", "Pros": "A great place to work and learn. Great customers and food. Good variety and faat paced wirkplace. Flexible schedule.", "Cons": "None. It ia a great place to work and learn. Great customers and food. Good variety and faat paced wirkplace. Flexible schedule."}, "2": {"Date": " Jan 12, 2018", "Summary": "\"Great place to start working\"", "Pros": "Flexible hours lets you have time", "Cons": "Horrible employees and customers that just are bad"}, "3": {"Date": " Jan 12, 2018", "Summary": "\"Not real.\"", "Pros": "Food chicken sandwiches so dope", "Cons": "Pay low for hard jon"}, "4": {"Date": " Feb 17, 2018", "Summary": "\"Horrible\"", "Pros": "None at all, I wouldn't recommend", "Cons": "The whole job is a con I ABSOLUTELY hate working there"}, "5": {"Date": " Jan 11, 2018", "Summary": "\"Crew member\"", "Pros": "Everyone tries there best to assess to the customers needs. The managers are respectful and get the job done. Not every order is perfect but they always try to make sure the customer is satisfied weather it’s giving them free food or discounts.", "Cons": "It can get pretty rough during lunch hour and everything is very chaotic. Things will still on the floor and sometimes there’s simply no time to get it up. Being short on staff can really hurt the restaurant but also having over staff."}, "6": {"Date": " Jan 11, 2018", "Summary": "\"like it\"", "Pros": "Awesome, interesting, cool, fun, exciting", "Cons": "tiring, full, mean, decent, enjoying."}, "7": {"Date": " Jan 11, 2018", "Summary": "\"Chef\"", "Pros": "Good overall work environment with great leadership", "Cons": "Not much upward mobility, low pay"}, "8": {"Date": " Jan 26, 2018", "Summary": "\"None\"", "Pros": "Everyone is nice to each other and there is always constant motivation in the work place.", "Cons": "When working fast food, one has to be fast. And if there is someone not doing their job, the someone else has to."}, "9": {"Date": " Jan 10, 2018", "Summary": "\"Swing Shift Manager\"", "Pros": "Flexible Schedules , Great Pay, Full on Experience , The staff and food is great", "Cons": "Stressed out from orders, wrong order or meals being taken out , angry customers and phone calls"}}