{"0": {"Date": " Sep 24, 2017", "Summary": "\"Cashier\"", "Pros": "They will help you will your work and also help you futher your education.", "Cons": "there were no cons at all."}, "1": {"Date": " Sep 23, 2017", "Summary": "\"The manager hates me and won't give my job back. And I did overtime 5 days in a row the week I got my last paycheck.\"", "Pros": "Free lunch at work friends with some employees. And I gave good customer service.", "Cons": "I do a lot of overtime and they still docked me on my last pay check."}, "2": {"Date": " Sep 24, 2017", "Summary": "\"great place to work -- recommend\"", "Pros": "management are motivated and high energy", "Cons": "dont always try to get the most out of people"}, "3": {"Date": " Sep 24, 2017", "Summary": "\"Restaurant crew\"", "Pros": "Get discounted food and enjoy your working with crew and built new responsibilities", "Cons": "Customers with attitude's. under paid and overworked and not enough workers."}, "4": {"Date": " Oct 7, 2017", "Summary": "\"Fine for patient people\"", "Pros": "Management willing to work with you, good benefits, good place to start.", "Cons": "Too fast pacedStressful environmentRude Customers"}, "5": {"Date": " Oct 8, 2017", "Summary": "\"my review\"", "Pros": "Its a job that always keeps you busy and on your feet.", "Cons": "Its not as organized as it could be."}, "6": {"Date": " Sep 22, 2017", "Summary": "\"Cashier\"", "Pros": "They treat you with respect and help you out when you need to and care about their workers", "Cons": "I didn't have any problems when I worked at McDonalds"}, "7": {"Date": " Sep 22, 2017", "Summary": "\"GOod job\"", "Pros": "It was a job a good job", "Cons": "SOmetimes it was hard to do it"}, "8": {"Date": " Sep 22, 2017", "Summary": "\"Alright\"", "Pros": "Good way to make money in high school. Not too busy or hard to learn.", "Cons": "Sometimes scheduling shifts were unpredictable."}, "9": {"Date": " Oct 6, 2017", "Summary": "\"I enjoyed the position\"", "Pros": "Advancement opportunities, locally owned and operated, excellent training materials, fun job and rewarding career. I really enjoyed working for the owner of the store I worked at.", "Cons": "Salaried positions can be difficult because working more than the scheduled hours gets you nowhere. No more money than if you worked the scheduled hours."}}