{"0": {"Date": " Jan 16, 2016", "Summary": "\"Ok Job\"", "Pros": "work with schedule, can move up pretty fast, as a manager classes count as college credits", "Cons": "not enough pay even as a assistant store manager, bonus depends on the owner you work for along with all the other benefits"}, "1": {"Date": " Jan 17, 2016", "Summary": "\"Cook\"", "Pros": "A good start to earning money", "Cons": "No real scale of pay grade.No true voice of employee to employer for problem situations,"}, "2": {"Date": " Jan 1, 2016", "Summary": "\"It's worth it\"", "Pros": "Very comfortable environment. Most of the time it is enjoyable, interacting with customers. Time schedule were real flexible.", "Cons": "Sometimes the pressure can get really high, causing you to become stressed. Other employers may call out sick so you would have to over their shift."}, "3": {"Date": " Jan 2, 2016", "Summary": "\"mcdonalds\"", "Pros": "Flexible hours, friendly staff, great opportunities for promotions.", "Cons": "very hot, sometimes work long shifts."}, "4": {"Date": " Jan 15, 2016", "Summary": "\"Hey it's a job. That gets some money in your pocket\"", "Pros": "The experience and hours. If open 24 hrs", "Cons": "Payment wage. Looking at roughly 350 every two weeks working 5 or 6 days a week."}, "5": {"Date": " Dec 31, 2015", "Summary": "\"Crew member\"", "Pros": "All of the people in the community are very kind and polite. You will have a lot of fun.", "Cons": "The days may seem a little bit long but it's worth it."}, "6": {"Date": " Dec 31, 2015", "Summary": "\"McDonald's review\"", "Pros": "The co-workers are great and very niceThe job is fast pacedEveryday you go in with a tangible goal", "Cons": "The customers don't always treat you with respectIt can get very stressful during busy times"}, "7": {"Date": " Feb 5, 2016", "Summary": "\"Horrible place to work at\"", "Pros": "There wasn't any From the beginning", "Cons": "Mice and cockroaches crawling everywhere and the manager tells you it's alright, favoritism, if your the hardest worker they make you do everything and hate you, too may cliques like high school, managers talk too much, they make up too many lies, they tell one thing and when it happens try to lie and say they never said that, if you say one small thing wrong they will cut all your hours (I was barely working 8-12 hours a week), the place is too corrupted"}, "8": {"Date": " Feb 4, 2016", "Summary": "\"Crew trainer\"", "Pros": "Flexible hours, adapt to school schedules", "Cons": "non healthy work environment"}, "9": {"Date": " Jan 1, 2016", "Summary": "\"McDonald's\"", "Pros": "Friendly co-workers make the job fun along with great managers that get the job done.", "Cons": "There are not very many job opportunities while working at McDonald's unless you shine brighter than others in a very strong way."}}