{"0": {"Date": " Oct 15, 2017", "Summary": "\"Part Time Cook\"", "Pros": "I really enjoyed my co-workers. The management also had a style that really helped me as a new worker.", "Cons": "Their were times when employees would give attitudes to other co-workers making the environment hostil."}, "1": {"Date": " Oct 14, 2017", "Summary": "\"Working there\"", "Pros": "I like working there. I’m 15 so I currently get $9/h which is enough for me.", "Cons": "I get anxiety from how busy it gets but it’s ok."}, "2": {"Date": " Oct 15, 2017", "Summary": "\"Assistant manager\"", "Pros": "Family atmosphere. Good pay. Clean restaurant.", "Cons": "Night work. Not enough crew at times."}, "3": {"Date": " Nov 19, 2017", "Summary": "\"The McDonald's on Cottage Hill and Schillinger.\"", "Pros": "There were no pros that I can currently think of that came from working, or made it worth working at the McDonald's on Cottage Hill and Schillinger. Mobile, AL.", "Cons": "The majority of the managers at my old work establishment harassed me, both sexually and non, discriminated against me, forced me to work over 7 hour shifts without even a 15 minute break, tormented me, endangered the employees as well as refused to give me an accident report paper to file after I had hit my head after fainting while I was working on the Grill Team (due to the fact that they refused to have the AC fixed), and they locked me in the building. I was only 16 at the time when I was working there, a minor."}, "4": {"Date": " Nov 19, 2017", "Summary": "\"Don’t work here\"", "Pros": "Felon aporoved. A way to make money", "Cons": "Everything. They work you to the bone for little pay and don’t require franchises to increase pay"}, "5": {"Date": " Oct 15, 2017", "Summary": "\"Crew Member\"", "Pros": "Good start for work experience", "Cons": "There were miscommunication between crew members"}, "6": {"Date": " Oct 13, 2017", "Summary": "\"McDonalds\"", "Pros": "Learn to make food good.", "Cons": "Lunchtime gets really really busy"}, "7": {"Date": " Nov 18, 2017", "Summary": "\"Prevents you from planning your week\"", "Pros": "Better than being unemployed if you really need a job", "Cons": "Minimum wage. Also had to call in everyday to see if I was going to come in, preventing me from having ownership of my own time."}, "8": {"Date": " Oct 13, 2017", "Summary": "\"McDonalds\"", "Pros": "decent payflexible scheduledfree uniformfree mealentry levelpotential for raisewill pay up to 750 for college", "Cons": "seldom get promised brakesnight shift always understaffedunrealistic goals for the time allottedcomplaints about managers go unnoticedconsumers will treat you worse than you ever though possiblepeople blame you personal for the menu pricescustomers lie often for free food"}, "9": {"Date": " Oct 27, 2017", "Summary": "\"Pros and Cons\"", "Pros": "- It's the best to work on morning because it's not that busy and you only sell breakfast so its really less work- You can enhance or develop socializing skills", "Cons": "- They sometimes forced you to stay longer than your shift and wait for someone to cover you which takes an hour or more.- They don't pay right, they lack like 1-2 hours pay so most likely around $20 dollars"}}