{"0": {"Date": " Apr 18, 2016", "Summary": "\"Constant work\"", "Pros": "Easily attainable job, doesn't require much expertise or skill and great job for young teenagers. This is just at most and at best a good part-time job.", "Cons": "Can never not do anything. You must always be actively doing something even if the restaurant is completely empty. You have to stand and wipe counter tops or clean the bathroom despite it already being clean."}, "1": {"Date": " Apr 18, 2016", "Summary": "\"Store associate\"", "Pros": "They have flexible hours and pretty low skill work. Laid back most of the time. Lots of extra food", "Cons": "Its fast food. People are annoying. High turnover of employees. Rushes are horrible"}, "2": {"Date": " Apr 3, 2016", "Summary": "\"Being a General Manager\"", "Pros": "Flexible schedules, independence, great team, fun", "Cons": "Crew paid minimum wages, limited advancement through franchise restaurant, always on call, stressful"}, "3": {"Date": " Apr 3, 2016", "Summary": "\"Crew Member\"", "Pros": "You learn how to work in a team and how to work well with a variety of ethnicity. Also they are very flexible with your school schedule.", "Cons": "Cons is it gets very busy sometimes and need to work very fast and under pressure."}, "4": {"Date": " Apr 3, 2016", "Summary": "\"Good experience\"", "Pros": "All the workers were friendly and welcoming. Everybody was responsible, doing their own duties. Good environment, but very busy.", "Cons": "The fast-food restaurant was not as organized as I hoped it would be. Could use some more staff to keep up with the fast past environment."}, "5": {"Date": " Apr 4, 2016", "Summary": "\"Operational Manager\"", "Pros": "Lots of room to grow and excel", "Cons": "You have to know how to deal with alot at 1 time."}, "6": {"Date": " Apr 17, 2016", "Summary": "\"crew member\"", "Pros": "Flexible hours and all meant well.", "Cons": "Low pay and managers allowing to much employee turnover."}, "7": {"Date": " Apr 18, 2016", "Summary": "\"Easyish\"", "Pros": "Easy, free food, flexible schedule, cool people", "Cons": "Rude customers, some sloppy co workers, rude to customers if they get mad when THEY mess the food up"}, "8": {"Date": " Apr 2, 2016", "Summary": "\"Crew member\"", "Pros": "Great food, good Costumer service,", "Cons": "Standing all day sometimes can be hot angry costumers"}, "9": {"Date": " May 8, 2016", "Summary": "\"Worst Experience of my life\"", "Pros": "If you enjoy working with people that have no brains in their head, feel free to work there. NO PROS FOR THIS COMPANY WHAT SO EVER", "Cons": "You work with people that are back stabbers, they rip you to shreds and chew you out In front of customers. The past 4 years I was there, I had a new manager every year. They are money hungry, NO benefits for anyone. They finally became a little competitive last year with PTO. Other than that, nothing.The managers don't know how to manage. Anyone that isn't a vegetable can be promoted to a manager. There was a 21 - year old manager at the store that I worked at and DIDN'T know how to manage. She was a complete jerk. You know, if you're going to make someone a manager, train them correctly and have them buy a new attitude. Cuz hers was horrible and she was the reason WHY I quit. Better yet, everyone there should take a leadership101 course and pass it. That's what that company needs.No encouragement from the management whatsoever. They yell at you when you do something bad and don't complement you enough when you do something GOOD.If you are a GM and you want to \"change\" the store, I suggest that you get to know your employees before you decide to \"like\" everyone. You have no idea what kind of people you have working for you.Managers always pick favorites there. You can tell really quick who is their favorite."}}