{"0": {"Date": " Aug 19, 2017", "Summary": "\"no way\"", "Pros": "the job was pretty easy", "Cons": "crappy people every where i went"}, "1": {"Date": " Aug 4, 2017", "Summary": "\"It was ok\"", "Pros": "Free crew member lunch and 30 minute break", "Cons": "There's way too much drama"}, "2": {"Date": " Aug 4, 2017", "Summary": "\"Good\"", "Pros": "Great crewPlenty of hoursEasy workVery flexible", "Cons": "Customers occasionally rude or uneducated"}, "3": {"Date": " Aug 5, 2017", "Summary": "\"Crew member\"", "Pros": "Flexible schedule, great hours,insurance benefits, paid vacation, friendly CO workers", "Cons": "A lot of physical labor and you have to be extremely fast at everything"}, "4": {"Date": " Aug 18, 2017", "Summary": "\"Good Start\"", "Pros": "Flexible hours with good benefits. Pay is decent but many opportunities to grow.", "Cons": "Very fast paced environment. Initial pay is not enough to live on and is undesirable to new crew leading to short staffed."}, "5": {"Date": " Aug 18, 2017", "Summary": "\"sucked\"", "Pros": "you got to make friends", "Cons": "pay was bad but whatever"}, "6": {"Date": " Aug 18, 2017", "Summary": "\"Fast food\"", "Pros": "Fast paced and flexible hours", "Cons": "Very little pay for shift leaders and minimal raises."}, "7": {"Date": " Aug 4, 2017", "Summary": "\"Takes all you can give, compensates better than anyone else.\"", "Pros": "Compensation is unrivaled in the industry; Challenging environment", "Cons": "Long hours; Challenging environment; Large division"}, "8": {"Date": " Aug 18, 2017", "Summary": "\"Low pay, high expectations\"", "Pros": "I worked with some wonderful people, had some wonderful regulars for customers, got to practice my spanish.", "Cons": "Incredibly low rate of pay even for a shift manager. The store I worked at had absolutely no enforcement when it came to tradies and no shows. Was often told I would receive bonuses and raises bit never did. No work life balance at all, watched many single moms have to choose between their child and the job. No screening on who they promote, had a manager who was verbally abusive to customers and employees but management did nothing despite numerous complaints."}, "9": {"Date": " Aug 19, 2017", "Summary": "\"Admin\"", "Pros": "Used to be a company that valued their people but that's changed now.Benefits are pretty good", "Cons": "New leadership got the job done for the stockholders but is losing their talented employees now due to culture shift (outsourcing) and the move downtown."}}