{"0": {"Date": " Jan 25, 2016", "Summary": "\"McDonald's company\"", "Pros": "Flexible scheduleCareer advancement opportunitiesTreats you like family", "Cons": "Low payNot full-time unless managementNo benefits unless management"}, "1": {"Date": " Jan 25, 2016", "Summary": "\"Ehh not working for this store again\"", "Pros": "The management team was wonderful", "Cons": "Pay your employees with 10 years of experience more than $7.50 per hour!!!!"}, "2": {"Date": " Jan 25, 2016", "Summary": "\"Good first job, wouldn't recommend to stay unless you are a salary paid position.\"", "Pros": "Great for school, part time, easy advancement, pays for higher education within the store, good training at the fenton location in 2009.", "Cons": "Horrible customers, poor to none raises, managers aren't paid enough to work as hard as they do, always working overtime, under staffed to make sales, high expectations while working with incompetent employees. Long story short, if you work hard the return doesn't come back...."}, "3": {"Date": " Jan 25, 2016", "Summary": "\"cashier\"", "Pros": "Good hours set schedule sometimes", "Cons": "Treat you like slaves never get noticed"}, "4": {"Date": " Jan 26, 2016", "Summary": "\"Eh\"", "Pros": "BreaksFlexiable with timeminimum wage but not difficult work", "Cons": "Customers often rudeNot idealCleaning bathroomsEarly/Late hours"}, "5": {"Date": " Jan 26, 2016", "Summary": "\"not so hot\"", "Pros": "stable job, enjoy customer base", "Cons": "new employees need better training"}, "6": {"Date": " Jan 26, 2016", "Summary": "\"Crew\"", "Pros": "Friendly work enviorment, flexible schedule, fast paced, free meals, great job for a first time worker looking for experience!", "Cons": "Rude shift managers, employees slacking off, and scheduling issues (scheduling you in days that they know you're unavailable to come in)."}, "7": {"Date": " Jan 8, 2016", "Summary": "\"Communications Manager\"", "Pros": "People have always been the primary motivation, A culture that is continuing to transform and change to be more modern and progressive.", "Cons": "Major realignment and changes has streamlined the structure and resources. The downsizing has created the normal uncertainty and risk, but i'm optimistic for the brand."}, "8": {"Date": " Jan 10, 2016", "Summary": "\"It is what it is\"", "Pros": "Definitely you will have job security. Schuss McDonald's isn't going anywhere obviously I'm going to keep typing so my limit it reachedy", "Cons": "Well, just like the pro, you're working for McDonald's sos throngs can get a little belong at times and k need"}, "9": {"Date": " Feb 15, 2016", "Summary": "\"okay place\"", "Pros": "great first job for any one", "Cons": "not enough pay to me"}}