{"0": {"Date": " Jul 21, 2017", "Summary": "\"Pay was too little\"", "Pros": "Employees are nice, the environment is good and the food you can make your self is better during your break", "Cons": "The people are rude, managers to help you learnPaid every 2 weeks wasn't good and checks couldn't be deposited till 3 , breaks are 30 min"}, "1": {"Date": " Jul 21, 2017", "Summary": "\"McDonald's employee review sheet\"", "Pros": "Great advancement opportunities within the company", "Cons": "Not a very team oriented work environment"}, "2": {"Date": " Jul 7, 2017", "Summary": "\"Fun!\"", "Pros": "Had fun while working there!", "Cons": "Got sick of the food really fast"}, "3": {"Date": " Aug 11, 2017", "Summary": "\"Do NOT work here\"", "Pros": "Unlimited amount of hours you can work as many hours as you want", "Cons": "The managment is dreadful all around they do not care about their employees. When you are a manager you still get treated like crap and do not get proper training"}, "4": {"Date": " Aug 12, 2017", "Summary": "\"Wasn't for me\"", "Pros": "Discounted MealsFree UniformsOn the job training", "Cons": "Promised hours but ended up scheduling me 10 hours one week.They hire in bulk then cut everyone's hours.\"Managers\" are cliquey."}, "5": {"Date": " Jul 21, 2017", "Summary": "\"Do not work here please\"", "Pros": "They pay you some money", "Cons": "Management hates you and the customers are rude"}, "6": {"Date": " Jul 21, 2017", "Summary": "\"Getting paid minimum wage while performing really hard tasks.\"", "Pros": "Very flexible schedule. I could take off if I informed the GM earlier.", "Cons": "Apparently it really depends on the management and where your working. But even that, I have experienced things working at McDonalds that I've never seen before.The General Manager tells me to first put my bag in the back and then clock in (The difference would be 2 minutes).He would stand next to me and watch how I'm putting the ice cream (to make sure I make ice cream very small).The break was basically whenever they wanted it. If I was starving (I had to take some medications that I couldn't take on empty stomach), they wouldn't give me a break if they didn't want to.Once I clocked out 5 minutes earlier (the restaurant was empty and my family was waiting for me sitting in the lobby); One minute later I hear the shift manager yelling at me and telling me why did I clock out 4 minutes before my time (it wasn't like he was very professional that a few minutes mattered to him, he just had a very bad attitude).The team work was horrible too. In my previous job as a server we were getting paid $2 p/h, but we didn't mind helping other coworkers (Even though we weren't getting paid for their tables). But in McDonalds the smallest things was a very big deal for the employees. They would tell me to not use the fries they dropped, or use the sauces they filled. And there was no side work. I could be working at lobby but I had to do the side work of drive through people if the shift manager felt like it.I was very disrespect at McDonalds. They treated me like I needed the job so bad and I was desperately in need of their $8 per hour."}, "7": {"Date": " Jul 3, 2017", "Summary": "\"crew trainer\"", "Pros": "its fun working with friends and making new ones, its an interesting environment", "Cons": "its gets REALLY busy and sometimes your understaffed because your GM likes to have everyone there when He's there and leave you with two to three workers and a shift manger"}, "8": {"Date": " Jul 6, 2017", "Summary": "\"nice place to work while in school\"", "Pros": "they were flexible with hours", "Cons": "dealing with customers is not for me"}, "9": {"Date": " Jul 6, 2017", "Summary": "\"Alright Place\"", "Pros": "- Lots of hours, so the pay check would usually be very fat- My franchise offered me above minimum wage salary", "Cons": "- Managers would generally eat while on the job but then would say crew are not supposed to"}}