{"0": {"Date": " Oct 10, 2016", "Summary": "\"Review\"", "Pros": "Very friendly job, you meet a lot of people.", "Cons": "Fast paced working environment that requires you to stay on your toes."}, "1": {"Date": " Oct 10, 2016", "Summary": "\"Crew Member\"", "Pros": "Fun to work for, fast paced, discounted/free meals, 8.00/hr", "Cons": "Hours aren't flexible, First job, angry customers."}, "2": {"Date": " Oct 23, 2016", "Summary": "\"Decent\"", "Pros": "Co-workers are nice.They always talk to you with a positive attitude.They help you as long as you ask.", "Cons": "Being new is difficult.I had to call every week just to know if I have a shift or not.Slow times means trying to find what to do just so I'm not just standing."}, "3": {"Date": " Oct 24, 2016", "Summary": "\"Am a shift manager, mainly for overnight.\"", "Pros": "Free manager meals, and busy shifts seem to make time fly, which can also help make meeting sales goals a bit fun. If you're detail oriented and generally polite to customers it feels good to get those few who'll say \"no, I'd like so-and-so to make it. They know how I like my order\". Promotions come pretty easily for those who show dedication and reliability. Their work ethic can catch a manager's more quickly than others.", "Cons": "Sometimes can feel like when you're doing a lot of work quite often your salary should correspond. That's hardly the case, however. It could be due to the economy—not sure. Depending on what area the store is located, you may get uptight or rude customers regularly. 24/HR stores are the busiest, ESPECIALLY during the holidays and ESPECIALLY for overnight crew. Whosever name is logged into a certain register is responsible for all money on that register during the manager's shift. If money problems constantly occur w/ any crew member or manager they could receive a written warning or be ordered to not manage money again."}, "4": {"Date": " Oct 24, 2016", "Summary": "\"Cashier\"", "Pros": "Depends on your location but they were friendly most of the coworkers.. stayed to myself and got my job done. Getting rewarded from good reviews from customers , & also getting in good over time and a decent pay", "Cons": "That bullies and also some managers not helping when you need them and also the managers creating problems between specific employees and not handling problems when they should of something occurred"}, "5": {"Date": " Oct 8, 2016", "Summary": "\"love it\"", "Pros": "great people really big on team work.", "Cons": "nothing at all you would love it"}, "6": {"Date": " Nov 13, 2016", "Summary": "\"Horrible Workplace !\"", "Pros": "-Money -Corporate work experience -Guaranteed Hours", "Cons": "-Minimum Wage 7.25 -Unprofessional management -Too many managers (6 at my store) -Weird hours (6 am clock in time) up to 11 at night even though I'm under 18 -Raise evaluation 6 months after your first day and the most you an get is .35 cents. -Free employee meal but only value menu options like small fries. fudge sundae, and a snack wrap. -$500 a month if you work full time"}, "7": {"Date": " Oct 23, 2016", "Summary": "\"It's OK\"", "Pros": "Busy, if you like thatDiscounts on mealsGreat coworkersIf you put in effort you should be fine", "Cons": "Favoritism is strong among managers and crewDepending on the workplace, it could be pretty depressing"}, "8": {"Date": " Oct 8, 2016", "Summary": "\"Not as bad as people think\"", "Pros": "As a student the hours were very flexible for my schedule. If i wanted to i could have picked up more hours as a i endured the week so that was a plus.", "Cons": "A con i had were the number of hours that could be worked for part time workers. Just because of some workers status as a part time employee."}, "9": {"Date": " Oct 8, 2016", "Summary": "\"Company review\"", "Pros": "I enjoyed working at McDonald's because my coworkers made work somewhat fun. It was a good atmosphere to be in during the work day.", "Cons": "Management was not very intelligent in my opinion. The management was older than I was but I was far more intelligent."}}