{"0": {"Date": " Mar 12, 2016", "Summary": "\"Great for some\"", "Pros": "Great people to work with", "Cons": "Low pay, company first. This franchise took the issue of an employees t against them and keeping their employment"}, "1": {"Date": " Apr 1, 2016", "Summary": "\"McDonalds shift manager\"", "Pros": "There are no pros to mcdonalds", "Cons": "It's a terrible place don't work there"}, "2": {"Date": " Mar 11, 2016", "Summary": "\"crew\"", "Pros": "supplied uniforms and shoes. fast paced if you have a good team.", "Cons": "Corporate ran stores are about money not employees or customers. If your a hard worker, they will use you until you cant take anymore. promote within but have no standards with promotions and hardly any training."}, "3": {"Date": " Mar 12, 2016", "Summary": "\"Borderline\"", "Pros": "Fairly fun work environment and some people great working with. Have pretty good benefits of working there not too difficult of a job.", "Cons": "Dirty some bad attitudes don't keep up to date or code on things like they should be. And pin point out the wrong people for things that happen."}, "4": {"Date": " Feb 26, 2016", "Summary": "\"Good job\"", "Pros": "Good salary and hours for part time", "Cons": "Long shift, need more workers"}, "5": {"Date": " Mar 10, 2016", "Summary": "\"former employee\"", "Pros": "Free uniform and shoes and hat, belt, and free food", "Cons": "could not tell who the boss was, there were too many, and some managers do not know what they are doing."}, "6": {"Date": " Mar 10, 2016", "Summary": "\"McDonalds\"", "Pros": "good people to work with", "Cons": "low salary and slow to move up"}, "7": {"Date": " Mar 11, 2016", "Summary": "\"Drive-thru\"", "Pros": "Flexible hours if you need.", "Cons": "Not a career for most."}, "8": {"Date": " Feb 24, 2016", "Summary": "\"Fry Maker\"", "Pros": "great team work at McDonalds. The people are great", "Cons": "the food is so good that you eat it all the time."}, "9": {"Date": " Feb 24, 2016", "Summary": "\"interview\"", "Pros": "The interview process was barely easy. They do not expect you to have a lot of experience, mainly because it is a fast food restaurant.", "Cons": "I dont like that the employees and costumers can be rude sometimes. Sometimes you have to gather a lot of patience in order to make it throughout a shift."}}