{"0": {"Date": " Nov 18, 2016", "Summary": "\"great staffing and hourly rates\"", "Pros": "great pay and benefits rate", "Cons": "cutting of hours on a regular basis"}, "1": {"Date": " Nov 17, 2016", "Summary": "\"Nice place to work\"", "Pros": "Most of the employees are customer focused and team work is encouraged. Work life balance is good and the company is very supportive of family commitments.", "Cons": "Very political environment. If an employee is not aligned with the \"right\" manager/team it is very difficult to get noticed. Many employees stay in positions for too long making change and innovation very difficult."}, "2": {"Date": " Nov 17, 2016", "Summary": "\"Would definitely recommend for high school students.\"", "Pros": "As a high school student myself, it's great to have such a lenient schedule so that I can have time for school and for myself.", "Cons": "For the amount of work you put it, you start to realize you should be getting payed more."}, "3": {"Date": " Nov 17, 2016", "Summary": "\"Line Cook\"", "Pros": "Good crew, cheap meals", "Cons": "Lots of working hours, minimum wage, no benefits"}, "4": {"Date": " Dec 2, 2016", "Summary": "\"Shift manager\"", "Pros": "Raises frequently. Easy work environment", "Cons": "Turn over rate ridiculous. Bad senior management"}, "5": {"Date": " Nov 16, 2016", "Summary": "\"Crew\"", "Pros": "Everyone is very helpful and also works together", "Cons": "Their are no cons its absolutely fine ."}, "6": {"Date": " Nov 16, 2016", "Summary": "\"Anton wanting to be apart of the great mcdonalds team!\"", "Pros": "a good working environment to be around, with nice people that I would want to be apart of and I like mcdonalds", "Cons": "some customers can be mean and rude but as an employee you have to keep your cool to make the business look professional"}, "7": {"Date": " Nov 30, 2016", "Summary": "\"Cook\"", "Pros": "Fun hard work stay busy", "Cons": "Muscle pains the next day"}, "8": {"Date": " Dec 1, 2016", "Summary": "\"Store manager\"", "Pros": "Working as a team they are like family. Everyday is different , fast pace and challenges each day . They have a awesome training program which continues through your career", "Cons": "Staffing. Very long hours. Bonus program does not exist. No salary increase since new owners"}, "9": {"Date": " Dec 1, 2016", "Summary": "\"It's ok\"", "Pros": "Flexible schedule, advancement opportunities great training, free food, and free drinks,", "Cons": "working weekends is a must, customer can complain about anything that you do and you will get in trouble no matter what, high turnover."}}