{"0": {"Date": " Mar 15, 2016", "Summary": "\"Blowing smokeThe only\"", "Pros": "The absolute only pros are employees get half price meals and Grayco, the franchise in Nashville pays in time usually.", "Cons": "The owner of the franchise in Nashville is honestly a good guy. If he had tje day to day control, McDonalds might be a nice.place to work. However, he relies vlindly on his area managers for that and they do not give a rip about their employees. I was hired on at a ridiculously low salary after making a verbal agreement that once I completed certain steps my salary would be up to par. (50k). I completed these tasks whithin sixty days and every time I asked about my promised raise, another task was added. This went until I resigned six months later. They go through shift.managers and managers faster than they go through buns. If they offer you a job in management, RUN VERY FAST in the other direction."}, "1": {"Date": " Feb 23, 2016", "Summary": "\"horrible place\"", "Pros": "It pays the bills ots an okay place. Managers are okay just have to deal with the public", "Cons": "Company isn't very good about advancing when they said they would. Management is okay"}, "2": {"Date": " Feb 23, 2016", "Summary": "\"Its a Job\"", "Pros": "Great for high school/college students looking to make some extra money, works around school schedules, fairly easy, wide range of tasks, customer interaction, fun, meeting new people constantly, potential to get a raise quickly", "Cons": "Hours vary too much to have a steady income unless you're a manager, can be difficult to move up, franchiser allows individual stores to play favorites, not enough information given about company insurance, franchiser isn't required to give holiday pay, hours based on labor"}, "3": {"Date": " Feb 24, 2016", "Summary": "\"cashier\"", "Pros": "Get a discount on food during work", "Cons": "If you set your goals low then there inst much to be disappointed in."}, "4": {"Date": " Feb 8, 2016", "Summary": "\"Manager, business insights\"", "Pros": "Interesting work and job stabilitity", "Cons": "Workload and cutbacks and lack of promotion opportunity"}, "5": {"Date": " Feb 8, 2016", "Summary": "\"McDonald's\"", "Pros": "Working with customers. Chance to make overtime each week and free food during lunch breaks. Insurance provided and you can request holidays and days off", "Cons": "Minimum wage. Short breaks. Sometimes ran into rude customers. And when labor is high your hours are cut. Hard labor sometimes"}, "6": {"Date": " Feb 8, 2016", "Summary": "\"Need This\"", "Pros": "Great Company w/ great food and they try to please the customer as best they can", "Cons": "Fried foods are unhealthy and not good for you; However, it's the consumer's choice as to what they eat"}, "7": {"Date": " Feb 8, 2016", "Summary": "\"Just what you would expect\"", "Pros": "-The job tasks are not difficult, just tiring.-Managers gave me the hours I wanted.", "Cons": "-Can get hectic and tiring."}, "8": {"Date": " Feb 8, 2016", "Summary": "\"Manager\"", "Pros": "Grate company to work for, lots of room for growth, great training and open door policy to speak with upper management.", "Cons": "The Only Con Would Be Shift scheduling, as shift times can change from week to week."}, "9": {"Date": " Feb 9, 2016", "Summary": "\"maintenance\"", "Pros": "had liberty to work and get daily chores done", "Cons": "didn't get the pay I desired"}}