{"0": {"Date": " Apr 22, 2017", "Summary": "\"Crew Trainer\"", "Pros": "Probably one of the better first job options for high school kids. Extremely flexible schedule, 1/2 meals for any shift, ability to learn lots of various skills regarding proper communication between fellow associates and managers.", "Cons": "Pay will obviously be extremely low. Some customer interactions will make you furious. Lunch time rushes are stressful. Smell of kitchen will haunt all of your clothes and skin."}, "1": {"Date": " May 6, 2017", "Summary": "\"No room for growth\"", "Pros": "Meet great people, the one I worked for was a franchise and the owner was very nice.", "Cons": "They almost fired me for not putting dipping sauce on trays. Ridiculous."}, "2": {"Date": " May 6, 2017", "Summary": "\"Not great\"", "Pros": "its money, and it gives you an opportunity to gain experience", "Cons": "had tod eal with a lot of crap"}, "3": {"Date": " May 6, 2017", "Summary": "\"Mehhhh\"", "Pros": "Free meal depending on your boss", "Cons": "Stressful, bad pay, no vacation, gossipy co-workers"}, "4": {"Date": " May 6, 2017", "Summary": "\"No recommended, but will pay bills\"", "Pros": "Flexible schedules, otherwise no other reason.", "Cons": "Everything. The customers, management, and co-workers."}, "5": {"Date": " Apr 21, 2017", "Summary": "\"It was decent to work here\"", "Pros": "-cheap food-good smells-good managers-a decent starter job", "Cons": "-low pay-rude customers all day"}, "6": {"Date": " Apr 22, 2017", "Summary": "\"Crew Member\"", "Pros": "Get days off during the week.Got to chose what days I wanted off.When you had an emergency the next day you didn't have to show up just called.Got free food for break.", "Cons": "Had to work HolidaysWorked really late hours."}, "7": {"Date": " May 5, 2017", "Summary": "\"Fair\"", "Pros": "Schedule was fairly flexible and requesting days off was usually not a problem", "Cons": "Shifts weren't always properly managed or weren't enough crew"}, "8": {"Date": " May 5, 2017", "Summary": "\"Shift Manager\"", "Pros": "Practice time management, team management", "Cons": "Most of the crew that I work with is very young with strict schedules."}, "9": {"Date": " May 5, 2017", "Summary": "\"Crew Trainer\"", "Pros": "It's only a good first job to get.", "Cons": "Some cons of this job is dealing with customers."}}