{"0": {"Date": " Mar 30, 2016", "Summary": "\"Cashier\"", "Pros": "Great place to work, friendly coworkers", "Cons": "Food was not real, even though we said it was"}, "1": {"Date": " Mar 31, 2016", "Summary": "\"Good overall\"", "Pros": "Easy job. It's a nice part-time job. The wages are nice for a high-schooler, not really for living off of, though.", "Cons": "Like stated above. It's nice to work here if you're just a high-schooler or someone just out of it. Not good to work here for full-time if you're expecting to live off of it."}, "2": {"Date": " Mar 31, 2016", "Summary": "\"The managers are really nice\"", "Pros": "You work with a good team, you have nice regular customers that come in all the time, the managers are helpful", "Cons": "On your feet for a long time, feel pressure of having to deal with rush crowds, can have young coworkers who don't want to work"}, "3": {"Date": " Mar 15, 2016", "Summary": "\"Great\"", "Pros": "Great business to work for they are very kind to their employees and have great benefits for everyone who works with them.", "Cons": "Some of the customers are a bit rude, however when working in the fast food industry that is very common."}, "4": {"Date": " Mar 30, 2016", "Summary": "\"Fast food\"", "Pros": "A foot in the door experience wise, it can give you an idea of what employment is like. Or just pay the bills.", "Cons": "Disorganized, doesn't care about the employee, you have to self pay for medical/dental/vision, no room for moving up unless you're cozy with management."}, "5": {"Date": " Apr 20, 2016", "Summary": "\"Mcdonalds Cashier\"", "Pros": "Good food at a good price", "Cons": "Awful environment, poor attitudes from employees"}, "6": {"Date": " Apr 21, 2016", "Summary": "\"Crap\"", "Pros": "there is nothing good about this", "Cons": "You get eccoli and salmonella"}, "7": {"Date": " Mar 30, 2016", "Summary": "\"Sucks\"", "Pros": "Good first job. Learn how to handle situations under pressure and in a fast pace.", "Cons": "MoneyManagementOrganizationSome stores don't offer free crew mealsHours"}, "8": {"Date": " Mar 15, 2016", "Summary": "\"First Job\"", "Pros": "First job! Flexible Hours and very kind managers.", "Cons": "IF you are not accustom to working in a fast paced environment it can be challenging to get use to.. especially the double drive-tru! But it just took some practice then I was a pro!"}, "9": {"Date": " Mar 15, 2016", "Summary": "\"Cashier\"", "Pros": "helps earn Experience with costumer service.", "Cons": "Low paying job, stressful and very hard work at times"}}