{"0": {"Date": " May 14, 2016", "Summary": "\"Salary\"", "Pros": "The crew were awesome, always met our targets", "Cons": "Customers are disrespectful and rude for no reason"}, "1": {"Date": " May 15, 2016", "Summary": "\"Decent\"", "Pros": "Very flexible with schedules and there are ample opportunities for advancement. A few benefits are offered, McD's is a good company to work for if you are a student or in between jobs.", "Cons": "Fast-paced, you deal with lots of rude people on a daily basis. Unless you advance to management positions the salary is awful. Supervisors/managers can be rude sometimes."}, "2": {"Date": " Apr 29, 2016", "Summary": "\"Great Job\"", "Pros": "Great work experience. Great crew members.", "Cons": "Not enough inspections. Could have more help on weekends when numbers are low."}, "3": {"Date": " May 13, 2016", "Summary": "\"Great for starting off\"", "Pros": "Teaches you a lot of good work ethics. Can move up the ladder rather easily.", "Cons": "Never good enough, you always have to do better."}, "4": {"Date": " May 13, 2016", "Summary": "\"cashier\"", "Pros": "it was great to be there with people. some people are very positive in their attitudes toward cultures and politics", "Cons": "it was bad to be there with people. some people are very negative with their responses and cultures of persons."}, "5": {"Date": " Apr 28, 2016", "Summary": "\"Good first time job\"", "Pros": "My boss was really friendly to all of us. She was like a second mom to us. Our regular customers were generally really nice and were easy to get to know.", "Cons": "The customers can be rude but that is typical to fast food places. They generally dont allow piercings but my boss let us slide with having numerous ones."}, "6": {"Date": " Apr 29, 2016", "Summary": "\"Is a well development job but the paid is to little\"", "Pros": "Free meals, flexible hours, good enviroment", "Cons": "Is not well paid, costumers complaints are a litlle ofensive"}, "7": {"Date": " May 12, 2016", "Summary": "\"it was ight\"", "Pros": "free food, allowed drinks while working, meet a ton of new people", "Cons": "TIRED, constantly asking you to come in, full shifts, little flexibility"}, "8": {"Date": " May 12, 2016", "Summary": "\"its ok\"", "Pros": "its alright for the type of work", "Cons": "angry customers will get you sometimes"}, "9": {"Date": " May 13, 2016", "Summary": "\"OK\"", "Pros": "People were nice and understanding.", "Cons": "Sometimes i wasnt able to finish my shift"}}