{"0": {"Date": " Jun 12, 2017", "Summary": "\"Service Specialist - Cashier\"", "Pros": "The work was easy and the crew members were amazing. The managers trained me to complete my tasks to the best of my ability, and the steady flow of customers practically made my shifts fly by. I am confident I can work in stressful situations and keep a cool mind, and in my ability to deal with a wide range of people.", "Cons": "Fast food was incredibly stressful. The work itself was simple enough, but always being busy and forever working with the bare minimum during afternoon and nightly rushes does take a toll on a person after a while. The only retail-like experience I have was at a Home Depot for a few months last summer, but being able to scan a person's items and send them on their way I found infinitely less nerve wracking."}, "1": {"Date": " Jul 18, 2017", "Summary": "\"Stepping Stone\"", "Pros": "Work there if you have friends there as well.", "Cons": "Management sucks, not enough training, impatient."}, "2": {"Date": " Jul 19, 2017", "Summary": "\"Crew Member\"", "Pros": "There are no pros to speak of", "Cons": "At the location I worked at, there was terrible community between crew-members, unclear training, and consistent violations of basic health and safety rules."}, "3": {"Date": " Jun 27, 2017", "Summary": "\"Bad work conditions\"", "Pros": "High volume work area, efficient", "Cons": "bad energy, lots of unhappy co workers"}, "4": {"Date": " Jun 27, 2017", "Summary": "\"Crew member\"", "Pros": "Nice start out job for younger kids", "Cons": "To many managers not enough crew"}, "5": {"Date": " Jun 12, 2017", "Summary": "\"shift manager\"", "Pros": "Great boss to work with", "Cons": "Horrible workers who complain about every little thing."}, "6": {"Date": " Jun 12, 2017", "Summary": "\"McDonalds\"", "Pros": "Great customer service building experience.", "Cons": "Some rude customers here and there."}, "7": {"Date": " Jun 12, 2017", "Summary": "\"Cashier\"", "Pros": "Easy to acquire, meals provided with shift, discounts", "Cons": "Long standing hours and customers cane pretty demanding"}, "8": {"Date": " Jun 13, 2017", "Summary": "\"Blah\"", "Pros": "Awesome stuff you get free food", "Cons": "People wont take you seriously"}, "9": {"Date": " Jun 13, 2017", "Summary": "\"Mcdonalds\"", "Pros": "The people there are great and really good people and plus Mcdonald's is not a bad job to start off with.", "Cons": "There is a lot of favoritism with the managers. And they lose a lot people so there always short staff."}}