{"0": {"Date": " Nov 2, 2016", "Summary": "\"Not a permanent job\"", "Pros": "The coworkers are kind and the hours are very flexible. Discipline with customer service is one of the biggest things you learn.", "Cons": "The amount of work you do for the amount of pay you receive is not in equilibrium. The customers are rude and demanding."}, "1": {"Date": " Nov 2, 2016", "Summary": "\"Team lead-blueshirt\"", "Pros": "Flexable schedule, growth in responsibility and understanding of jobs. This is a great job for a student or someone looking to enhance there job skills.", "Cons": "Working holidays, okay pay for starting off job. Not a good career."}, "2": {"Date": " Oct 18, 2016", "Summary": "\"Crew Member\"", "Pros": "This was a good place to develop my costumer service skills as well as in a fast paced environment. Good job to start off and obtain experience in different aspects of a working environment.", "Cons": "There was a lot of favoritism and employees who thrived to do their best and advance had a hard time doing so."}, "3": {"Date": " Oct 19, 2016", "Summary": "\"Where the Magic happens 😊\"", "Pros": "The smell. The lunch vouchers. The happy children eager to receive their happy meals. I loved working there ❤️", "Cons": "Really fast paced at peak times. The smell. You went home smelling like fries and grease, but hey at least you got paid for it. The lunch vouchers. I gained 10 pounds from working there in the first 2 months 😖. The children...the ones that were upset and throwing thing tantrums in public. Again, loved working there ❤️"}, "4": {"Date": " Nov 3, 2016", "Summary": "\"O.k second job\"", "Pros": "The shifts can be either short or long. Long on the weekends, short on weekdays.", "Cons": "Low pay, managmemt can be all over the place with treatment of employees"}, "5": {"Date": " Nov 3, 2016", "Summary": "\"Its ok\"", "Pros": "Flexible Schedule, Good Working Environment, Always cooperated when a employee was having problems in certain areas, Always helpful", "Cons": "Bad pay, Raises rarely given, training could use some more interactive hands on type experience, need more professional looking uniforms"}, "6": {"Date": " Oct 18, 2016", "Summary": "\"cashier\"", "Pros": "Meeting new people ,learning new things that i never done before. .", "Cons": "Working with people who have attitudes. Getting yelled at for something i didn't do.."}, "7": {"Date": " Oct 18, 2016", "Summary": "\"Crew Trainer\"", "Pros": "The employees are great to work with when on the same page especially when working with children and any one.", "Cons": "Fast food. Rude customers. Mediocre pay. Weird scheduling. Pay raise. Human resources taking too long. Managers slack off a lot."}, "8": {"Date": " Oct 18, 2016", "Summary": "\"Crew Member\"", "Pros": "Great teamwork, Great Work Enviornment, Raises.", "Cons": "Lighten-Up. Don't be so uptight SANDY"}, "9": {"Date": " Oct 19, 2016", "Summary": "\"Great First Job\"", "Pros": "Worked with a diverse group of people both racially and age wise, learned many skills in cooking, cleaning, and running a store. Great for learning cash handling skills.", "Cons": "Not always enough time to take a breath, have to go off the floor for a drink"}}