{"0": {"Date": " Jan 7, 2016", "Summary": "\"Crew Member\"", "Pros": "Free LunchFlexible HoursFun CoworkersNice Customers", "Cons": "Hot at many stationsrude customersnot much room for growth"}, "1": {"Date": " Jan 7, 2016", "Summary": "\"Customer Service building blocks for who I am\"", "Pros": "Didn't appreciate the work at the time, but I owe most of my personal skills and experience to working in various situations with various kinds of people at all times", "Cons": "management was a little shabby at times, some very unprofessional things took place"}, "2": {"Date": " Jan 28, 2016", "Summary": "\"okay\"", "Pros": "okay. easy job. easy money. long hours", "Cons": "nothing in particular. good for freshers."}, "3": {"Date": " Jan 29, 2016", "Summary": "\"Don't Work for J & K Jasper McDonald's\"", "Pros": "Its a great way to start getting experience.", "Cons": "the pay is horrible, and there are so many laws that are broken"}, "4": {"Date": " Jan 7, 2016", "Summary": "\"Management\"", "Pros": "Room to grow, good training and experience.", "Cons": "Very disorganized, chaotic, a lot of miscommunication."}, "5": {"Date": " Jan 7, 2016", "Summary": "\"crew member\"", "Pros": "Great first job to learn the basics of a job.", "Cons": "Rude customers and lack of communication"}, "6": {"Date": " Dec 23, 2015", "Summary": "\"Shift Manager\"", "Pros": "Fast pase team environment. Extremely friendly regular repeat customers.", "Cons": "High turnover rate. Ratio of trained and untrained crew members scheduled on the same shift."}, "7": {"Date": " Dec 23, 2015", "Summary": "\"Cashier\"", "Pros": "Meeting new people help in others", "Cons": "Pressure I work hard under pressure but when its all done its the best feeling"}, "8": {"Date": " Jan 4, 2016", "Summary": "\"Management\"", "Pros": "Flexible schedule and the company will work with you for school and family scheduling.", "Cons": "Some people abuse their position and will try to bully lower level employees."}, "9": {"Date": " Jan 6, 2016", "Summary": "\"Shift Manager\"", "Pros": "easy work, time goes by fast", "Cons": "people always want to get rid of their shift"}}