{"0": {"Date": " Dec 31, 2016", "Summary": "\"Decent Comany\"", "Pros": "The business is full of kind-hearted, well spirited employees. It was easy to get along with everyone and easy to learn what I had to do.", "Cons": "McDonald's is a very fast-passed working environment. My first day was Black Friday and the McDonald's was inside a Walmart. This did not introduce me to the company very well."}, "1": {"Date": " Dec 15, 2016", "Summary": "\"Cashier\"", "Pros": "The people were funThe shift hour were goodThe scheduling was easyThey were understanding when I needed time off", "Cons": "The customers were rudeSometimes I was talked to with no respectI ate too much of the food"}, "2": {"Date": " Dec 15, 2016", "Summary": "\"Great place to start\"", "Pros": "I think it's a great place at the beginning of your career. It's easy but you have to work hard.", "Cons": "I think that the salary could be better and the amount of work is quite big."}, "3": {"Date": " Dec 16, 2016", "Summary": "\"internship\"", "Pros": "good comunication, team work, develop skills good salary, improve the professinal career, as well as the personal career, achieve objectives", "Cons": "conflicts with people, cold environment, hot enviroment, people with lack of comuniction skills to deal with. poor salary sometimes, work too many hours"}, "4": {"Date": " Dec 30, 2016", "Summary": "\"burger flipper\"", "Pros": "can get into positions for training or stocking that provide free meals in addition to your regular shifts/position as well as opening/closing shifts that pay more. Can also advance to a shift manager for a smidgen of extra money, but it's so stressful who really wants that? My advice is become a closer, that shift is usually much more relaxed and you get paid an extra $1+/hour every day of the week, not just during closing time. Benefits: full time has a few, not significant; part time all you get is half off a burger/salad and drink/dessert not off the \"dollar menu and more\".", "Cons": "People/managers always stressed and negative. There are some good ones, but generally people aren't very happy there. Management is essentially always under such stress to make times (yes we time orders down to the second). Also, that sort of place attracts all sorts of people that maybe you wouldn't normally want to associate with...if you know what I mean. Honestly, just find a server job at a nicer restaraunt near you. Better environment, more opportunities, benefits, and frankly you'll make Much more with tips than your salary here."}, "5": {"Date": " Dec 16, 2016", "Summary": "\"Lovin' it!\"", "Pros": "Training is designed to challenge team members to perform to the best of their ability. Advancement is available and encouraged.", "Cons": "Last minute hold overs are possible."}, "6": {"Date": " Dec 29, 2016", "Summary": "\"Swing manager\"", "Pros": "Flexible schedules more family time", "Cons": "No benefits takes a long time to advance"}, "7": {"Date": " Dec 29, 2016", "Summary": "\"Cashier\"", "Pros": "Take care of my son , helping others , working and connecting with coworkers & customers", "Cons": "Rude customers , unorganized coworkers , coworkers with attitudes or having a bad day"}, "8": {"Date": " Dec 30, 2016", "Summary": "\"Drive Thru Server\"", "Pros": "Fun, friendly, staff activities, free food", "Cons": "Low salary, long shifts, free food"}, "9": {"Date": " Dec 30, 2016", "Summary": "\"McDonald's on 9th Street\"", "Pros": "The staff her is very friendly and welcoming. Pay is good.", "Cons": "Training is awful, but they're working on that. Customers can be difficult, as with any customer service job. It's McDonald's. Perfect for a first job. Would not recommend as a career unless you find you enjoy being a manager there. Most of them seem to hate their life."}}