{"0": {"Date": " May 24, 2016", "Summary": "\"Great company\"", "Pros": "Great company met lots of people, I was able to gain a great sense of ownership skills and they helped me through my career", "Cons": "No real room for advancing in the company you would have to spend many years at the same salary and I thrive on progression"}, "1": {"Date": " May 8, 2016", "Summary": "\"Maintenance man\"", "Pros": "A very good place to work", "Cons": "More communication lack of management lack of help"}, "2": {"Date": " May 8, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Free food, fun environment, good people.", "Cons": "Customers, tasks being put off and no one doing them"}, "3": {"Date": " May 9, 2016", "Summary": "\"Sr. Marketing Manager\"", "Pros": "Really a great place to work. Working at corporate HQ has been great. I really enjoyed my job and all the people I work with.", "Cons": "I really just don't see that much room for growth at the company. It's very corporate and it's hard to get high up now."}, "4": {"Date": " May 24, 2016", "Summary": "\"Easy but issues\"", "Pros": "It's an easy job for the most part, sometimes make good friends, a pretty flexible schedule. 50% off food during break as well", "Cons": "Managers are two-faced, they are also extremely under qualified, and way too much drama in the workplace. The restaurant needs to be updated badly also."}, "5": {"Date": " May 4, 2016", "Summary": "\"Easy to do manegers are felxible on ur hours im a student only worked weekends pay you every 15 days gained 200$\"", "Pros": "Felxible hours crew is friendly and help you when you dont know how to do things", "Cons": "Depending coustomer rate work at the pase as coustomers come in"}, "6": {"Date": " May 8, 2016", "Summary": "\"Crew Trainer\"", "Pros": "The food is free when one works, they have a good discount on days off and benefits are good if you move up on the list of importances", "Cons": "The stress of customers asking for things that they want for free the employees that like to call out because they have better things to do and it screw over the people that show up on time to work"}, "7": {"Date": " May 9, 2016", "Summary": "\"McDonalds Swing Manager Experience\"", "Pros": "McDonalds have pretty good benefits for their employees everything from G.E.D. assistance, rapid job growth for those who earn it, delicious food perks, etc", "Cons": "We must improve our customer service standards across the board, greatly improve the overall health/cleanliness of the back of the house. Make sure that every employee is fully trained and certified."}, "8": {"Date": " May 22, 2016", "Summary": "\"Decent pay and hours\"", "Pros": "Flexible schedule and good pay. Learned a few things while I was here.", "Cons": "Didn't like the principal concept of the company. Felt guilty working here. I don't think it's good for the environment."}, "9": {"Date": " May 22, 2016", "Summary": "\"My experience at McDonald's was an eye opener.\"", "Pros": "Some pros for this job would be that they Provided training for management. They also had a pool of diverse workers", "Cons": "Some negative effects I can say about working at McDonald's is that they asked for Big expectations with no motivational support, or raises!Not a professional environment/Favoritism"}}