{"0": {"Date": " Jun 9, 2016", "Summary": "\"Crappy job easy work bad pay\"", "Pros": "Its easy work here not much to do and non complicated tasks half of any menu items so you get nice an tubby!", "Cons": "Stupid people all the time, there is a employee discount 50% off all menus item this company ruined my life i gained 140 mounds in 10 months"}, "1": {"Date": " May 20, 2016", "Summary": "\"Cashier\"", "Pros": "Good people! Good Food! Good customers! I really enjoyed my time working with everyone. Great crew! Love the french fries. So good. What can you do? I enjoyed working with all of the managers on duty. THey really were helpful.", "Cons": "Not too great of pay! I didn't like working the late, late hours. It was very tiresome and i never got to eat any of the french fries."}, "2": {"Date": " Jun 7, 2016", "Summary": "\"Restaurant Department Manager\"", "Pros": "Great experience with crew, customers, and peer managers.", "Cons": "Pay rate is too low for what I do."}, "3": {"Date": " Jun 7, 2016", "Summary": "\"Good first job\"", "Pros": "Dealing with money. Dealing with customers.", "Cons": "Working hard will not get you noticed."}, "4": {"Date": " May 23, 2016", "Summary": "\"cashier\"", "Pros": "i love mcdonalds so i love working here", "Cons": "no good pay im so poor"}, "5": {"Date": " May 23, 2016", "Summary": "\"Crew Member\"", "Pros": "McDonald's was good company to work for every one there from customer and employees", "Cons": "There was time some managers blame me behind me back because failed Mystery shopand that was my darkside."}, "6": {"Date": " May 23, 2016", "Summary": "\"great first job\"", "Pros": "Good life experience in an efficiently run company", "Cons": "Minimum wage, long online application"}, "7": {"Date": " May 23, 2016", "Summary": "\"Crew trainer\"", "Pros": "Customer service to customers of all different origins.", "Cons": "Unorganized and lacked control, managers and staff."}, "8": {"Date": " Jun 28, 2016", "Summary": "\"Good high school job\"", "Pros": "Lots of hours and good customer service experience", "Cons": "Bad pay and work environment. Treated poorly sometimes"}, "9": {"Date": " May 23, 2016", "Summary": "\"Really Good Job\"", "Pros": "food, good jobs, nice people, good cars", "Cons": "dirty bathrooms, bad hygiene, dirty trash"}}