{"0": {"Date": " Jul 16, 2016", "Summary": "\"Cashier/prep\"", "Pros": "A lot of interaction, work with a lot of great people learn something new everyday and it is a wonderful opportunity.", "Cons": "There can be times the shift isn't fun its hard work and you do get dealt with a few bad apples."}, "1": {"Date": " Jul 1, 2016", "Summary": "\"Just for a summer job\"", "Pros": "Good moneyGood peopleLearn things", "Cons": "Don't know if I would make a lot of money and not guarantee me getting the job"}, "2": {"Date": " Jul 1, 2016", "Summary": "\"Hello\"", "Pros": "You ask for whatever day you need off 2 weeks advance and you will have that day or those days off you also get a $3 meal free everyday you work 30 min before or after your shift or on your break you get a 10 min break if you work under 5 hours and a 30 min break if you work 5 hours or more and the longer you work the longer your break.", "Cons": "Customers are very very mean to you they treat you like trash even the nicest teenagers like me you can be treated like a rat people will yell at you and treat you like trash for no reason at all and people will lie and scream just trying to get free food people will throw pennies at you when they come through the drive through and I've seen my 18 year old manager get punched in the face by a customer because his burger had mustard on it and he asked for no mustard."}, "3": {"Date": " Jul 16, 2016", "Summary": "\"I used to love McDonald's\"", "Pros": "discountfree meals when on breaksomewhat flexible schedule", "Cons": "managers are biased and show favoritismraises only 20 cent a yearlittle to no opportunities for advancementsome managers literally sit down and watch everyone work"}, "4": {"Date": " Jul 16, 2016", "Summary": "\"cashier\"", "Pros": "Learned to work with others and lend a helping hand.", "Cons": "Not enough training to gain a better understanding"}, "5": {"Date": " Jul 1, 2016", "Summary": "\"Great company, with a few major problems\"", "Pros": "Great Managers, Good Co-Workers, Friendly Customers, Good Pay (Depending on the job), great praised for any good work you do (From managers and customers) Over all, great work environment, good hours, and some co-workers love to joke around.", "Cons": "Some managers were dishonest, not much team work (Even if you're Lobby Person), Some times stressful envirement, some rude and slobby customers (Which is with every job) Some co-workers were lazy."}, "6": {"Date": " Jul 15, 2016", "Summary": "\"Yucky food\"", "Pros": "You get coffee and ice cream", "Cons": "The smell of the other foods are pretty bad"}, "7": {"Date": " Jul 15, 2016", "Summary": "\"McDonalds Review\"", "Pros": "Great co-workersEasy room for advancement", "Cons": "Busy 24/7Late or no break at all during shift"}, "8": {"Date": " Aug 5, 2016", "Summary": "\"Cashier\"", "Pros": "Paychecks and the days off", "Cons": "Hard work and mean people"}, "9": {"Date": " Jun 30, 2016", "Summary": "\"My time at Market street McDonalds in Pascagoula ms\"", "Pros": "It was extremely family oriented, and I loved it. The owners (the Deschers) are wonderful. They really care about the employees, and their customers.", "Cons": "This store is a really busy store, so it can get really backed up. If you are stuck in back drive thru. just know that you are forgotten about."}}