{"0": {"Date": " Jan 10, 2017", "Summary": "\"VERY UNPROFESSIONAL\"", "Pros": "They worked around my schedule so it's convenient if you're a student . Cleanliness was very important and I did appreciate that. Customers shouldn't eat in a dirty establishment", "Cons": "Very unprofessional environment; managers would never listen to me and would constantly blame employees for their mistakes. Wasn't worth it whatsoever"}, "1": {"Date": " Jan 10, 2017", "Summary": "\"McDonald's is fine as a starter job\"", "Pros": "You have a constant interaction with customers and gain much needed customer service experience cross training gives widespread insight", "Cons": "The customers are sometimes rude as with any job dealing with the public you often end up doing tasks outside of your trained duties"}, "2": {"Date": " Jan 11, 2017", "Summary": "\"Cashier\"", "Pros": "I was 16 when i first started working here and i loved it. It was summer and they gave me plenty of hours. The managers were awesome as well.", "Cons": "Not enough pay. I would not recommend for any adult that need their bills to be paid. More of a teenager job."}, "3": {"Date": " Dec 26, 2016", "Summary": "\"McDonald's Is great for a people person\"", "Pros": "I like talking to people and at McDonalds you always have interesting customers. The Crew is nice. The managers are willing to work with your schedule is you inform them ahead of time.", "Cons": "Too Stationary, i like to move around. Everything smells like McDonalds."}, "4": {"Date": " Jan 9, 2017", "Summary": "\"Work\"", "Pros": "Flexible schedule and decent benefits.", "Cons": "More work than being paid for."}, "5": {"Date": " Jan 9, 2017", "Summary": "\"Being real\"", "Pros": "Good people to work with except one", "Cons": "Unorganized, not properly stocked, and always run out of stuff"}, "6": {"Date": " Jan 9, 2017", "Summary": "\"Review\"", "Pros": "Great benefits, fast moving environment, management cares", "Cons": "Need a clearer sense of direction"}, "7": {"Date": " Jan 10, 2017", "Summary": "\"Great\"", "Pros": "Getting a head start in the job field. Learn leader skills .", "Cons": "Breaks were only 15 mins. Minimum wage"}, "8": {"Date": " Jan 10, 2017", "Summary": "\"crew trainer\"", "Pros": "great starting job out of high school, it looks good on a resume to have worked at mcdonalds because of the team and group working experience. thats what got me a better job because of my experience from here.", "Cons": "have to do other peoples jobs and basically being a crew trainer after a few months of being there. no raise or promotion for teaching all of the new hires which is basically every week"}, "9": {"Date": " Jan 30, 2017", "Summary": "\"College Student at Mcdonalds\"", "Pros": "-A lot of hours-Easy to be overtime-Stress free working-not a whole lot of thinking", "Cons": "-not a whole lot of thinking-lack of flexibility-poor management"}}