{"0": {"Date": " Jul 13, 2016", "Summary": "\"Ok work\"", "Pros": "Management can be really good about scheduling.", "Cons": "Workload is rather large for minimum wage. And they are not helpful for getting a job afterwards."}, "1": {"Date": " Jul 14, 2016", "Summary": "\"Director roles\"", "Pros": "very fast paced. many opportunities to contribute.", "Cons": "company going thru a organizational and cultural change."}, "2": {"Date": " Jul 14, 2016", "Summary": "\"Crew member/drive thru\"", "Pros": "Other coworkers are very interested in helping you. The schedule is pretty flexible. Free meals and all day drinks. Good for students (especially now since they pay upwards of $10 hourly and when I worked it was $8.)", "Cons": "Not so considerate of injuries and disabilities (in my experience,) a lot more than just flipping burgers....worth more than minimum wage. Some scheduling conflicts for students. Really long shifts, but not enough days."}, "3": {"Date": " Jun 29, 2016", "Summary": "\"Mcdonalds\"", "Pros": "I had a great experience and met a lot of great people.", "Cons": "Scheduling wasn't always accurate and had some conflicts."}, "4": {"Date": " Aug 3, 2016", "Summary": "\"mepw\"", "Pros": "The upgrades are getting better than in 2005", "Cons": "Its some what messy with bad employment"}, "5": {"Date": " Jun 28, 2016", "Summary": "\"Great place to work\"", "Pros": "Had a great time working with team.", "Cons": "Don't really have any cons about this job."}, "6": {"Date": " Jun 28, 2016", "Summary": "\"McDonald's\"", "Pros": "everyone from the crew and management are very friendly, always greet me when I walk in the door, restrooms always clean with easy access.", "Cons": "food sometimes comes out cold or I have to wait a while for my food when it's supposed to be fast food"}, "7": {"Date": " Aug 2, 2016", "Summary": "\"Shift manager\"", "Pros": "McDonalds itself is a great company to work for", "Cons": "The people they hire for that certain store isn't the right fit"}, "8": {"Date": " Aug 2, 2016", "Summary": "\"Terrible\"", "Pros": "There are no pros to this place. Find your minimum wage work elsewhere.", "Cons": "Ghetto, underpaid, overworked, rude customers, but management is worse."}, "9": {"Date": " Aug 2, 2016", "Summary": "\"Awful\"", "Pros": "None. The worst place to work at.", "Cons": "Everything, managers are awful."}}