{"0": {"Date": " Jun 1, 2016", "Summary": "\"Avoid a fast food job if possible.\"", "Pros": "Flexible schedules but that's about it.", "Cons": "Very poor management and unorganized."}, "1": {"Date": " May 11, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Overtime is easy to get", "Cons": "Sometimes will get stuck with poor managment"}, "2": {"Date": " May 11, 2016", "Summary": "\"ehh\"", "Pros": "Great hours!Good pay!Some great people!", "Cons": "Horrible managmentSaid i quit when i did not"}, "3": {"Date": " Apr 26, 2016", "Summary": "\"Restaurant General Manager\"", "Pros": "Flexible scheduling, competitive pay, paid vacation time", "Cons": "Long days, must work holidays"}, "4": {"Date": " May 10, 2016", "Summary": "\"better than many other fast food jobs\"", "Pros": "fast paced; flexible hours; fairly easy to switch shifts or get rid of a shift; a lot of customer service experience; learning general people skills; managers almost always give you the time off requested; opportunity to become proficient at multi-tasking", "Cons": "stressful at times; many managers lacking basic management skills including professionalism and courtesy, even toward customers; meager, infrequent raises, regardless of performance; little to no positive feedback from management; becoming a manager seems to entail being berated by upper management for an array of everyday slip-ups and incidentals that are beyond lower management's control, which is often passed down via bad attitudes to crew. This is why, although I have worked there for almost 5 years and have many skills and qualities to contribute as a manager, I am still crew. (in addition to the workload of college)"}, "5": {"Date": " May 10, 2016", "Summary": "\"Team Member\"", "Pros": "Great way to start gaining skills", "Cons": "Management sucked and they would just lounge around and do nothing"}, "6": {"Date": " May 11, 2016", "Summary": "\"Better hours\"", "Pros": "You get to interact with other people", "Cons": "Less hours to have"}, "7": {"Date": " Apr 26, 2016", "Summary": "\"Crewworker\"", "Pros": "Diligent working available and benefits.", "Cons": "Two week notice to request off work."}, "8": {"Date": " May 31, 2016", "Summary": "\"at mc donalds\"", "Pros": "The best was that I was all cool with all my coworkers and whatever was extra you coulf of keep for break time.", "Cons": "The worst was the super duper hungry customers, they actually would scream at you in the drive thru and get mad so fast when they are speaking so low."}, "9": {"Date": " May 31, 2016", "Summary": "\"Shift Manager\"", "Pros": "Locations worldwide. Great management training. Steady work.", "Cons": "No support from upper management. Low Pay. No Medical Benefits. No Vacations. No Holiday premium pay. No set shift, sometimes work day, swing, and graveyard all in one week, often get off of graveyard in the morning and scheduled to return by 2 in the afternoon."}}