{"0": {"Date": " Jan 10, 2017", "Summary": "\"About my current work\"", "Pros": "The best part is that i get to meet new people every day, I love meeting new people.", "Cons": "Its not where i would like my job to be."}, "1": {"Date": " Jan 10, 2017", "Summary": "\"Crew Member\"", "Pros": "McDonalds is a great place to work if you have a good team atmosphere. Ours was extremely good because we worked well as a team. There are many positives about working with great coworkers. Some positives of the job were also that we received a free meal if we worked a full shift.McDonalds always accommodated my schedule when I had to go to other events. This really helped and ensured I could work there as I found a profession. The work itself was really easy to catch onto. You dont have to think about too much and they made everything really easy to understand. At the beginning I was nervous that I wouldnt be able to understand the system, but after just a few hours I already had caught on and could perform the functions.", "Cons": "It is McDonalds, the customer base wasnt great and the complaints were frequent."}, "2": {"Date": " Feb 14, 2017", "Summary": "\"Crap\"", "Pros": "Run youre own shift\\Motivate youre employees", "Cons": "Not enough hoursNot enough pay"}, "3": {"Date": " Feb 15, 2017", "Summary": "\"they was expecting too much of you at this restaurant\"", "Pros": "free food when you work there", "Cons": "you have too work all these hours"}, "4": {"Date": " Jan 24, 2017", "Summary": "\"Senior Director\"", "Pros": "McD is an established, financially solid company. Can be proud of the Brand and supporting system. Position on supporting Ronald McDonald House Charities is great", "Cons": "The company needs to change, but the focus and pace of change is not focused on what will drive results"}, "5": {"Date": " Jan 24, 2017", "Summary": "\"Too much work, very fast moving\"", "Pros": "Good pay for a highschooler.", "Cons": "Accidentally burned myself three times."}, "6": {"Date": " Jan 24, 2017", "Summary": "\"Not what I was expecting at all\"", "Pros": "good paycheck with somewhat friendly co workers", "Cons": "terrible customers and worked a lot of hours"}, "7": {"Date": " Jan 25, 2017", "Summary": "\"Great Job/Bad Managment\"", "Pros": "You got to work with great people and even meet some unusual ones through drive thru.", "Cons": "The pay wasnt the greatest and there was no room for advancement. If you weren't really good friends with a manager then you wouldn't get a manager position. There were no performance reviews or even raises. There idea of full time was 30 hours a week and even then that was iffy. I only knew a few that had 39 hours a week and the severely discouraged overtime."}, "8": {"Date": " Jan 9, 2017", "Summary": "\"OK place to work for.\"", "Pros": "They work well with my schedule", "Cons": "No vacation time. Even after being there for almost 3 years."}, "9": {"Date": " Jan 9, 2017", "Summary": "\"Working Part Time\"", "Pros": "I wanna work there and have a good time with my workers and make a lotOf money and just helping out and being a careful worker", "Cons": "Good Worker and have a good time with manager"}}