{"0": {"Date": " Jan 25, 2018", "Summary": "\"Great place to work!\"", "Pros": "Working at Leb.-One McDonald's is a wonderful experience. I've been here for 3 months and absolutely love it. You learn how to deal with unsatisfied customers, how to make foods, better cleaning methods and make great friends. Work environment is always clean and organized and the crew is friendly. Not to mention free meals on break and up to 50% discounted otherwise. Pay is biweekly and starts at $8.50 an hour!", "Cons": "The hardest part is balancing a full time position with school and life. You have to plan your availability carefully for free time. Sometimes it gets busy and can be a little chaotic but it calms down after a while."}, "1": {"Date": " Jan 25, 2018", "Summary": "\"Great environment for personal growth\"", "Pros": "Lots of opportunities to grow", "Cons": "Can get stressful at times"}, "2": {"Date": " Jan 26, 2018", "Summary": "\"Manager\"", "Pros": "Hours, benefits, food, drink, women", "Cons": "Co-workers, complaints, broken ice cream machine"}, "3": {"Date": " Jan 26, 2018", "Summary": "\"I love to make you smile.. no really.\"", "Pros": "Builds character. Teaches patience and humility.", "Cons": "Stressful at times. Not often appreciated."}, "4": {"Date": " Mar 2, 2018", "Summary": "\"Working with new generations of teens\"", "Pros": "50% off discount, but thats about it.", "Cons": "As \"maintenance\" aka a janitor, once everyone caught on that theres a new maintenance person, they all slowly got lazier and lazier until i was a cleaning slave, and no one gave a damn"}, "5": {"Date": " Mar 2, 2018", "Summary": "\"Crewmember\"", "Pros": "Pays Higher than other Min Wage Jobs starting", "Cons": "Management tends to get aggravated easily, and it can be high pressure at times. Customers can be rude at times but as long as you just greet them with a smile and move on to the next they tend to not hamper your day. If you work overnight, be prepared to make drunks twenty McChicken's."}, "6": {"Date": " Jan 25, 2018", "Summary": "\"It’s okay\"", "Pros": "Free food, employee discounts,", "Cons": "It’s very fast paced, you get yelled at if you’re not moving fast enough or if you don’t know how to do something"}, "7": {"Date": " Feb 8, 2018", "Summary": "\"Eh.\"", "Pros": "We got discounted food that was okay.", "Cons": "The meat was not very real."}, "8": {"Date": " Jan 25, 2018", "Summary": "\"Crew member\"", "Pros": "Right across the streetGreat PayFlexible hoursFree meal", "Cons": "Get SweatyPeople tend to yell at the cashier when their order gets messed up"}, "9": {"Date": " Feb 8, 2018", "Summary": "\"Crew Member\"", "Pros": "The Free food I guess", "Cons": "They had me work every closing shift and when I would request days off they wouldn’t give them to me. Even on emergency’s. They just told me “ we hired you just so you can work closing shifts” when I submitted my availability I put down I couldn’t do closing shifts because I had 8am classes Monday - Friday. Ended up complaining and they took me off the schedule for 8 days"}}