{"0": {"Date": " Apr 27, 2016", "Summary": "\"Save yourself the pain\"", "Pros": "The high turnover rate means you meet lots of new people. The pay is okay.", "Cons": "Worst job I've ever had. Managers had no clue what they were doing, not mention they were very mean and would make fun of you in front of all the other employees. They take any chance to argue, shove rookie jobs on you even when you've been there a while, you're required to pay back money from your cash drawer even though they make it communal. I'm not sure who this job focuses on because it's definitely not the employees and only sometimes the customers. You couldn't pay me enough money to work here again."}, "1": {"Date": " Apr 27, 2016", "Summary": "\"Cashier\"", "Pros": "Fast paced, friendly, hours, fun, people. The company and the pay. I was there for fours and had interesting time", "Cons": "When people were in a bad mood they brought it to work with them and shouldn't have done that stuff"}, "2": {"Date": " Apr 5, 2016", "Summary": "\"not worth it.\"", "Pros": "Friendly, busy work good for the first few weeks and then it all goes down hill. The co workers are great. Management needs work.", "Cons": "Hardly any training at the one I worked, and if you take a single day because you're sick, they cut your hours. I went from full time hours to barely 4 hours every two weeks. At 7.25 an hour. That is unacceptable in these trying times."}, "3": {"Date": " Mar 21, 2016", "Summary": "\"Good place to learn Management skills\"", "Pros": "Pay and benefits are good for Managers and Assistant Managers. It's fast paced, fun, and can be stressful, but generally speaking the people are great.", "Cons": "Of course, you're dealing with the public, and this is fast food, so customers can be pretty demanding and impatient. The hours can get crazy too."}, "4": {"Date": " Mar 22, 2016", "Summary": "\"Crew\"", "Pros": "Very fast pace which was cool. Lots of stations to learn. Love making drinks and the system has pictures of the food items good for people who have photographic memories.", "Cons": "Front counter is boring and u stand there like a robot all day because you have to stay at your station how ridiculous"}, "5": {"Date": " Mar 22, 2016", "Summary": "\"Great company until recent CEO change\"", "Pros": "family oriented and work life balacnce", "Cons": "New CEO is all about making money for himself and not customer or employee focused"}, "6": {"Date": " Apr 4, 2016", "Summary": "\"It's aight\"", "Pros": "I was hired without having to do a drug test, which is good because the only way I can get through the day is if I am high as balls.", "Cons": "Being high around fast food is a recipe for disaster. I've been suffering from childhood obesity for 25 years now with no end in sight."}, "7": {"Date": " Apr 4, 2016", "Summary": "\"good and bad\"", "Pros": "The pros are that you work with lots of different people and you have the chance to learn a lot if you work hard.", "Cons": "that you smell like food for the rest of the day."}, "8": {"Date": " Apr 4, 2016", "Summary": "\"Burger Boy\"", "Pros": "Its Mcdonalds you get a weekly pay", "Cons": "Its Mcdonalds... not much more need said"}, "9": {"Date": " Apr 5, 2016", "Summary": "\"Could've had better opportunity\"", "Pros": "Comfortable, free lunch, fun most of the time", "Cons": "Not long enough breaks, do not explain things well"}}