{"0": {"Date": " Dec 18, 2017", "Summary": "\"Could be worse\"", "Pros": "Free food as long as manager isn't there.", "Cons": "Our A/C never worked in the summer, could be more comfortable uniforms,"}, "1": {"Date": " Dec 19, 2017", "Summary": "\"Crew\"", "Pros": "Food provided and great team experience", "Cons": "Disrespectful customers and tough work environment"}, "2": {"Date": " Dec 18, 2017", "Summary": "\"Avalon McDonald's\"", "Pros": "Some of the people you worked with were phenomenal and EXTREMELY kind.", "Cons": "There were definitely favorites played. Newbies got stuck with the crap jobs nobody higher up wanted to do. They definitely overworked you during your shift. One person trying to work wall (deep fryers & grill) AND trying to work table (Making the sandwiches/piecing meals together) is freaking tough. I never got trained on drive-thru's or the front cash register. (Possibly due to being underage.)"}, "3": {"Date": " Dec 18, 2017", "Summary": "\"Fine for a summer job\"", "Pros": "As a summer job it was fine. Customers annoying and management unprofessional, but not any different from expected", "Cons": "You will get injured."}, "4": {"Date": " Dec 3, 2017", "Summary": "\"The worst part was the customers tbh.\"", "Pros": "Everyone who works there is great save for a few. They're very forgiving if you prove you're a good employee and they're extremely flexible with hours.", "Cons": "Some of the customers are absolutely horrid. Other than that, a manager or two just might not be your kind of person but you can't really do anything about that."}, "5": {"Date": " Dec 17, 2017", "Summary": "\"McDonald's\"", "Pros": "Easy job, low skilled, easy interview", "Cons": "Rude customers, relatively low benefits"}, "6": {"Date": " Dec 17, 2017", "Summary": "\"Frontline Cashier\"", "Pros": "I was able to meet new interesting people as well work with alit of interesting hardworkers. We was always busy which helps your time at work.", "Cons": "U never get any time to take your break. Always busy trying to keep up with your tasks."}, "7": {"Date": " Dec 18, 2017", "Summary": "\"Shift Manager\"", "Pros": "* Flexible time* Promoted within months", "Cons": "* No control over their people"}, "8": {"Date": " Dec 2, 2017", "Summary": "\"Swing Manager\"", "Pros": "Fun and exciting to see new people and new faces daily. Get to enjoy seeing kids run and have fun inside the restaurant. You get to see regulars (usually older people) who get to know you.", "Cons": "Very stressful at times. Customers can be rude. It's a little too easy to get sick at work. Stores can be old."}, "9": {"Date": " Dec 3, 2017", "Summary": "\"Cashier\"", "Pros": "Fast paced, fun, lots of fun people to work with", "Cons": "Tiresome, not too high of a pay"}}