{"0": {"Date": " Feb 22, 2016", "Summary": "\"Horrible\"", "Pros": "can create a flexible working scedeule", "Cons": "rude managers, rude customers, just rude"}, "1": {"Date": " Feb 7, 2016", "Summary": "\"Food service sucks\"", "Pros": "Gained customer service experience", "Cons": "Gained experience with talking to customers. The general public are incompetents."}, "2": {"Date": " Feb 8, 2016", "Summary": "\"Financial Manager\"", "Pros": "The historical business culture that is committed to their employees, suppliers and long term growth for the company and shareholders.", "Cons": "None really. If you have aspirations to develop your career in the QSR industry, McDonald's offers the best opportunities."}, "3": {"Date": " Feb 21, 2016", "Summary": "\"Shift Manager\"", "Pros": "Thorough trainingFlexible scheduleDevelops leadership skillsGood for building resumeGreat starting point for management career", "Cons": "Poor quality of home lifeHigh stressBelow average monetary compensationNo health benefitsEmpty promises regarding promotions"}, "4": {"Date": " Feb 21, 2016", "Summary": "\"It's a great job to start with especially if your with people you like!\"", "Pros": "Experience it will get you another job especially if you are a sweet heart to your former boss they will make you look really good and they encourage you to do better, Good pay now that 2016 we get 10 bucks not bad!", "Cons": "Customer can be very rude and some of the employees are rude as well . Some make you feel left out if you just started working there. Some customers really smell bad and/or have horrible breathe and lean over a little too close."}, "5": {"Date": " Feb 21, 2016", "Summary": "\"Crew Member\"", "Pros": "If you show skill and proficiency in doing the different positions (front counter, driver-thru, runner, grill0 than there is plenty of room for advancement.50% discount on all meals on your days off (up to $15)Free Meals everytime you work a shift of 4 hours or more", "Cons": "It is a job where many times people don't want to show up to work, which causes the people that do show up to struggle, since they have to do extra work to carry the burden. Even though managers are trained to be fair and nice to everyone, many managers are still incredibly rude and mean in how they tell crew members what to do. Many managers also \"play favorites\" and make crew members they don't like as much, do the brunt of the work. The age mix of people is either really young or really old, usually either 16 - 22 years olds or senior citizens. Because there are a lot of young people, sometimes the enviroment can feel like being in high school. Some customers can be extremely rude and you have to be able to take yelling, screaming and complaining from customers without responding to them."}, "6": {"Date": " Feb 22, 2016", "Summary": "\"you may think so\"", "Pros": "honest living and free food", "Cons": "rude customers and no parking"}, "7": {"Date": " Feb 6, 2016", "Summary": "\"Team member\"", "Pros": "Great place to work part time", "Cons": "I don't have any problems"}, "8": {"Date": " Mar 14, 2016", "Summary": "\"Crew Member\"", "Pros": "I only worked there because the job was easy to get and I needed to buy school supplies and textbooks for college and put gas in my car, the job itself was easy", "Cons": "Extremely low pay, poor treatment by coworkers and customers, the job itself was easy but the pace you had to work at made it difficult"}, "9": {"Date": " Feb 21, 2016", "Summary": "\"McDonald's\"", "Pros": "Free meal, flexible hours, easy to be hired, can work your way up", "Cons": "Short staffed, drunk/ high coworkers, poor management"}}