{"0": {"Date": " Jan 23, 2016", "Summary": "\"Okay\"", "Pros": "Fast pace time fly job.", "Cons": "Bad working environment and not go with communication needs work with how people work in the environment."}, "1": {"Date": " Jan 23, 2016", "Summary": "\"Just a gateway..\"", "Pros": "It is a work environment that will always keep you entertained. You can also form a close bond with co workers.", "Cons": "Job csn be demanding. Pay is not that great if you plan on making a living."}, "2": {"Date": " Jan 5, 2016", "Summary": "\"Great job\"", "Pros": "Friendly staff, nice customers, discount on food. Clean area and easy working environment, I really enjoyed working here, it is very fun", "Cons": "Some customers complain a lot and it can get pretty crowded. Sometimes we have really dirty people, but we can handle them"}, "3": {"Date": " Feb 12, 2016", "Summary": "\"This deserves no stars\"", "Pros": "Surprisingly they have give many hours. Anyone can be full time here. Easy to learn everything is basic.", "Cons": "Managers are always fighting & stabbing each other in the back. Management allows their crew to walk all over them and when they do a no call/ no show or come in late EVERYDAY, they just don't bother to take care of it. I've been working here about 2 1/2 years and never got a review. I get paid a couple cents more than starting crew. There is nowhere to grow here."}, "4": {"Date": " Feb 12, 2016", "Summary": "\"mcdonalds\"", "Pros": "nice colleagues to work with, not much else", "Cons": "bad pay, extremely dull repetitive and hard work without incentives. also even as an experienced lifter my shoulders started becoming completely numb after 10+ hour shifts"}, "5": {"Date": " Jan 22, 2016", "Summary": "\"Okay first job\"", "Pros": "Meet nice people and gain some skills", "Cons": "Not enough pay, no raises"}, "6": {"Date": " Feb 11, 2016", "Summary": "\"McDonald's\"", "Pros": "Got to eat the food.", "Cons": "Low pay and bad hours."}, "7": {"Date": " Jan 8, 2016", "Summary": "\"Not a career for the rest of my life, but a good job for now.\"", "Pros": "Good benefits, especially for managers. Currently undergoing a lot of changes to improve benefits for crew, including education assistance, quarterly bonuses, paid time off, and insurance for crew that have stayed for at least a year. Has always been flexible when I needed time off, as long as I let them know in advance.", "Cons": "AT LEAST ONCE, YOU CAN EXPECT TO BE TREATED LIKE A LAZY MORON JUST BECAUSE YOU WORK AT MCDONALD'S by someone who:     A) has no idea what he or she ordered, but expected you to know what he or she wanted anyway     B) holds you personally accountable for mistakes you were in no way involved in---possibly including mistakes from before you were even hired     C) can't comprehend that you are, in fact, a HUMAN, capable of making a mistake with 1 or 2 sandwiches, out of the 225 sandwiches that you made during the hourAlso, equipment breaks easily and is very expensive to repair, so may stay broken for a while, and you will have occasional coworkers who expect to only do the jobs they want to do, rather than those they were hired to do. Some stores DO NOT CLOSE for holidays (including Christmas) and McDonald's DOES NOT OFFER HOLIDAY PAY."}, "8": {"Date": " Jan 21, 2016", "Summary": "\"Good First Job\"", "Pros": "Good Coworkers. Fun environment and great place for a first job", "Cons": "Can be tiring. Sometimes the employees aren't the best to work with"}, "9": {"Date": " Jan 21, 2016", "Summary": "\"happy employee\"", "Pros": "Great food; fast service; friendly staff; lots of growth opportunities", "Cons": "Not always enough staff to help customers"}}