{"0": {"Date": " Apr 21, 2016", "Summary": "\"Not as bad as they say\"", "Pros": "My store has great managers and that makes it bearable.", "Cons": "Random schedule, constantly short handed"}, "1": {"Date": " Apr 7, 2016", "Summary": "\"McDonald's\"", "Pros": "I have the day to do what I need to.", "Cons": "not a whole lot of money for the work."}, "2": {"Date": " May 12, 2016", "Summary": "\"Cool\"", "Pros": "Good Customer service and food", "Cons": "Many employers are not humble."}, "3": {"Date": " Apr 21, 2016", "Summary": "\"Good for a teenager\"", "Pros": "Mostly good coworkers, free food (which I've heard has now been limited and maybe even taken away).", "Cons": "Didn't get requested time off even though I requested it months in advance, was made to come in with a fever of 103, while other workers called out to go to the beach with their friends and had no repercussions (don't know why I cared so much about that job that I was willing to do that), no appreciation for being a great and loyal employee, in fact, we got a new manager and he didn't like me for no reason. Others were asked to go to manager classes that had been there less time than I had. Obviously very few raises, maybe 10 cents ever 6 months or something stupid like that, they were obsessed with their service times and policies, it was not that serious, its a fast food joint and were being paid minimum wage."}, "4": {"Date": " Apr 21, 2016", "Summary": "\"Meh\"", "Pros": "Flexible hours, corporate training, move fast up chain", "Cons": "Terrible management, non-caring franchise owners, low pay"}, "5": {"Date": " Apr 2, 2016", "Summary": "\"McDonald's Review\"", "Pros": "The management was amazing and respected the employees", "Cons": "The only bad part was that most teenagers never wanted to come in for their shift"}, "6": {"Date": " Apr 6, 2016", "Summary": "\"t\"", "Pros": "customer service skills acquired", "Cons": "not the best working enveironment"}, "7": {"Date": " Apr 7, 2016", "Summary": "\"Good first job\"", "Pros": "The discount is good at 50%. I also enjoy the meal on break and free drinks. The pay isn't half bad for a starter job either.", "Cons": "They schedule you lots at first to understand your skill level and get you trained so you can start working alongside everyone else."}, "8": {"Date": " Apr 7, 2016", "Summary": "\"Not only A but an A+ company\"", "Pros": "1. Solid & full function training program, especially valuable for Trainee2. Good teamwork spirit3. Recognize people rather than punish them", "Cons": "1. Too SOP-oriented2. Less competitive wages for part-time employees"}, "9": {"Date": " Apr 7, 2016", "Summary": "\"Crew trainer\"", "Pros": "It's starting to get better with the way it's being ran", "Cons": "They need to start working as a team"}}