{"0": {"Date": " Apr 28, 2017", "Summary": "\"Easy job\"", "Pros": "Competitive salary, easy work, laid back, friendly staff, no breaks, inconsistent about hours, had to stay after scheduled time, not flexible which schedule", "Cons": "Short staffed, busy on concert nights, disgusting working conditions, bugs, no direct deposit, can't eat at any of the restaurants owned by this stores owner"}, "1": {"Date": " Apr 28, 2017", "Summary": "\"Many years at mcdonalds\"", "Pros": "It is a good job to learn how to deal with a fast paced environment as well as work well with others as a team to back each other up.", "Cons": "At the very least the mcdonalds I worked at had poor management which made the job much harder than it needed to be."}, "2": {"Date": " Apr 28, 2017", "Summary": "\"It's Mcdonalds\"", "Pros": "- Gain experience- Customers & majority of the staff made you feel at home- Free fountain drinks & coffee on the clock- Discount on lunch break", "Cons": "- Lack of training. Be expected to be thrown out there and not taught how to do anything, but coworkers will still get frustrated at you for not knowing how to do something.- Will make you question how some people got promoted to management positions.- Big con for me was that the management did not care about the customers; orders CONSTANTLY wrong and busted restrooms for instance.- Understaffed during peak hours and overstaffed at night"}, "3": {"Date": " Apr 13, 2017", "Summary": "\"....\"", "Pros": "Flexible scheduling, get along with coworkers and bosses free meal", "Cons": "Needs more night shift people"}, "4": {"Date": " Apr 28, 2017", "Summary": "\"Good Temporary Employment\"", "Pros": "Flexible hours, customer service experience.", "Cons": "Terrible pay (even as a manager), poor environment, poor conditions, lazy coworkers."}, "5": {"Date": " Apr 14, 2017", "Summary": "\"Good first work experience\"", "Pros": "Flexible hours, professional and caring management", "Cons": "None do come to mind"}, "6": {"Date": " Apr 14, 2017", "Summary": "\"It was good\"", "Pros": "Good start up job for young peopleGood start up job for no resume.Good start up job for less experience", "Cons": "Typical fast food jobCan have bad coworkers. My coworkers liked to smoke pot a lot but they got fired and then got better coworkers"}, "7": {"Date": " Apr 27, 2017", "Summary": "\"Crew Member Review\"", "Pros": "I learned how to work really well in a fast-paced environment. Coworkers were always friendly.", "Cons": "Some of the management could be rude."}, "8": {"Date": " Apr 12, 2017", "Summary": "\"Good Company\"", "Pros": "They were willing to work around my schedule", "Cons": "The customers get crazy sometimes"}, "9": {"Date": " Apr 12, 2017", "Summary": "\"Crew Trainer\"", "Pros": "Loved it! Would change nothing, Freeport,NY McDonald's is the best McDonald's to ever work at no complaints at all", "Cons": "No complaints at all! Best place to work"}}