{"0": {"Date": " May 9, 2017", "Summary": "\"Work\"", "Pros": "Goodbye and goodnight all the time", "Cons": "Bad Because it wasn't fun"}, "1": {"Date": " Apr 17, 2017", "Summary": "\"Good starter job nothing else\"", "Pros": "crew meal, decent pay, fast paced", "Cons": "poor management, hostile conditions, lack of good motivation and high employee turnover rates"}, "2": {"Date": " Apr 17, 2017", "Summary": "\"I miss my coworkers but not my job.\"", "Pros": "It's very easy to advance to a shift manager from a crew member.", "Cons": "Not a lot of opportunities for advancement after shift manager. I was constantly harassed to stay past my shift and told on more than one occasion I had to or I'd be fired. Raises and reviews weren't frequent enough. Large turnover rate with crew members. I was expected to go to the bank off the clock after my shift to drop off a deposit everyday when it was totally the opposite direction from where I lived and it took 20 mins just to get there! Unacceptable"}, "3": {"Date": " Apr 3, 2017", "Summary": "\"Crew member/Trainer\"", "Pros": "Great stability in a job, you will find no better reliability in an income. Scheduling goes to those who work the hardest.", "Cons": "You will not move up unless you are personal friends with the general manager. They run the position decisions like it is a high school popularity contest."}, "4": {"Date": " Apr 16, 2017", "Summary": "\"General Manager\"", "Pros": "McDonald's has a good business model for profit.", "Cons": "Staffing, no one stays because the stress is hard for most."}, "5": {"Date": " Apr 1, 2017", "Summary": "\"Love it\"", "Pros": "You can meet new people and you can find out the difference in people's taste buds.", "Cons": "You stand on your feet alot and you get alot of crap talking from people"}, "6": {"Date": " Apr 1, 2017", "Summary": "\"Great management\"", "Pros": "The managers are very friendly and care about the crew not only as employees but also as people.", "Cons": "Sometimes they will move people around without regard to what some people enjoy. For example person A and B are equally good at the grill but person A hates grill and person B loves it. Both are also equally good at everything else but management decides to send person A to grill."}, "7": {"Date": " Apr 1, 2017", "Summary": "\":)\"", "Pros": "Great pay, great people, great benifits", "Cons": "Depends on your Point of veiw"}, "8": {"Date": " Apr 1, 2017", "Summary": "\"Good job\"", "Pros": "It's a friendly environment to work in", "Cons": "Big orders are stressful sometimes"}, "9": {"Date": " Apr 1, 2017", "Summary": "\"cashier , greeted the customers as they walked in , cleaned the lobby , and presented\"", "Pros": "the pros about working at McDonalds is that when you are there at work theres never a dull moment. everyone is nice and very helpful.", "Cons": "the cons about working at McDonalds is that the management will take advantage of there power especially the younger managers."}}