{"0": {"Date": " Jun 9, 2016", "Summary": "\"swing shift management takes your life you live at McDonald's\"", "Pros": "Advancement was fast and training was informative", "Cons": "Rude customers not organized no respect to eachother not really a welcoming environment"}, "1": {"Date": " Jun 10, 2016", "Summary": "\"Crew Member\"", "Pros": "Fun to work with co-workers", "Cons": "No benefits really, understaffed at times"}, "2": {"Date": " Jun 9, 2016", "Summary": "\"employe\"", "Pros": "discounts on foodnice management", "Cons": "low payrude customer'shorrible maintenance"}, "3": {"Date": " Jun 9, 2016", "Summary": "\"Don't work there\"", "Pros": "Free food and drinks after hours", "Cons": "terrible management and rude coworkers"}, "4": {"Date": " Jun 10, 2016", "Summary": "\"Disorganized\"", "Pros": "Okay wagesAlways busyCan be negotiated with pertaining to hours", "Cons": "It was so disorganized no one had a specific job. It was just whoever was there at the moment, that's the job they did. Everyone was always yelling and running around wildly."}, "5": {"Date": " May 25, 2016", "Summary": "\"McDonalds | Part Time - Student\"", "Pros": "A great way to put in part-time hours and get a bit of \"spending cash\" if you are a student, and don't mind having very few hours.", "Cons": "Very large team / selection of employees, lack of schedule consistency."}, "6": {"Date": " Jun 8, 2016", "Summary": "\"Good place to pick up a few extra bucks.\"", "Pros": "You do get rewarded for hard work.", "Cons": "Not too many, it was mostly pretty good."}, "7": {"Date": " Jun 8, 2016", "Summary": "\"Working At McDonalds Is What You Make Of It, If You Don't Want To Work Like A Robot This Is Not The Place For You.\"", "Pros": "Employee Discount, Good At Working Around School Schedule, Meet Great People Including Customers, Managers, and Coworkers, and Free Drinks On The Job.", "Cons": "Angry Customers, Lots Of Gossip Between Managers and Crew Members, Can Be Over Worked Sometimes, and Men Constantly Flirting With You."}, "8": {"Date": " Jun 8, 2016", "Summary": "\"Cashier\"", "Pros": "Get better at talking to people.", "Cons": "No free lunches on break time"}, "9": {"Date": " Jun 8, 2016", "Summary": "\"Pay\"", "Pros": "The airport location automatically offers above minimum wage as a instant bonus and the hours are pretty good.", "Cons": "The hours did not agree with my school schedule and I never made over $200 every two weeks."}}