{"0": {"Date": " Apr 6, 2016", "Summary": "\"Administration\"", "Pros": "Flexible Schedule. As an administrator I didn't have to deal with many of the direct customer complaints.", "Cons": "Worked for a franchised, so the owners refused to followed recommended guidelines set by corporate. Instead they paid less, scheduled fewer employees, and were more prone to dismiss hardworking employees. Overall, do not work for a franchise. Instead corporate is a lot better."}, "1": {"Date": " Mar 23, 2016", "Summary": "\"Managing\"", "Pros": "Easy working as long as you run the store", "Cons": "Couldn't keep good employee during stay"}, "2": {"Date": " Mar 23, 2016", "Summary": "\"Only 25 cent above general employee pay\"", "Pros": "Nice environment if you keep to yourself.", "Cons": "You may have to out up with a lot of unneeded challenging from upper management."}, "3": {"Date": " Mar 23, 2016", "Summary": "\"Job\"", "Pros": "Great atmosphere and fun working environment with great managers and great hours. Very easy to move up", "Cons": "Sometimes the scheduling was inconstant . Uniforms really did suck"}, "4": {"Date": " Mar 23, 2016", "Summary": "\"Breakfast crew\"", "Pros": "work with fun interesting people", "Cons": "having a boss young enough to be your own child"}, "5": {"Date": " Apr 5, 2016", "Summary": "\"Asset Intern\"", "Pros": "Great team and bosses that you get to work with. Very flexible scheduling and half-day Fridays!", "Cons": "Not enough work for the entire summer"}, "6": {"Date": " Apr 5, 2016", "Summary": "\"Department Manager\"", "Pros": "It is a great learning experience...", "Cons": "It could be handled better"}, "7": {"Date": " Apr 6, 2016", "Summary": "\"crew trainer\"", "Pros": "One free meal comp per day", "Cons": "Unsanitary work go home smelling like grease"}, "8": {"Date": " Apr 6, 2016", "Summary": "\"good place to start, but not stay\"", "Pros": "flexible schedules, fun place to work in, good place for a first job", "Cons": "management would sometimes send people home if there wasnt enough customers coming in. some managers expected too much of minimum wage workers. little room for advancement."}, "9": {"Date": " Apr 26, 2016", "Summary": "\"Horrid Location\"", "Pros": "Free food at break. Partial uniform provided. Good exercise if you work like should. Store will always do well because of location.", "Cons": "Most employees lazy, bad attitude toward other employees and even customers. Employees didn't follow dress code and texted during shift. Managers bad attitudes toward employees and not following procedures."}}