{"0": {"Date": " Feb 25, 2017", "Summary": "\"Crew Trainer\"", "Pros": "It's an organized, clean, and we have a large work area in every different work station. Everything is in one spot. Everything has a spot so it makes it easier when you're stocking.", "Cons": "The downside of working at this particular McDonald's there's a lot of drama, gossip and he said, she said rumors. Certain people are fake meaning they talk to your face as nice as can be but as soon as u turn your back they're saying something about you negatively."}, "1": {"Date": " Mar 12, 2017", "Summary": "\"Crew\"", "Pros": "I appreciate the customer service experience.", "Cons": "I did not like some of the people I had to deal with"}, "2": {"Date": " Feb 24, 2017", "Summary": "\"Excellent!\"", "Pros": "Great fries and have great benefits", "Cons": "No complaints here, I love it here its amazing!!!!!!"}, "3": {"Date": " Apr 2, 2017", "Summary": "\"Mchell\"", "Pros": "Honestly there aren't any I hated that place just based on treatment alone", "Cons": "Its just poorly managed"}, "4": {"Date": " Mar 11, 2017", "Summary": "\"Probably what you would expect\"", "Pros": "Flexible hours, but that is it.", "Cons": "Not enough space for work"}, "5": {"Date": " Feb 24, 2017", "Summary": "\"Working as a Team\"", "Pros": "The Best reason to work at McDonald's is the team you get to work with. My fellow managers and crew are awesome. We work together as a team and that's what makes the job flow so smoothly. It makes for a great day at work. I love my team, they're my McFamily.", "Cons": "The only cons I have where I work are, the xtra time you have to stay over because of people not showing up for work, and having to train people that don't want to work and end up quiting and just wasting your time and everyone else's time because they found out what hard work was like."}, "6": {"Date": " Mar 10, 2017", "Summary": "\"fun\"", "Pros": "great hours, free food, free wifi", "Cons": "coworkers don't work, pay, sick days"}, "7": {"Date": " Mar 10, 2017", "Summary": "\"Shift manager\"", "Pros": "Work with your schedule", "Cons": "DRAMA, drama everyone was always on something"}, "8": {"Date": " Feb 23, 2017", "Summary": "\"Great Place to Work\"", "Pros": "Encouragement to do a good job and great benefits and pay", "Cons": "Location is bit on the far side of town and hard to get to"}, "9": {"Date": " Mar 11, 2017", "Summary": "\"McDonald's\"", "Pros": "Rise ,work any hours you want", "Cons": "Pay, Bad place to work"}}