{"0": {"Date": " Aug 29, 2016", "Summary": "\"favoritism in the workplace\"", "Pros": "You get free water(small), your entire shift and 1 meal every shift you work. meal must be $3 under", "Cons": "no teamworkmanagement favoritism with older employees.employees only helping out friends instead of anyone in need of help."}, "1": {"Date": " Aug 30, 2016", "Summary": "\"Good money for teens\"", "Pros": "Decent money if you're a teen", "Cons": "Disrespectful customers. Gave me the runarounds when I first applied."}, "2": {"Date": " Aug 14, 2016", "Summary": "\"Good\"", "Pros": "Benefits and free food/discounts, easy, good for starters, manageable, fun, pleasant, good experience, decent starting hourly pay.", "Cons": "Fast paced (for some), standing and staying up on your feet for long periods of time"}, "3": {"Date": " Aug 14, 2016", "Summary": "\"Good\"", "Pros": "Good job and work place.", "Cons": "A lot of standing up work jobl"}, "4": {"Date": " Aug 28, 2016", "Summary": "\"Not sure what this means\"", "Pros": "Very friendly and helpful co'workers team work oriented. Managers at the franchise I worked at on my shift were very considerate and appreciated their workers.", "Cons": "During the time that I was working at the East North Ave. franchise management was about to change and the business was in total chaos financially. Our checks were bouncing and now their under a totally new management team with new owners."}, "5": {"Date": " Aug 29, 2016", "Summary": "\"Ok first job\"", "Pros": "Good first job as a teenager or young adult. Expands your social skills and learns to deal with finicky people.", "Cons": "Managers and other employees are often mean and degrading. No good incentive programs."}, "6": {"Date": " Aug 28, 2016", "Summary": "\"Shift MAnager-Easy work with decent pay if you can handle people\"", "Pros": "Pay is actually decent at the manager level with none of the work being to difficult or nasty. Also extremely flexible hours is very nice.", "Cons": "you will have to put up with some far less than stellar quality people both as crew and customers. Cussing is common from angry customers."}, "7": {"Date": " Aug 29, 2016", "Summary": "\"horrible\"", "Pros": "Easy interviewi can't think go anything else good to say", "Cons": "walk out smelling horriblemanagers do not treat employees gooddeal with rude customersnot worth 8.05part time felt like full time and wasnt flexible with school schedule"}, "8": {"Date": " Aug 29, 2016", "Summary": "\"associate manager\"", "Pros": "The employees were great and I learned a lot in managing a staff of 8 or more employees.", "Cons": "The pay wasn't good and was treated poorly by corporate."}, "9": {"Date": " Aug 29, 2016", "Summary": "\"mcdonalds\"", "Pros": "Be able to work my best and gain money", "Cons": "The environment was bad, poor management and lack of communication."}}