{"0": {"Date": " Oct 5, 2016", "Summary": "\"good\"", "Pros": "good I enjoyed the discount on food", "Cons": "good the company was somewhat nice to work for"}, "1": {"Date": " Oct 5, 2016", "Summary": "\"Team Member\"", "Pros": "Flexible Hours, Very Easy Fun", "Cons": "Hot, no communication, sometimes crowded."}, "2": {"Date": " Nov 10, 2016", "Summary": "\"Ehhhh\"", "Pros": "Nice pay, a dollar above minimum wage. You can get some of the hours you want, and days off but you have to ask about a month in advance.", "Cons": "One of my managers came in high or late on multiple occasions, and many people were just downright rude to me while I worked there."}, "3": {"Date": " Oct 20, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Flexibility in schedules is definitely a plus, full time student and part time worker they were definitely flexible in scheduling shifts around school, if you are firm with your schedule.", "Cons": "I mean working with the public, so getting cursed at, drinks & food thrown at you, the pressure to work under a deadline and act as if what happens in these four walls is the only thing that matters in your life. Yeah, but they're flexible."}, "4": {"Date": " Oct 6, 2016", "Summary": "\"cashier\"", "Pros": "McDonald's is a good place to work its fun easy and they have great benefits also they will work around your schedule if need so", "Cons": "Really don't have any con's except for Its a job and just like any job Some have issues with some they may work with But that's anywhere you go"}, "5": {"Date": " Oct 19, 2016", "Summary": "\"Not too bad\"", "Pros": "busy shifts made the day go by faster", "Cons": "rude guests at times could affect your mood"}, "6": {"Date": " Oct 19, 2016", "Summary": "\"Cashier\"", "Pros": "I liked that this job was fast paced and there was rarely time to get bored.", "Cons": "The management was not the best."}, "7": {"Date": " Oct 20, 2016", "Summary": "\"horrible work envirorment\"", "Pros": "You were able to use you employee discount during lunch.", "Cons": "Always was drama going on and workers never got along.it was always hot"}, "8": {"Date": " Oct 4, 2016", "Summary": "\"It was a great experience really enjoyed my time there and of course the food.\"", "Pros": "The best was the great communication that my workers had with each other and my manager was a great help with advisement and etc", "Cons": "The cons were that you have to be at that job 24/7. Working all day and everyday it really stresses you out and the customers are sometimes very rude so you have to keep your composure."}, "9": {"Date": " Oct 4, 2016", "Summary": "\"Great part time job\"", "Pros": "McDonald's has very flexible hours.", "Cons": "McDonald's has low pay to start out."}}