{"0": {"Date": " Mar 2, 2016", "Summary": "\"They reward the hard workers\"", "Pros": "- flexible hours- merit based promotions- great training- high levels of responsibility for young managers- make good friends", "Cons": "- relatively low pay for crew (depending on franchise)- stressful when short staffed- makes you hate eating there"}, "1": {"Date": " Mar 2, 2016", "Summary": "\"Alright\"", "Pros": "love the job! great atomsphere and lots of options to grow!", "Cons": "Lots of people. Sometimes don't get enough hours. Managers don't always do what s best for the company"}, "2": {"Date": " Mar 16, 2016", "Summary": "\"Just getting the hourly rate.\"", "Pros": "Lot's of fun to train new people. And free food.", "Cons": "Some customer's can be rude."}, "3": {"Date": " Mar 16, 2016", "Summary": "\"Great Co Workers and Customers\"", "Pros": "Fun place to work. Everyday is different", "Cons": "Rude customers and no guarantee of hours"}, "4": {"Date": " Mar 16, 2016", "Summary": "\"Not bad for flexiblility\"", "Pros": "They normally have a lot of crew, so their able to work with schedules. Get great experience in customer service.", "Cons": "As management there is not much flexibility with scheduling, rather you get forced into shifts you don't want."}, "5": {"Date": " Mar 17, 2016", "Summary": "\"First Job\"", "Pros": "Flexible hours, short shifts, great for high schooler", "Cons": "It was a pain to take time off"}, "6": {"Date": " Mar 17, 2016", "Summary": "\"Mcd\"", "Pros": "It was an easy job. Made many friends. I would do it again", "Cons": "It's Mcdonalds . Bad pay . Shameful job"}, "7": {"Date": " Mar 1, 2016", "Summary": "\"Store manager\"", "Pros": "You can begin as a crew person and work your way up to a store manager in a short time just depends on how determined you are with only a high school education", "Cons": "It's very hard and demanding job dealing with the public can be difficult. The hours can be up to 50 hours a week and you usually have to always work holidays."}, "8": {"Date": " Mar 2, 2016", "Summary": "\"Good First Job\"", "Pros": "Very flexible hours, Simple work, Learn to work under pressure", "Cons": "Rude customers, Poor Management (upper), Lots of drug users (marijuana, mostly)"}, "9": {"Date": " Mar 15, 2016", "Summary": "\"It was a summer job\"", "Pros": "Easy to get hiredManagers were fair and helped when necessaryEasy to get started and learn at your own pace on the jobFree meal during each shift", "Cons": "Consistently had to work the late shift due to being older than 18Overall immature/difficult coworkersStressful when busy, boring when slowDifficult, entitled customersCoworkers who smoke get more breaks than those who don't"}}