{"0": {"Date": " Jan 10, 2017", "Summary": "\"Working at McDonald's\"", "Pros": "-Flexible schedule-Get to meet new people-Work is relatively easy", "Cons": "-Low pay-Managers aren't the best-Training system is terrbile"}, "1": {"Date": " Jan 11, 2017", "Summary": "\"Crew Trainer\"", "Pros": "Good place to work Very friendly. I actually kind of miss working here. It was a very exciting job.", "Cons": "Tough work stressful at times. Not a very good management team in my opinion. Need to listen to the workers a little more than they didd."}, "2": {"Date": " Jan 11, 2017", "Summary": "\"cook\"", "Pros": "nice people, free food, good hours", "Cons": "nothing bad to say about this employer"}, "3": {"Date": " Jan 11, 2017", "Summary": "\"Former Crew Trainer\"", "Pros": "- Lots of areas to learn and grow within the restaurant- Plenty of opportunities to interact with a large diversity of people- Some opportunity to move up", "Cons": "- Minimal pay/low raises- Management is usually sub par and are forced to bite off more than they can chew, work long hours with little backup- Respect from management and customers is sometimes very low"}, "4": {"Date": " Jan 11, 2017", "Summary": "\"Overall OK\"", "Pros": "I can work a lot of hours if I want", "Cons": "I do not make much money"}, "5": {"Date": " Dec 26, 2016", "Summary": "\"Hard, Dependable worker cook,shiftmanger,crew member\"", "Pros": "Working for this company keep you in touch with the people, I love talking helping my people", "Cons": "As long as you love what you do there is on cons"}, "6": {"Date": " Dec 26, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Easy schedule, working with diverse group of people from all walks of life, free food", "Cons": "management holds grudges if you outperform other workers they clearly favor and when corporate visits and says you're doing a wonderful job, will cut your hours. YMMV"}, "7": {"Date": " Dec 27, 2016", "Summary": "\"Is this the best place to work\"", "Pros": "You get along with everybody nobody is friendly and teamwork", "Cons": "There's no really cons to this job"}, "8": {"Date": " Jan 31, 2017", "Summary": "\"Gulf Shores AL\"", "Pros": "Free Meals and sooda and coffee", "Cons": "The entire job is complete misery"}, "9": {"Date": " Jan 31, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Lots of hours, overtime, some fun times", "Cons": "No raises, unsafe location, multiple robberies"}}