{"0": {"Date": " Jun 18, 2016", "Summary": "\"A fine burger with cheese\"", "Pros": "I enjoyed my short time with McDonalds was a fine experience,full of love, laughter, and french fries.", "Cons": "None - it was a good summer job"}, "1": {"Date": " Jun 18, 2016", "Summary": "\"Manager\"", "Pros": "Free meals & uniforms good crew", "Cons": "Money poor raises long hours"}, "2": {"Date": " Jun 19, 2016", "Summary": "\"Cashier\"", "Pros": "It has a lot of great opportunities, especially for those who are still in high school. Great place to make friends.", "Cons": "It's hard to get a lot of hours because they hire so many people at a time. Also management is a little on the downside as well."}, "3": {"Date": " Jun 17, 2016", "Summary": "\"Fast food wprk\"", "Pros": "You can grow with the company", "Cons": "Dealing with attitude sometimes from the manager"}, "4": {"Date": " Jul 23, 2016", "Summary": "\"cook\"", "Pros": "I cant think of any", "Cons": "Just Working at Mcdonalds was a con"}, "5": {"Date": " Jun 17, 2016", "Summary": "\"time\"", "Pros": "great management but very busy", "Cons": "they will cut your time and i hate it"}, "6": {"Date": " Jun 18, 2016", "Summary": "\"Good\"", "Pros": "Free McDonald'sDiscountGood payPaid sick daysVacation days", "Cons": "Late night shiftsSome rude customersGreasy environmentEat a lot of unhealthy foodsLate night shifts"}, "7": {"Date": " Jul 1, 2016", "Summary": "\"So-so workplace\"", "Pros": "-very good hours-team members were friendly-never boring or tedious work-opportunity for promotion-roles were fairly straight forward-medical and dental benefits if full-time-", "Cons": "-always very fast paced-managers were constantly micromanaging-your work was always rushed-I wanted to work full-time but they gave me 38 hours per week to avoid giving benefits"}, "8": {"Date": " Jul 22, 2016", "Summary": "\"Horrible place to work, Great job exp\"", "Pros": "Great first job, free small cup for employees", "Cons": "Paid 1.25 under minimum, took some money from my paycheck BC register shortage, no discount"}, "9": {"Date": " Jul 1, 2016", "Summary": "\"mcdonalds is job not a career get in get out.\"", "Pros": "they give you hours if your a good worker50% discount when youre working", "Cons": "managers are lazy, especially when the floor is short staffed"}}