{"0": {"Date": " Dec 29, 2015", "Summary": "\"Not worth it\"", "Pros": "The only real pro is that you get free food and normally the days you would like off are honored", "Cons": "The amount of stress associated with this job is no where near worth the pay rate. Customers are also extremely rude"}, "1": {"Date": " Dec 29, 2015", "Summary": "\"management\"", "Pros": "I liked to manage the crew and go through classes in Kansas city", "Cons": "Miami Oklahoma mcdonalds not fair to employees"}, "2": {"Date": " Dec 29, 2015", "Summary": "\"Cashier at mcdonalds\"", "Pros": "Free one meal at each shiftflexible time", "Cons": "they have horrible management. I have worked for walmart and I know how bad managment can be and believe me when i say mcdonalds is driven for one goal like every other store money"}, "3": {"Date": " Dec 30, 2015", "Summary": "\"Marketing\"", "Pros": "Great benefits for working fulltime", "Cons": "Long hours high turnover at the restaurant"}, "4": {"Date": " Dec 10, 2015", "Summary": "\"Human Resources\"", "Pros": "Great company to work, Great benefits with comparable compensation with bonus opportunity. Many development opportunities. Ever changing environment with policy, procedure, product. Loved the challenges and change leadership.", "Cons": "You must have the willingness/eagerness to thrive in a challenging/changing environment."}, "5": {"Date": " Dec 14, 2015", "Summary": "\"Swing Manager Views\"", "Pros": "Flexible hoursVery great trainingThey are very hands on with the teachingTime management and money management skills can be used beyond the job.", "Cons": "Because of the flexibility sometime the schedule may look a little hectic. Fast paced from time to time often under staffed"}, "6": {"Date": " Dec 14, 2015", "Summary": "\"Cashier\"", "Pros": "A different experience with every customerServsafe certifiedDiscount on foodMeeting lots of different peopleAward Lunch PassesFree meals for managersGives you experience and teaches you new skills", "Cons": "The food was generally fatty and not particularly healthyManagement could be unpredictableOnly the managers get benefitsShort breaksSome days and slow and some days are fast. You never know what to expect."}, "7": {"Date": " Dec 28, 2015", "Summary": "\"It's McDonalds\"", "Pros": "I needed a job, and they had one. It was nowhere near as bad as I thought it would be. I enjoyed the people I worked with sometimes.", "Cons": "A guy i worked with said we got free burgers, which turned out not to be true. I was very angry about that once I found out."}, "8": {"Date": " Dec 29, 2015", "Summary": "\"Crew Member\"", "Pros": "Flexible with student schedules, good for a first job,", "Cons": "Safety Hazards: Out of date equipment, violent/aggressive customers, lack of teamwork, no management/ management- member communication, and poor management in genera. Not a long term job."}, "9": {"Date": " Dec 13, 2015", "Summary": "\"It was a great experience and had an energetic atmosphere.\"", "Pros": "teaches people skills, fast paced environment, friendly customer service skills, cashier experience and team working abilities between management and crew members", "Cons": "keeping up with existing workers, dealing with rude customers, understanding difficult customers, dealing with favoritism, and having varying schedule hours"}}