{"0": {"Date": " Apr 3, 2017", "Summary": "\"Never Get a job here. Worst job I have ever had, and this is just my second job!\"", "Pros": "Your making some money, not much, just some.", "Cons": "The only healthy thing to eat is the small oranges in the happy meals, even then that is a stretch.People from previous shifts leaving all their trash everywhere in the back.Customers who leave their trays and trash on the table and leaving.People putting things into a trash can that is already overflowing.Children running around without shoes one even when their not supposed to, then slipping and people blaming it on maintenance for not putting a wet floor sign even though the floor is completely dry.You will get a major lack of sleep and constant migraines.Muscle crams and aching joints.People complaining about you not doing your job when your doing it the best you can and more as fast as you can, even worse when your doing something that really needs to be finished.Even after everything you do, you still get complained at by a manager about how slow you are, even when you are going as fast as the road runner with each task to get everything done.They are so cheap, they still use mops and brooms to clean the store. ( Some swiffer and a vacuum cleaner would be nice.)They give to many days to a part time worker, thus giving them no time to have a life.And finally, every day you will hate your job there more and more as you continue to work there."}, "1": {"Date": " Apr 4, 2017", "Summary": "\"Do Not Work Here\"", "Pros": "During every 8 hour shift, you receive one free meal.", "Cons": "Terrible management, terrible with scheduling, unfriendly staff, terrible environment"}, "2": {"Date": " Feb 26, 2017", "Summary": "\"Flexibility\"", "Pros": "Flexible, especially for students and you gain experience for a better job", "Cons": "Short hours or extremely long depending on the shift manager, annoying customers... basically limit your stay to a year."}, "3": {"Date": " Feb 26, 2017", "Summary": "\"Corporate, good; franchise, bad\"", "Pros": "McDonald's is the reason I went back to school to get my MBA. Their corporate training program and performance standards are phenomenal, as is their implementation of Six Sigma practices and their general attitude of upward mobility.", "Cons": "The franchise owner I worked for absolutely did not share the values of the corporation. My advice would be to work for a corporate-run location if you have the opportunity."}, "4": {"Date": " Feb 26, 2017", "Summary": "\"Cool place to work at\"", "Pros": "Funneatcoolfastgood food for on the go", "Cons": "interesting crowd of people you see"}, "5": {"Date": " Mar 12, 2017", "Summary": "\"Basic first job experience\"", "Pros": "-Flexible schedule-Discounted meals-Dynamic work load", "Cons": "-High turnover rate-Severe lack of skilled employees"}, "6": {"Date": " Mar 12, 2017", "Summary": "\"Best available\"", "Pros": "Jobs are always Available for people", "Cons": "Low payWeird hoursManagers are disorganizedEmbarrassing to say you work there"}, "7": {"Date": " Mar 12, 2017", "Summary": "\"It's a job\"", "Pros": "Free food, free food, free food, and thats about it.", "Cons": "pay is very low and you work like a dog."}, "8": {"Date": " Mar 13, 2017", "Summary": "\"General Manager - Franchisee\"", "Pros": "Flexibility. Room for advancement.", "Cons": "Varied shifts. High turnover. No retirement benefits. No compensation for personal vehicle use. No investment into our retirement."}, "9": {"Date": " Feb 25, 2017", "Summary": "\"great starting job\"", "Pros": "McDonalds was the first job that I ever had and it provided me with the foundation that I needed to continue on in the workplace", "Cons": "The only complaint is that they pay minimum wage or slightly more"}}