{"0": {"Date": " Aug 30, 2016", "Summary": "\"Crew member\"", "Pros": "Easy job. Quick shifts. Free food", "Cons": "Screws you over on hours. Not enough money to survive."}, "1": {"Date": " Aug 30, 2016", "Summary": "\"Ok job\"", "Pros": "Will work you up about 30 hours a week", "Cons": "Have to basically beg for a break even on 9+ hour shift. Managers pick favorites."}, "2": {"Date": " Aug 30, 2016", "Summary": "\"shift manager\"", "Pros": "I enjoy working with my crew and enter acting with my customers.", "Cons": "I have moved to another area so I need employment."}, "3": {"Date": " Aug 31, 2016", "Summary": "\"A Horrid employer\"", "Pros": "Free water and not even free lunch for people working 8hr shifts", "Cons": "McDonald's is horrible my first day with very little training they put me on grill and they had all my shifts as closing even though I really shouldn't be closing but they had me trying to clean the grill and trying to clean the grease traps"}, "4": {"Date": " Aug 9, 2016", "Summary": "\"delivery driver\"", "Pros": "Working with great people. Learned a lot involving the construction business.", "Cons": "No vacation time or sick time."}, "5": {"Date": " Jul 25, 2016", "Summary": "\"Okay\"", "Pros": "The coworkers were great to work with. The hours were great too. Easy to get the shifts you wanted.", "Cons": "Management is run by teenagers with hot heads. Lots of yelling and screaming and never any satisfaction."}, "6": {"Date": " Jul 25, 2016", "Summary": "\"Cashier\"", "Pros": "It's okay but being around fried food all the time is not.", "Cons": "All the fried food and people who come in late at night"}, "7": {"Date": " Jul 25, 2016", "Summary": "\"I liked it\"", "Pros": "Great co workers, 30 min breaks, flexible scheduling.", "Cons": "Rude customers, management was not the best, unproffesional"}, "8": {"Date": " Jul 25, 2016", "Summary": "\"Cashier\"", "Pros": "I liked it, people were friendly, coworkers were civil. Service was good. Customers were satisfied, food was on time and still hot.", "Cons": "I wish there were more workers though, the cleanliness should have been a bit better the drive through servers could have been a bit nicer"}, "9": {"Date": " Jul 26, 2016", "Summary": "\"Crew Member\"", "Pros": "Great team members, flexible hours, and gained valuable customer service skills!", "Cons": "Wide barrier between senior and lower management"}}