{"0": {"Date": " Jun 21, 2016", "Summary": "\"sucked\"", "Pros": "free food when I wanted it", "Cons": "low pay and busy scedule"}, "1": {"Date": " May 31, 2016", "Summary": "\"Ok for first job\"", "Pros": "location close to home, somewhat nice coworkers", "Cons": "low pay, can get busy sometimes"}, "2": {"Date": " May 17, 2016", "Summary": "\"Shift manager\"", "Pros": "I worked there for 3 years its a good place to be if u are willing to learn .", "Cons": "They have great benefits and have the best opportunities if u are a people person."}, "3": {"Date": " May 30, 2016", "Summary": "\"McDonald's definitely gives you a whammy of experience.\"", "Pros": "Teaches you to deal with and manage a lot of unpleasant work. Although people may not necessarily be proud to be a McDonald's employee, you get out what you put into it.", "Cons": "I gained weight working here because there was fast food all around us all the time. The hunger was contagious and binge eating was not an uncommon thing."}, "4": {"Date": " May 30, 2016", "Summary": "\"Lots Of hours at The store running The floor\"", "Pros": "Flexibility in regards to your own scheduleBonos up to 12,000 base on performance5 sick days if you don't use them they pay you. Vacations 2 weeks and up", "Cons": "Overworked, 12 hrs shifts, 6 days a week lots of times. Lock of crew & managers. Lots of no call no show. Weekends are super busy. From 7 am to 9pm. The goals for your labor are difficult to achieve."}, "5": {"Date": " May 15, 2016", "Summary": "\"Lovin' it\"", "Pros": "Great place to work and develop. Fun fast paced environment. Ability to progress and learn as an individual.", "Cons": "Sometimes things happen that you just can't control. Maybe a bus pulls up or your fryers go down, it can be tough."}, "6": {"Date": " May 30, 2016", "Summary": "\"Buyer Beware\"", "Pros": "There are flexible hours and easy to get time off (due to the large number of employees)", "Cons": "Demanding work that doesn't match compensation. No career path unless you're there 10+ years"}, "7": {"Date": " May 15, 2016", "Summary": "\"Cook\"", "Pros": "People you work with are nice. You get customers who are so nice and polite it's makes the job worth having.", "Cons": "Long hours on feet. You can get bad customers to deal with. It is pretty hot in the kitchen"}, "8": {"Date": " May 15, 2016", "Summary": "\"McDonalds, ehh.\"", "Pros": "Overall easy job, not much difficulty if any at all.", "Cons": "Overbearing management can be an issue."}, "9": {"Date": " May 16, 2016", "Summary": "\"Great\"", "Pros": "Great and relaxed office environment", "Cons": "Seems slightly disorganized at times"}}