{"0": {"Date": " May 10, 2016", "Summary": "\"Crew Member\"", "Pros": "It wasn't bad for a high school kid", "Cons": "Low pay, can be very stressful during rushes."}, "1": {"Date": " May 31, 2016", "Summary": "\"Good environment\"", "Pros": "the people are fun to work with and friendly", "Cons": "poor managment and some favortism"}, "2": {"Date": " May 9, 2016", "Summary": "\"McDonald's\"", "Pros": "Discounted meal during shift.Meet great people", "Cons": "Rude customersShift management lazyNo real organizationCan't stand in one spot"}, "3": {"Date": " May 9, 2016", "Summary": "\"Crew\"", "Pros": "There is nothing really good to say about working here it's a kid job nothing more nothing less.", "Cons": "Busy on weekends annoying manegment and inexperienced really nothing good comes out it is a really bad company"}, "4": {"Date": " May 10, 2016", "Summary": "\"sucks\"", "Pros": "fun sometimes cool but annoying people", "Cons": "sucks no good pay it"}, "5": {"Date": " Apr 24, 2016", "Summary": "\"Cashier\"", "Pros": "I love my job because no day is ever the same. Each day I am presented with new challenges and situations, which really helps me to stay focused and interested. I also enjoy being able to be as creative as I can.", "Cons": "Bad hours. I can recall moments I would wake up stressed, bored, and unmotivated. There was no passion or drive, I didn't feel myself improving."}, "6": {"Date": " Apr 24, 2016", "Summary": "\"Decent pay.\"", "Pros": "You become great at multi-tasking. Costumer service may improve because you're going to deal with really rude costumers and you're going to learn how to handle a bad situation well.", "Cons": "Cons of working here would be the possibility of getting your hours cut randomly and then getting no days off. Also costumers can really push your buttons some days."}, "7": {"Date": " Apr 25, 2016", "Summary": "\"Cook\"", "Pros": "Quick simple training. Great benefits. Loved it!", "Cons": "Stigma of working at fast food"}, "8": {"Date": " May 8, 2016", "Summary": "\"Fun Enviornment But...\"", "Pros": "Great coworkers, friendly environment, free meal per day is also a plus. Really easy job, literally anyone can do it, that's why they might hire you!", "Cons": "Inefficient system, management is to blind to see it. When it gets busy we are not prepared at all, yet it gets busy almost all the time. Need new management"}, "9": {"Date": " May 8, 2016", "Summary": "\"McDonald's\"", "Pros": "Flexible schedule, opportunities for becoming managers", "Cons": "Relatively low pay, the smell of fast food can make it difficult to eat enough"}}