{"0": {"Date": " May 17, 2016", "Summary": "\"h\"", "Pros": "Fun job and fun coworkers", "Cons": "Fast paced and very tiring"}, "1": {"Date": " May 1, 2016", "Summary": "\"Certified Swing Manager\"", "Pros": "Allows for growth and just an overall great experience and opportunity to learn how to work with others and in teams", "Cons": "Doesn't allow for too much overtime"}, "2": {"Date": " May 15, 2016", "Summary": "\"Its a great start\"", "Pros": "They are too demanding but yeah", "Cons": "People there are great and the pay is too"}, "3": {"Date": " May 15, 2016", "Summary": "\"It's exactly what you would expect\"", "Pros": "It's a good transition job for someone who needs motivation to go back to school. The service industry will make you want to go back to school right away.", "Cons": "The pay was not enough to live on. I lived with my parents, was asked to pay rent and eventually they realized that I really couldn't do that on this pay."}, "4": {"Date": " May 15, 2016", "Summary": "\"Relocation\"", "Pros": "Flexible,friendly,pay is decent, meet great people", "Cons": "Late nights closing, 24 hr stores"}, "5": {"Date": " May 15, 2016", "Summary": "\"Good Starting Job\"", "Pros": "Great getting foot in the door working jobs and earning money for young teens and gaining some insight on working in the real world.", "Cons": "Terrible pay for the amount of work expected to do (at least when I was working there). If you need time off for anything, they will probably still schedule you anyway and then write up/fire you for not showing up for your shift - even if it was weeks/months of notice in advance."}, "6": {"Date": " Apr 30, 2016", "Summary": "\"Its a good job for a first job experience\"", "Pros": "You make a little money for your first job you gain experience with customer service and you get hours usually flexiable for ppl that are in school", "Cons": "You deal with more than you get paid alot of the time they dont give you a chance to grow with the company"}, "7": {"Date": " Apr 30, 2016", "Summary": "\"Job interview\"", "Pros": "Flexible, get experience, involved in community", "Cons": "Sometimes it is crazy hectic"}, "8": {"Date": " May 1, 2016", "Summary": "\"McDonald's\"", "Pros": "I really enjoyed working with my crew and meeting new coustmers", "Cons": "The owner operator don't listen to her employees"}, "9": {"Date": " May 14, 2016", "Summary": "\"Cashier\"", "Pros": "Free foodFlexible scheduling if you asked for itIDGAF attitude acceptable", "Cons": "Free foodEveryone always calls offIDGAF attitude acceptable"}}