{"0": {"Date": " Feb 18, 2018", "Summary": "\"Decent, co-workers were nice to me.\"", "Pros": "One free meal either during break or after your shift ends. I believe they have a 401k plan and chances to get promoted.", "Cons": "They chose favorites. Lot's of pot smokers and the service was poor. Most of the managers didn't give a hoot about their employees."}, "1": {"Date": " Feb 18, 2018", "Summary": "\"idk\"", "Pros": "good pay, flexible hours, enjoyable work", "Cons": "not too much to say here"}, "2": {"Date": " Feb 18, 2018", "Summary": "\"Crew Member\"", "Pros": "-easy to get in-quick work-can be under 18", "Cons": "-rude customers-rude managers at times-higher ups may be condescending"}, "3": {"Date": " Feb 19, 2018", "Summary": "\"Working at McDonald's\"", "Pros": "Decent pay for a 16 year oldFlexible HoursPlenty of workers if you need a shift coveredPaid time off after a year", "Cons": "Too many workersHard to get the exact hours you'd like"}, "4": {"Date": " Mar 4, 2018", "Summary": "\"Crew member\"", "Pros": "I love the customer. I love doing everything i can to satisfy the customers and see a smile on there faces.", "Cons": "The management is disrespectful along with some staff. Not equal opportunities to all employers as they say."}, "5": {"Date": " Mar 4, 2018", "Summary": "\"3rd shift was okay\"", "Pros": "I worked at McDonald's for 3 months and really liked it..decent work for 10.00 an hour.", "Cons": "Bad managementA lot of people calling out"}, "6": {"Date": " Mar 4, 2018", "Summary": "\"Crew member\"", "Pros": "You met new people all the time", "Cons": "People get mad at you"}, "7": {"Date": " Mar 5, 2018", "Summary": "\"cashier or drive thru\"", "Pros": "we didn't stay in one postition at atime we was always moving", "Cons": "not many hrs cause all of the people workking at one time"}, "8": {"Date": " Mar 5, 2018", "Summary": "\"Crew Person\"", "Pros": "Summer job during high school. made a little spending money", "Cons": "no complaints. wasn't looking to stay long term"}, "9": {"Date": " Feb 17, 2018", "Summary": "\"Crew member\"", "Pros": "Flexible hours, great experiences, great co-workers", "Cons": "I have no down sides as of right now"}}