{"0": {"Date": " Dec 6, 2017", "Summary": "\"Shift Manager\"", "Pros": "It gave me the opportunity to gain manager experience.", "Cons": "looking for a better job."}, "1": {"Date": " Dec 19, 2017", "Summary": "\"Apply elsewhere before applying here\"", "Pros": "There's some good people, free meal everyday, easy work.", "Cons": "Not a livable wage (obviously), the people doing schedules either overload the place with people or its ran on a skeleton crew. I would recommend this job to 18-20 year olds in college, or highschoolers, but if you don't fit that criteria just look for a different job. Try to make something out of yourself for the love of everything that's holy."}, "2": {"Date": " Dec 19, 2017", "Summary": "\"Company Review\"", "Pros": "Flexible work schedule for those still in school/ have another job.Offer good job experience as a 1st time employee.Gain customer service experience.", "Cons": "If the store is slow the manager will tell employees to clock out even if it's not the end of your shift."}, "3": {"Date": " Dec 4, 2017", "Summary": "\"Manager\"", "Pros": "Fast moving, many many advancement opportunities.", "Cons": "Some nights can really drag."}, "4": {"Date": " Dec 4, 2017", "Summary": "\"Department Manager\"", "Pros": "Learned alot about customer service and satisfaction", "Cons": "Not enough support from some managers. Not enough time to properly train crew members. And no harsh punishment for the people who are not trying to improve"}, "5": {"Date": " Dec 5, 2017", "Summary": "\"A great franchisee to work for!\"", "Pros": "The franchisee here does everything they can to help you succeed in this company. Yes, it is a stressful job, but they do all they can to set you up for success.", "Cons": "I really can't think of any. It is a fast food restaurant, so the stress level is always high, but that's to be expected."}, "6": {"Date": " Jan 9, 2018", "Summary": "\"Not worth it\"", "Pros": "Flexible hours until you pick the wrong days off.", "Cons": "Turnover and management are no better than the crew"}, "7": {"Date": " Dec 19, 2017", "Summary": "\"Crew Member\"", "Pros": "Friends work there. Good part time job.", "Cons": "The work enviroment, some people that work there."}, "8": {"Date": " Dec 19, 2017", "Summary": "\"Good first step. Not for multiple steps beyond.\"", "Pros": "Extremely flexible hours.Good first job experience.Teaches you how to work with other people weather you like it or not.Veriety of different jobs to do. Always busy.", "Cons": "Can be extremely monotonous.Opportunity to advance a career at the store level is a joke.Not a pro or a con. Your enjoyment of the job depends on the attitude and competence of your co-workers.You will get burned out quickly so try to stress the need to rotate to different jobs every so often."}, "9": {"Date": " Dec 4, 2017", "Summary": "\"Easy fun work alot of opportunities to move up in your current position.\"", "Pros": "Fast pace work environment meaning challenges which I love. Got to meet and work with foreign students. Learn the difference of there work culture and our work culture.", "Cons": "When a person moves up to a new position there attitude changes. I understand that but most co-workers didn't and took it differently then I did."}}