{"0": {"Date": " Jan 24, 2018", "Summary": "\"employee\"", "Pros": "good hours, free food, no over time", "Cons": "not overtime, no daycare, no holidays off, no benefits"}, "1": {"Date": " Jan 25, 2018", "Summary": "\"MCD\"", "Pros": "Good first job for a young student", "Cons": "hard work with little satisfaction"}, "2": {"Date": " Feb 15, 2018", "Summary": "\"Last Resort Job\"", "Pros": "One free employee meal for each day you work, two days off a week", "Cons": "Never had the tools required to do our jobs correctly, never had enough time or people to do our jobs correctly, managements idea of 'managing' was to stand over us and scream and threaten us, there was literally no training, managers often had us lie during inspections about how we do things in the store, lots and lots of drama - mostly between managers"}, "3": {"Date": " Jan 9, 2018", "Summary": "\"Team Member\"", "Pros": "Free foodGood PayManagers are nice most of the times", "Cons": "Managers are very rude a few times"}, "4": {"Date": " Jan 23, 2018", "Summary": "\"Crew\"", "Pros": "I enjoyed the labor and busyness of company", "Cons": "The ladder wasn't working for me I didn't like going no where"}, "5": {"Date": " Jan 23, 2018", "Summary": "\"nice\"", "Pros": "The people and mgmt are fair and you learnalot", "Cons": "The pay and late hours"}, "6": {"Date": " Jan 8, 2018", "Summary": "\"Manager\"", "Pros": "Amazing company. Great benifits. Love McD’s.", "Cons": "None. Everything is amazing at this place."}, "7": {"Date": " Jan 24, 2018", "Summary": "\"high school/ college kids job\"", "Pros": "Flexible Schedule, management is good working around busy schedules, giving time off.", "Cons": "Fast food atmosphere, not always treated respectfully by management, hours/schedules range all over. less hours in summer due to high school kids/ being overscheduled/ overstaffed."}, "8": {"Date": " Jan 8, 2018", "Summary": "\"Cashier\"", "Pros": "good coworkers. get to meet new people.", "Cons": "have to smile and be polite to everyone even if they are rude to you."}, "9": {"Date": " Jan 8, 2018", "Summary": "\"Cashier\"", "Pros": "Loved getting the free food tbh. Chill job", "Cons": "Pay sucked , and they put me horrible shifts"}}