{"0": {"Date": " Apr 10, 2017", "Summary": "\"Turn the other cheek\"", "Pros": "Overtime , free meals, co worker", "Cons": "Messy people, management, location, pay"}, "1": {"Date": " Apr 10, 2017", "Summary": "\"Pay rate increases every 6 months\"", "Pros": "fun atmosphere for a first job", "Cons": "customers treat you like you are garbage, even if you are doing a decent job"}, "2": {"Date": " Apr 11, 2017", "Summary": "\"ok\"", "Pros": "Good healthy team working environmenmt.", "Cons": "Don't always communicateWell with customers."}, "3": {"Date": " Apr 11, 2017", "Summary": "\"its a start out job.\"", "Pros": "the people I worked with where mostly all friendly.", "Cons": "they would cut your hours all the time."}, "4": {"Date": " Apr 24, 2017", "Summary": "\"Fast paced, not for everyone\"", "Pros": "Desperate for a job, and really need the money. If your good at the job you can advance and become a manager.", "Cons": "If you are a slow learner and worker you will most likely fail at it, however you may be able to skate by."}, "5": {"Date": " Apr 24, 2017", "Summary": "\"Cashier\"", "Pros": "I liked the people I worked with I learned quick.", "Cons": "Is there is always going to be those few that don't like you in the work force."}, "6": {"Date": " Apr 24, 2017", "Summary": "\"Coworkers make or break places like this\"", "Pros": "$9.50/hr in our area is competitive, not bad for a part time job while in college. Coworkers are all really great, easy to get along with. Upper management is friendly and understanding. Tasks are so easy a caveman could do it. Can play whatever music we want which helps break up the monotony.", "Cons": "The store I was at was quite often understaffed during obvious times it shouldn't be, like dinner hour. The shift manager has repeatedly either abused or forgotten proper employee availability. Received zero training when I started and had to learn on my feet."}, "7": {"Date": " Apr 24, 2017", "Summary": "\"Good pay, unfair working conditions\"", "Pros": "Pay was decent, everyone was generally friendly", "Cons": "conditions sometimes put my health in danger, for example had to clean grills every day, the only equipment given to me were an apron and glove, the glove was very much worn down and didn't have proper protection. I still have scars today.The amount of work they require you to do is ridiculous as well as a poor management who often yelled at people.This particular McDonald's the customers were very picky with orders and during rush hour lots of mistakes are made. Management yells at you and you often can't work fast enough to ensure quality. They need more hands back there during those peak hours."}, "8": {"Date": " Apr 24, 2017", "Summary": "\"Not too bad, but not rewarding either...\"", "Pros": "- Eat free- When having good relations with crew members the job becomes relaxing.- Very stable job when you do what your asked to do.", "Cons": "- Being responsible for any negative actions taken by any crew member.- Having to deal to any complains made by customers."}, "9": {"Date": " Apr 25, 2017", "Summary": "\"Review\"", "Pros": "50% off food for employes", "Cons": "Managers won't negotiate your schedule"}}