{"0": {"Date": " Jun 6, 2017", "Summary": "\"McDonald's is a great place to work upper management\"", "Pros": "I got to oversee sales", "Cons": "Employees were occasionally disrespectful to staff"}, "1": {"Date": " Jun 7, 2017", "Summary": "\"Great for building leadership skills and your resume, but not much else.\"", "Pros": "+ hire from within mentality when it comes to promoting+ great way for young people to get team and leadership skills+decent benefits, McDonalds will treat you well if you stay for a LONG time ( these people are callled \"lifers\")", "Cons": "-as a manager you're typically working with teenagers and sometimes adults who do not want to work there. It is tough to remain positive- if your management is bad, you will struggle more in all aspects of the job- to get ahead you must devote time, typically much more than 40 hrs a week to your job"}, "2": {"Date": " May 22, 2017", "Summary": "\"McGreat\"", "Pros": "Great company to work for", "Cons": "Nothing is wrong with this company"}, "3": {"Date": " May 22, 2017", "Summary": "\"cashier\"", "Pros": "free food sometimes and also flexible hours", "Cons": "was not getting paid much"}, "4": {"Date": " Jun 6, 2017", "Summary": "\"Good Entry Job but Opportunities & Incentives Limited\"", "Pros": "-Free Meal-Decent Hours-Tuition Aid (havent tried)-Good entry job", "Cons": "-No Overtime-No Overnight Pay Raise-No Break if Short Staffed (going on break on overnights with only 2 coworkers is unrealistic)-Little to no incentive to work hard unless you plan on becoming a manager"}, "5": {"Date": " Jun 28, 2017", "Summary": "\"Flipper\"", "Pros": "Great flipping tools to use. Comfortable handles and contours", "Cons": "Standing all day in a greasy environment. Need to shower a lot."}, "6": {"Date": " Jun 6, 2017", "Summary": "\"Good first job, but don't expect to get paid much, even as a good worker\"", "Pros": "Flexible with your availability, get as many hours as you want, no other pros but need to reach word limit", "Cons": "Understaffed, stressful, frequently disrespected by customers and other employees, low pay, very hot working in a kitchen, expected to do your best even without getting paid a decent wage"}, "7": {"Date": " May 22, 2017", "Summary": "\"working the grill at McD's\"", "Pros": "flexible hours. sometimes it was not that busy. co-workers were pleasant. Sometimes there were food benefits. Overall it was a good experience when I was poor and needed money.", "Cons": "Typically it was very busy, Fast paced environment. I was constantly cleaning. Occasionally I had to work late on weekends which interfered with my social life."}, "8": {"Date": " May 22, 2017", "Summary": "\"Mc Donalds\"", "Pros": "nice staff and good people", "Cons": "People dont listen to you when you ask a question"}, "9": {"Date": " May 23, 2017", "Summary": "\"Cashier\"", "Pros": "Very Friendly environment. Staff was helpful is I were to need assistance. Flexible hours. Competitive pay. Would recommend to anyone.", "Cons": "No real cons. I enjoyed my experience."}}