{"0": {"Date": " May 27, 2016", "Summary": "\"Crew Leader\"", "Pros": "Honestly, McDonald's is one of the richest fast food restaurants in the U.S. This job taught me a lot, like patience, great customer service skills effort and consistency.", "Cons": "They seem to be disorganized. Don't have direct deposit and always complaining about how they don't have enough money to do anything."}, "1": {"Date": " May 11, 2016", "Summary": "\"Wonderful Employer\"", "Pros": "Always willing to work with you on your hours/ very flexable. Comfortable work environment and resonable work for job description.", "Cons": "Only pays $10 for a job that should be paid a minimum of $20. Does not have updated advertising so I had to create and devlope an advertising plan. I work as a secretary, office manager, and advertising representative and am paid $10 an hour before taxes."}, "2": {"Date": " May 12, 2016", "Summary": "\"Fun place to work\"", "Pros": "Good starting job and I felt appreciated by my managers. The schedule can move around a bit when people don't show up.", "Cons": "Not much of a career opportunity. Management seems to be overworked."}, "3": {"Date": " Jun 16, 2016", "Summary": "\"ok job\"", "Pros": "free fries and nice people", "Cons": "low pay and long hours"}, "4": {"Date": " Jun 16, 2016", "Summary": "\"Cook\"", "Pros": "It's okay. Good food discount", "Cons": "Pay. They coul pay more"}, "5": {"Date": " May 26, 2016", "Summary": "\"Fry cook\"", "Pros": "You get to be a fry cook", "Cons": "nothing really just gets busy"}, "6": {"Date": " May 26, 2016", "Summary": "\"Schedule Flexibility\"", "Pros": "Not really any pros unless you like eating Mcdonalds all day", "Cons": "No shift flexibility, low pay, leave smelling disgusting and greasy."}, "7": {"Date": " May 27, 2016", "Summary": "\"Dept Head Manager\"", "Pros": "You get to meet new people", "Cons": "The owners dont give out raises"}, "8": {"Date": " May 11, 2016", "Summary": "\"Manager\"", "Pros": "Flexible Schedule, decent pay, fun working environment. Good Experience", "Cons": "Working with idiots and customers who think you were born stupid."}, "9": {"Date": " May 11, 2016", "Summary": "\"Mcdonalds Cashier\"", "Pros": "I learn how to move fast and you get used to standing on your feet all day. You can and will promote and get a raise quickly.", "Cons": "The pay starts at minimum wage."}}