{"0": {"Date": " Jul 12, 2016", "Summary": "\"Ridiculous\"", "Pros": "Amazing pay and flexible hours", "Cons": "No breaks, very fast paced"}, "1": {"Date": " Jul 12, 2016", "Summary": "\"review\"", "Pros": "It wuz a pretty fun expierence, ya know. I got a job and it wuz good. Got to work the register. pretty complicated, but not if you're smart.", "Cons": "Hate mcdonalds. Everybody there always had a bad attitude and were good for nuthing. the food is all processed and will make you fat as a whale."}, "2": {"Date": " Jul 13, 2016", "Summary": "\"Cashier\"", "Pros": "Lots of hours for employees but hard to get regular schedule.", "Cons": "For this to be a major cooperation, they do not train their management on how to perform or interact with their employees. Very disorganized, poor practices or standards."}, "3": {"Date": " Jul 13, 2016", "Summary": "\"Desperate Times Call for Desperate Measures\"", "Pros": "Got a Job quickly, Got a discount on food, Gained responsibilities quickly, got to meet some cool young people like myself", "Cons": "The inability to pick my own hours, having to eat their food every shift = gained weight, managers seemed to have a power trip, sometimes customers were disrespectful"}, "4": {"Date": " Jun 27, 2016", "Summary": "\"so good\"", "Pros": "Great company, benefits, pay, food, smell , time", "Cons": "breaks, managment, egh, no, please no"}, "5": {"Date": " Jun 27, 2016", "Summary": "\"Assistant General Manager\"", "Pros": "Resume building skills and opportunities for advancement.", "Cons": "All the work of the General Manager without the pay or recognition."}, "6": {"Date": " Jun 27, 2016", "Summary": "\"ok\"", "Pros": "Great start,good work environment learn lots of new things .", "Cons": "Dont stuck ther for a life , there are also so many things to do than Mcdonalds."}, "7": {"Date": " Jul 11, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Full Time or Part Time / open availability", "Cons": "Depends on if franchise or corporate. I had health insurance through corporate and only paid 20 a week and that was dental and health and now that I am working for a franchise owner they offered me health insurance but double price."}, "8": {"Date": " Jul 11, 2016", "Summary": "\"Crew Trainer\"", "Pros": "The employees were a blast to work with. There was never a dull moment with them.", "Cons": "Can be very stressful at times. Staffing was hectic at times."}, "9": {"Date": " Jul 11, 2016", "Summary": "\"Horrible place to work\"", "Pros": "Customer interaction , convenient , easy responsibilities .", "Cons": "Minimum wage , horrible management."}}