{"0": {"Date": " Sep 19, 2016", "Summary": "\"McDonalds\"", "Pros": "Fun, fast-pace environment (if you work at a well-run McDonalds). Half hour lunch break with large discounts on all menu items.", "Cons": "Sometimes a hectic environment. Often are forced to deal with angry customers. Long 8/9 hour shifts. Constantly on your feet with only one break."}, "1": {"Date": " Sep 23, 2016", "Summary": "\"Has Potential\"", "Pros": "The best reason to work at Mcdonalds was all the food that we were able to steal because of how much food they just threw away anyway like honestly they were just so wasteful with their supply it was awful", "Cons": "The worst part of working at McDonald's was the salary. To this day I don't understand how people can live off of minimum wage like honestly it's kind of sad"}, "2": {"Date": " Sep 24, 2016", "Summary": "\"Good Food for the price\"", "Pros": "good food for the price", "Cons": "Don't speak MEXICAN and Spanish"}, "3": {"Date": " Sep 24, 2016", "Summary": "\"Manager\"", "Pros": "They have a fair pay poliicyFree food is a defninite proschedule flevixbility is a key offering that helped me a lot", "Cons": "you smell for a while after your shiftnot much job growth potential is therethey do not take employee feedback very well"}, "4": {"Date": " Oct 7, 2016", "Summary": "\"Good first job for the short term\"", "Pros": "My specific location worked well with schedules. Most people you work with are friendly as well.", "Cons": "The managers do not always think about what's good for the employees, especially when it comes to when breaks are given out. It is not fair to the employee to constantly be given their lunch break 2.5 hours into their 8 hour shift.Raises are few and far between, which is rough on the people who are trying to live off of their job.Good employees get overlooked a lot for promotions to manager."}, "5": {"Date": " Oct 28, 2016", "Summary": "\"Review\"", "Pros": "They had really salty fries.", "Cons": "The pay was not that great."}, "6": {"Date": " Sep 22, 2016", "Summary": "\"Crew/prep person\"", "Pros": "My best reasons to work is for my family. The other reason is because of the friendly atmosphere.", "Cons": "Work 7 hours with no break."}, "7": {"Date": " Oct 6, 2016", "Summary": "\"Crew Member\"", "Pros": "I like to eat the free hamburges, milkshakes, and french fries. The pay is better than wendys. McDonalds is an american icon.", "Cons": "Sometimes eating the burgers can make you fat. But the pay is still better than wendys. Although, wendys has fresh never frozen beef paties."}, "8": {"Date": " Oct 6, 2016", "Summary": "\"The experience from a 20 something\"", "Pros": "they give you as many hours as you want, as long as they are the ones that no one wants. that worked for me because i was trying to get money as much as possible", "Cons": "i didnt get promoted like i think i should have, they would promote the 17 years old before me. i was 23."}, "9": {"Date": " Oct 6, 2016", "Summary": "\"Team member cashier\"", "Pros": "So would be able take care, of yoslef always on Time,", "Cons": "Other emoplye been Rude"}}