{"0": {"Date": " Jun 29, 2017", "Summary": "\"Eh\"", "Pros": "It wasnt the worst ever.", "Cons": "It wasnt the best ever."}, "1": {"Date": " Jun 14, 2017", "Summary": "\"Experience\"", "Pros": "The environment was pretty good", "Cons": "The works are pretty simple"}, "2": {"Date": " Jun 15, 2017", "Summary": "\"Top notch company to work for!\"", "Pros": "Dedicated staff of employees, many with significant company tenure.", "Cons": "Going through some changes right now, which results in some uncertainty"}, "3": {"Date": " Jun 28, 2017", "Summary": "\"I dont recommend working there\"", "Pros": "They have Flexible work schedules", "Cons": "The bosses dont care about theyre employees"}, "4": {"Date": " Jun 28, 2017", "Summary": "\"Eh\"", "Pros": "Benefits are great. Free food. You create your work environment. The kids looks up to you. Pay is generous. Always room for advancement", "Cons": "If you're a manager, you're expected to put work before anything else in your life and that's just unrealistic. Long hours"}, "5": {"Date": " Jun 29, 2017", "Summary": "\"It taught me how to deal with different customers at a fast pace and how to count change backwards\"", "Pros": "The environment the pepole the love you got from the workers the way the daily customer's treated you felt like a family", "Cons": "Havin to close on some nights when other employees didn't come in , workin over extended shifts, pay day always changing"}, "6": {"Date": " Jun 13, 2017", "Summary": "\"McLovin It'\"", "Pros": "Great 1st job. Gained a lot of experience and confidence while working there.", "Cons": "They pay wasn't that great but for a 1st time job with no experience can't complain."}, "7": {"Date": " Jun 14, 2017", "Summary": "\"McDonalds is great\"", "Pros": "There is no reason not to eat at McDonalds. It is the best restaurant ever and it should be awarded 5 stars every time. These workers are only saying its bad because theyre jealous. The management is great and the kitchens are clean.", "Cons": "There are no cons to working at McDonalds."}, "8": {"Date": " Jul 20, 2017", "Summary": "\"Crew Trainer\"", "Pros": "It's easy except when there are rushes. You get comfortable there and know how to do your job very well. Management is really lenient. You also will make long term friendships . Crew members get to go to work and leave when they're scheduled off and not have to worry about staying after to count drawers and things of that nature.", "Cons": "Management isn't handled too well. if you're under 16 you make less than minimum wage as granted by state law. Most establishments don't do this. Store managers don't care and sit out in lobby or leave before their shift is over. Main managers leave all of their work to the regular managers."}, "9": {"Date": " Jun 28, 2017", "Summary": "\"The land of daily disappointment\"", "Pros": "The job could be enjoyable, fun even, but the profusely negative qualities that are exuded and the general rotten attitudes that are completely acceptable there, brings the minor level of brief enjoyment of serving customers to a complete halt.", "Cons": "The entire aura within the store is pure hatred. Management is always 100% suspicious and thinks every employee is always lying, favoritism is rampant, you get treated no better if you show up to every single shift, work hard, go above and beyond, treat every customer with respect, work as quickly as humanly possible, try not to make any mistakes at all (not realistically possible), and keep to yourself, as any employee that just goofs off all day and you can't trust to even be there for their scheduled shift. If you enjoy pointing out any miniscule thing that someone else does \"wrong\" you will do great there."}}