{"0": {"Date": " Mar 28, 2016", "Summary": "\"Mcdonalds\"", "Pros": "positive atmosphere fun place to work", "Cons": "low pay long weekend hours"}, "1": {"Date": " Mar 28, 2016", "Summary": "\"great job\"", "Pros": "friends, great ppl, great benefits!", "Cons": "multitasking, angry customers, shifts, thats all"}, "2": {"Date": " Mar 29, 2016", "Summary": "\"Cashier\"", "Pros": "Flexible hours, great bosses, great food discounts", "Cons": "Pay was low, could hardly pay my bills"}, "3": {"Date": " Apr 12, 2016", "Summary": "\"Cashier\"", "Pros": "Experience in the work field with co-workers and customers.", "Cons": "Hard working job that asks for too much for low minimum wage pay."}, "4": {"Date": " Apr 13, 2016", "Summary": "\"A job for teenagers...\"", "Pros": "Job is not difficult to get.", "Cons": "Very few breaks. repetitive work, not cohesiveness amongst management."}, "5": {"Date": " Mar 28, 2016", "Summary": "\"Crew Member\"", "Pros": "24 hour service, hours were good and worked with your personal schedule. Higher pay and easy environment to work in.", "Cons": "I personally never had a problem in my work force."}, "6": {"Date": " Apr 11, 2016", "Summary": "\"Marketing Manager\"", "Pros": "Well known respected global brand.", "Cons": "Room for advancement is limited. Not much movement from long term employees."}, "7": {"Date": " Apr 11, 2016", "Summary": "\"Assistant manager\"", "Pros": "Love the employees and most customers. People are wonderful and friendly and they have really good ice cream. Employees get meals half off, managers get free meals.", "Cons": "Managers can be difficult to work with, stressful when buses come and understaffed, long hours not on a set schedule. Managers don't listen to requests off. Can be stuck on one shift for weeks on end."}, "8": {"Date": " Apr 12, 2016", "Summary": "\"Good People\"", "Pros": "The workers are for the most part hard workers, constantly meeting new personalities, supportive staff, respect from upper mgmt", "Cons": "The hardest part was unhappy customers, which you deal with more than happy customers, mgmt is very supportive and they try to improve."}, "9": {"Date": " Mar 27, 2016", "Summary": "\"Cashier\"", "Pros": "Fries were always tasty and free for employees. but i wansnt sure exactly what they wanted from us other than serving food to customers every day all day. the best customers are the old people that just want coffee nothing else.", "Cons": "Hot working conditions make for sweaty peoeple. Bad enough you smell like warm grase"}}