{"0": {"Date": " Jan 11, 2018", "Summary": "\"Mediocre\"", "Pros": "Flexible work hoursWill hire literally anyoneTraining is about two days", "Cons": "Customers treat you terriblySweltering, loud, dirty environmentConstantly understaffed so you have to do the job of multiple people"}, "1": {"Date": " Dec 22, 2017", "Summary": "\"Good as a high school/college job\"", "Pros": "Benefitsflexible scheduleStarting wage not bad for what it is", "Cons": "Small pay raisesCustomersManagementPoorly equipped"}, "2": {"Date": " Dec 6, 2017", "Summary": "\"Surprisingly warm corporate culture and philosophy\"", "Pros": "- Access to free meals- Working for one of the most famous companies in the world- Know that your work has the potential to reach millions of people", "Cons": "- Contributing to obesity epidemic- Friends and family may look down on you"}, "3": {"Date": " Dec 6, 2017", "Summary": "\"The Job\"", "Pros": "You meet new people all the time", "Cons": "The managers don’t schedule people correctly"}, "4": {"Date": " Dec 20, 2017", "Summary": "\"Good place\"", "Pros": "Fun place to work with friends", "Cons": "The hours were not the best"}, "5": {"Date": " Dec 5, 2017", "Summary": "\"First job\"", "Pros": "Easy, understanding, flexible with the schedule", "Cons": "Low pay, some customers, hard on raises"}, "6": {"Date": " Dec 5, 2017", "Summary": "\"Cashier\"", "Pros": "It was pretty nice Not the best pay but besides that the boss was really nice.", "Cons": "I hated cleaning there. It was constant work and I hated it. Unlike other places, I had to always be on my feet and I hated my life there"}, "7": {"Date": " Dec 5, 2017", "Summary": "\"Customer Service crew\"", "Pros": "Great experience for a first time job seeker", "Cons": "A lot of work for little money"}, "8": {"Date": " Dec 5, 2017", "Summary": "\"Cashier\"", "Pros": "I found the experience working at McDonald's enjoyable because the atmosphere is always welcoming and upbeat. I also learned helpful life skills such as money management and customer service.", "Cons": "The Mcdonald's I am currently employed in is a smaller revenue then usual McDonald's store. This makes movement among workers very cramped and rushed."}, "9": {"Date": " Dec 5, 2017", "Summary": "\"Review\"", "Pros": "OK first job. If you can find better then do it", "Cons": "Management is a pain sometimes. They don't help you."}}