{"0": {"Date": " Mar 21, 2017", "Summary": "\"Good part-time job\"", "Pros": "I liked the people I worked with", "Cons": "Not much opportunity for advancement"}, "1": {"Date": " Mar 21, 2017", "Summary": "\"Meet a lot of cool people\"", "Pros": "It is a well rewarding job when you've been there for a long time. You have Sundays off and a company cell phone.", "Cons": "Deal with people who look down to Service employees. Some time long hours without getting paid overtime. On your feet all day"}, "2": {"Date": " Mar 6, 2017", "Summary": "\"easy money\"", "Pros": "great hours, good pay, eat free", "Cons": "rude customers and cleaning up behind customers"}, "3": {"Date": " Mar 6, 2017", "Summary": "\"Crew Worker\"", "Pros": "-Free food-Relatively stress-free during less busy hours-Flexible hours-Cool co-worker during some shifts-Never gets too boring", "Cons": "-Breakfast and lunch rush-Not much training-Too many managers-Smell never leaves your clothes-Angry customers"}, "4": {"Date": " Mar 6, 2017", "Summary": "\"Why I love guest Services.\"", "Pros": "Great customers, super team and sharp support managers.", "Cons": "Keeping teens of there phones."}, "5": {"Date": " Apr 11, 2017", "Summary": "\"Grill Cook\"", "Pros": "Flexible Schedules and easy training.", "Cons": "Poor work place ethics and relationships."}, "6": {"Date": " Apr 11, 2017", "Summary": "\"Awful\"", "Pros": "There are no good reasons to work at McDonald's. The work is not good, the management is bad, and the pay is terrible.", "Cons": "EverythingBad managementbad payworked too hardAsked to do tasks that aren't allowed to be done by under 18 year olds"}, "7": {"Date": " Apr 12, 2017", "Summary": "\"Horrible Job\"", "Pros": "Meet new peopleGood part time job if you're in high school or college", "Cons": "Managers at my store were very rudeHours get cut frequentlyHorrible Pay, when I started as a crew member I was getting paid $7.25 an hour, soon I became a crew trainer an was getting paid ONLY $7.55 an hour. Employees hired after me were getting paid $8.25 and my position was above them. All the rude customers you'll have to deal with and the stressful evenings and nights it's not worth it at all."}, "8": {"Date": " Mar 21, 2017", "Summary": "\"Team Member\"", "Pros": "Good PayFlexible ScheduleGreat Co-Workers", "Cons": "Rude ManagersShort BreaksFast-PacedThe crew room js extremely small"}, "9": {"Date": " Mar 3, 2017", "Summary": "\"Job Review\"", "Pros": "Easy learning environment and friendly management", "Cons": "It was a fast pace environment so it could be overwhelming at times."}}