{"0": {"Date": " Jul 10, 2017", "Summary": "\"Horrible\"", "Pros": "Free food and free coffee.", "Cons": "Extreme disregard for employees."}, "1": {"Date": " Jul 10, 2017", "Summary": "\"Crappy place\"", "Pros": "You get close to full time hours if you want it", "Cons": "A lot of work for minimum wage"}, "2": {"Date": " Jun 19, 2017", "Summary": "\"First job bad pay bad hours\"", "Pros": "Barely a pro you get 25 percent your purchase on the clock some give you the days you request off .", "Cons": "People take advantage of you they give you bad hours and low pay what I made in 2 weeks I make in one now ."}, "3": {"Date": " Jun 19, 2017", "Summary": "\"Assistant Manager\"", "Pros": "Great Corporation to work for, but the reviews are tough to get good scores based off nearly unrealistic expectations", "Cons": "Unrealistic expectations for the times. Tough to maintain labor levels unless salaried manager"}, "4": {"Date": " Jun 4, 2017", "Summary": "\"Shift Manager\"", "Pros": "Good coworkers, flexible hours, free break meals, training/advancement opportunities, can work with friends.", "Cons": "Stress, can be found with little time and too much to do, can be short staffed fairly often."}, "5": {"Date": " Jun 4, 2017", "Summary": "\"Life and work at mcdonalds\"", "Pros": "Bonuses, Flex Schedule, advancement, overtime", "Cons": "Short breaks, favoritism, unorganized"}, "6": {"Date": " Jun 5, 2017", "Summary": "\"McDonald's\"", "Pros": "benefits, decent pay for a college student, flexible work schedules, friendly staff and management", "Cons": "can easily get backed up during rushes, customers can become irritated very quickly, customers are not always knowledgeable of the menu- which can cause a back up very quickly"}, "7": {"Date": " Jun 18, 2017", "Summary": "\"shift manager\"", "Pros": "not that bad once u get used to it", "Cons": "alot of crap to deal with"}, "8": {"Date": " Jul 9, 2017", "Summary": "\"Terrible\"", "Pros": "Crew positions are easy.Hours are good.Free uniforms and meals.Easy, entry level position.Minimum wage.No degree required.", "Cons": "I worked here for about two years. I was quickly promoted to manager. This was the most unorganized restaurant I've seen. The general manager would find any reason to have you at fault. Once, while I was in the back room cashing out, she implied that she would hit one of the minors if they were of age. My personal life was prodded into. I was allowed only four days off while I was getting married, and even though the gm knew I didn't t drive and could work certain hours, I was scheduled against them. I was always expected to work longer than scheduled and come in on days off. We weren't able to send people home, even when they're sick. So many rules were broken."}, "9": {"Date": " Jun 17, 2017", "Summary": "\"Work is done throughout most of the building, however, when busy, you stay in the kitchen to either cook or assemble.\"", "Pros": "They are always hiring people and have an extremely flexible scheduling process. It is easy to find someone to cover a shift if needed.", "Cons": "A layer of grease accumulates over your body by the end of an eight hour shift. It is very easy to get oil burns, especially when unexperienced."}}