{"0": {"Date": " Oct 12, 2016", "Summary": "\"A job that will never have me coming back but has taught me a lot\"", "Pros": "Learn basic communication skills, basics of food handling (frying, laying meat, preparing foods), and team work skills. They train you on your first day of course and get cross-trained. This would benefit especially for teenagers who have no prior work experience. Depending on general manager, hours can be very flexible and they can work around your availability. If you need anytime off you would just put a note in 2 weeks in advance.", "Cons": "Fast-paced, do more work than you can handle. The grill is practically the hardest position and the hottest all day. Literally work the whole day their and get so hot I came home with my nose bleeding. Almost every shift I come home greasy and they don't even give me an apron. They want you to follow their procedures of cooking food (e.g. 6 McChickens at a time) but at the same time to be fast. Yeah, I cannot even keep up with filling up the cabinets with food if they expect me to cook the minimum amount. The grill is so hot sometimes I feel drained trying to keep up with the grill and fried products. Then an hour prior to my shift, they expect me to clean both grills, empty the vats. This one hour of cleaning is absolutely the most dreadful thing about being a grill cook. They don't make over night workers do it, but 1st shift do it. How do they have 1st shift cleaning the grill when the busiest time is during noon with cars literally lined up all the way out to the entrance and at night time not a single car between the slowest hours. By the way, over night workers get paid more than day time so there is a big discrepancy the work they do and the pay.With the introduction of all-day breakfast, they expect us grill cookers to cook everything from eggs, to sausage. Especially when they put only one person on the grill it starts to get hectic. You get the line people yelling at you that they are holding on food but that's because there is so many more food to cook than before when it use to be just lunch after 11 a.m. It has put more strain on workload and its not my fault they are going to hold because I have breakfast food products on the grill. This is the reason why times are slow and the quality is at an all time low. Its cheap for a reason so I understand."}, "1": {"Date": " Sep 21, 2016", "Summary": "\"Swing Manager\"", "Pros": "Guaranteed hours, decent pay, tuition assistance", "Cons": "lack of training, lack of room to grow within franchise, not even a minute of OT allowed, doing more than your own job without getting the pay, too much change"}, "2": {"Date": " Sep 21, 2016", "Summary": "\"Work for corporate\"", "Pros": "The best thing about the shop was hours and room to grow also the location in regards to my home", "Cons": "The reason I left this job because this location was run by an owner who did not give raises. Hours were there but they were not iconsistent and once you reach a certain amount of growth in the company that was it you couldn't make more than the assistant manager and the assistant manager wasn't getting any more money. There was a lot of work and no grounds for more we're always short-staffed and extremely busy"}, "3": {"Date": " Sep 21, 2016", "Summary": "\"Crew mmeber\"", "Pros": "Discount on foodThey can help you get your diplomaOffer scholarships", "Cons": "Very rude customersI was personally treated unfairManagement was very messed up"}, "4": {"Date": " Sep 22, 2016", "Summary": "\"Okay for the short term\"", "Pros": "All the free coffee was great. The flexible scheduling was helpful as well.", "Cons": "Not much future in this job for a company so huge."}, "5": {"Date": " Sep 6, 2016", "Summary": "\"job review\"", "Pros": "Great experience for student", "Cons": "Opportunities for advancement in the area"}, "6": {"Date": " Sep 7, 2016", "Summary": "\"Good company for first job\"", "Pros": "Fun, east job with decent pay given the nature of it.", "Cons": "Management is sometimes not great, and coworkers can be non-diligent (especially young teens)."}, "7": {"Date": " Sep 7, 2016", "Summary": "\"Wonderful, it is a great experience for a first job\"", "Pros": "Many social skills are learned, how to deal with people of al walks of life even if they are aggravating. A lot of time is spent cleaning and managing the restaurant to make sure it runs smoothly.", "Cons": "It's hard work, a lot of hours spent of your feet, and depending on what you're r shift manager wants you to do, it may leave you exhausted."}, "8": {"Date": " Sep 20, 2016", "Summary": "\"Decent place to begin\"", "Pros": "Got promoted within a year, good coworkers / manager, a decent starting job for high school or college student, discount on food", "Cons": "It's a basic customer service job - you have to deal with unappreciative people all day long, you don't get compensated very well, forced to work holidays"}, "9": {"Date": " Sep 20, 2016", "Summary": "\"Crew Member\"", "Pros": "Flexible Hours. Decent part-time job.", "Cons": "Part-time job, not much potential for growth."}}