{"0": {"Date": " Mar 23, 2016", "Summary": "\"Its ok\"", "Pros": "Lots of great people to meet and responsibility to help for future success. Plus discounts on food bought from mcdonalds", "Cons": "Hot in the kitchen. Multi tasking is very difficult i sometimes feel like a slave. Plus i sometimes burn myself on the machines"}, "1": {"Date": " Mar 23, 2016", "Summary": "\"mcdonalds review\"", "Pros": "Mcdonalds gives you an opportunity to become more social and interactive with people. Also teaches you how to become a team player.", "Cons": "Mcdonalds can be really hectic during rush hours. Causing one with not much experience to maybe panic and lose focus. Also they dont pay much as they should"}, "2": {"Date": " Mar 23, 2016", "Summary": "\"Cashier\"", "Pros": "You will gain good customer service skills!!!", "Cons": "The customers will really try your patience!!!!"}, "3": {"Date": " Mar 23, 2016", "Summary": "\"assistant\"", "Pros": "good place to work for", "Cons": "hours not flexible as needed"}, "4": {"Date": " Mar 23, 2016", "Summary": "\"Area Real Estate Manager\"", "Pros": "Great training and development, the people are genuine and room for growth.", "Cons": "The workloads and daily demands can be stressful and make it hard to find a balance between work life and personal life."}, "5": {"Date": " Mar 24, 2016", "Summary": "\"Mcdonald\"", "Pros": "Quilfiy for bonus every monthWorks with school schedule", "Cons": "New staff every week and their benefits suck"}, "6": {"Date": " Apr 13, 2016", "Summary": "\"cashier\"", "Pros": "great job to start its alright", "Cons": "you smell really bad after"}, "7": {"Date": " Mar 23, 2016", "Summary": "\"horribly treated! !!\"", "Pros": "Your making easy money!", "Cons": "The managers don't treat employees very good good all!!!"}, "8": {"Date": " Mar 8, 2016", "Summary": "\"Great Company\"", "Pros": "good company trying to do the right thing for its consumers and adjusting well to the current customer needs displayed by our society", "Cons": "has a bad rap which it is working effortlessly to rewrite. might be somewhat deserving, but like most of its competitors, it was giving the people what they wanted"}, "9": {"Date": " Mar 8, 2016", "Summary": "\"Review\"", "Pros": "Fast way to earn extra cash. Room for growth. Fun and easy", "Cons": "Can be challenging. Work long hours. Pay isn't that great."}}