{"0": {"Date": " Mar 30, 2017", "Summary": "\"Worthless dead end\"", "Pros": "None there are none don't do it.", "Cons": "Long hours,high stress, racism,favoritism,sexual harrasment, most of the employees are on drugs while cooking your food they don't drug test at random like they say they do. No hope for advancement in the company unless your friends with the manager of the store and they give you a promotion but if your not doesn't matter how hard you work you will never get it I know tried for 5 years got passed over every time for whoever the manager was sleeping with or getting drugs from"}, "1": {"Date": " Mar 8, 2017", "Summary": "\"Team culture can be great\"", "Pros": "The team I worked on my last 2 years was great. Flexible, supportive, creative.", "Cons": "The entire organization is quite the opposite. Culture needs to shift and I'm sure it will, but not anytime soon."}, "2": {"Date": " Feb 21, 2017", "Summary": "\"Cashier\"", "Pros": "Free food, FUN coworkers, envoronment", "Cons": "Free food, long hours, uniform"}, "3": {"Date": " Mar 8, 2017", "Summary": "\"Okay\"", "Pros": "This job is a fun environment for students or want to gain work experience. They also allow a flexiable working schedule if your are currently in school or have multiple jobs", "Cons": "Environment is sometimes fast paced and a little unorganized based on the neighborhood that you choose to work"}, "4": {"Date": " Mar 8, 2017", "Summary": "\"Wasn't the best job for me but there was good opportunity to become a part of management.\"", "Pros": "Flexible hours and good coworkers (for the most part). I really liked that I got one free meal a day and my managers were very nice.", "Cons": "Too high paced for me and not the best pay. During rush hours sometimes I would get overwhelmed especially when I worked with lazy coworkers."}, "5": {"Date": " Feb 20, 2017", "Summary": "\"Worth Considering\"", "Pros": "Career growth opportunities in a team based, fast pace environment", "Cons": "Possibility of equipment going haywire"}, "6": {"Date": " Feb 21, 2017", "Summary": "\"Entry level job\"", "Pros": "This is a good job for high school students wanting some sort of income. Improves personal skills by interacting with customers", "Cons": "You must cater to customers, definitely need people skills for this job. Must be able to use a cash register"}, "7": {"Date": " Mar 28, 2017", "Summary": "\"Manager\"", "Pros": "Somewhat flexible schedule but not really.", "Cons": "Pay was terrible. They treat their employees horribly."}, "8": {"Date": " Mar 7, 2017", "Summary": "\"Dissatisfied with work conditions, satisfied with hours and flexibility.\"", "Pros": "The best reason to work at McDonalds is that they are very flexible with schedules, the work is very engaging and fast paced, and you get a free meal on every break.", "Cons": "Some of the cons of working at McDonalds is that the grill is painful because there is a LOT of grease and it pops up and leaves lasting marks on arms. I worked grill for two weeks and it looks like I have a skin condition and people give me looks but it's just heat rash and some actual wounds from being burnt so bad."}, "9": {"Date": " Feb 20, 2017", "Summary": "\"McDonalds Review\"", "Pros": "They provide plentiful hours of work", "Cons": "Shifts change too much."}}