{"0": {"Date": " Oct 29, 2016", "Summary": "\"Fair\"", "Pros": "Flexible scheduling, various shifts ranging from mornings to closing, youre around food so you always have a chance to eat something on a break or at least pick if you cant sit down", "Cons": "Lack of performance reviews, no health insurance, lack of adequete staffing makea for longer and more stressful days"}, "1": {"Date": " Oct 27, 2016", "Summary": "\"Shift Manager\"", "Pros": "McDonald's is a good company to work for.Employee Discount.Works around your schedule", "Cons": "Managers have to work most holidays"}, "2": {"Date": " Nov 11, 2016", "Summary": "\"McDonalds Shift Manager- Your experience may be different\"", "Pros": "-Flexible schedule-Free food-Fast paced-Great place to learn key skills", "Cons": "-often short staffed-rude customers-rude managers-incompetent managers-procedures rarely followed"}, "3": {"Date": " Oct 27, 2016", "Summary": "\"Ok\"", "Pros": "Easy. In propositional logic so, modus ponendo ponens (Latin for \"the way that affirms by affirming\"; generally abbreviated to MP or mods ponens) or implication elimination is a valid, simple argument form and rule of inference. It so can be summarized as \"P implies Q; P is asserted to be true, so therefore Q must be true.", "Cons": "Pay. In propositional logic, modus ponendo ponens (Latin for \"the way that affirms by affirming\"; generally abbreviated to MP or modus ponens) or by implication eliminatin is a valid, simple argument form and rule of inference. It thus can be summarized as \"P implies Q; P is asserted to be true, so therefore Q must be true."}, "4": {"Date": " Oct 27, 2016", "Summary": "\"Crew member\"", "Pros": "U'll learn so many things", "Cons": "Not yet decided you will not get enough money"}, "5": {"Date": " Nov 10, 2016", "Summary": "\"Cook\"", "Pros": "It was good. the manager mde my life much easier. would work again at this job. i like to make food so it wasn't that bad.", "Cons": "could use more hours. the job was boring at time. i didnt always like my coworkers, but im not sure if that is really anyones fault"}, "6": {"Date": " Nov 10, 2016", "Summary": "\"It's Fast Food\"", "Pros": "Hours are flexible and can be abundant. Free food as well as discounts are also nice.", "Cons": "Stores without air conditioning makes working the grill area awful. A lot of fast paced busy work and dealing with uncooperative customers are to be expected for fast food."}, "7": {"Date": " Oct 26, 2016", "Summary": "\"Senior Director Marketing\"", "Pros": "Great brand, great resources, great people (in corporation and owner/operators)", "Cons": "In the past, marketing leadership sometimes more tactical than strategic"}, "8": {"Date": " Oct 26, 2016", "Summary": "\"Great Job\"", "Pros": "Flexible hours and Terrific Management at the branch I worked at.", "Cons": "Not enough shifts to go around. Too many workers at times."}, "9": {"Date": " Oct 26, 2016", "Summary": "\"It's aight\"", "Pros": "You only need to be smart enough breath to work here. Free food galore, just don't be stupid about it.", "Cons": "Everything. This Job is just awful. If this level of employment is all you are qualified to do I would recommend janitorial anywhere. The customers here will make you murderous."}}