{"0": {"Date": " Feb 10, 2016", "Summary": "\"Cashier\"", "Pros": "I would like to work here because, this would be my first job ever, and i love to cook, and i love to communicate with people very well, and i like cleaning up.", "Cons": "I wouldn't think that there are any bad things about McDonalds accept for the rude customers but i can work with that."}, "1": {"Date": " Mar 17, 2016", "Summary": "\"grill cook\"", "Pros": "free bigmac everyday if you wanted.", "Cons": "everything. terrible. just terrible. you can do nothing with an income like the one they gave there."}, "2": {"Date": " Feb 24, 2016", "Summary": "\"Its okay\"", "Pros": "Hours are greatFree FoodManagement is nice", "Cons": "Pay is horriblePeople are rude"}, "3": {"Date": " Feb 9, 2016", "Summary": "\"General Manager\"", "Pros": "Flexible work schedule and good compensation package.", "Cons": "Little time off on weekends during the summer."}, "4": {"Date": " Feb 23, 2016", "Summary": "\"It's an okay place to work\"", "Pros": "Good people to work with, hours are good in the warmer weather, nice customers,", "Cons": "When winter comes around the hours get cut drastically"}, "5": {"Date": " Feb 23, 2016", "Summary": "\"Crew Member\"", "Pros": "Easy tasks, nothing too demanding required of employees. Free crew meals each day worked were a plus but an underwhelming bonus.", "Cons": "Noisy, customers of all walks of life and intelligence would come through for food. Enforcement of rules was loose at best."}, "6": {"Date": " Feb 23, 2016", "Summary": "\"minimum wage\"", "Pros": "they give you flexible schedule.", "Cons": "no wage increase at all even tho how long you've been working, they give you short hours and always short in workers so its hard working there because you need to multitask"}, "7": {"Date": " Feb 24, 2016", "Summary": "\"kitchen crew\"", "Pros": "working with friendly co-workers, and ability to stay busy no matter what time it is", "Cons": "cleaning bathrooms after really messy patrons"}, "8": {"Date": " Feb 8, 2016", "Summary": "\"Golf\"", "Pros": "Easy job to do daily.", "Cons": "Woke up very early daily."}, "9": {"Date": " Feb 9, 2016", "Summary": "\"Great!\"", "Pros": "Discounted food, benefits are great too!", "Cons": "Smelly work environment, greasy, and sometimes difficult co-workers."}}