{"0": {"Date": " Mar 4, 2016", "Summary": "\"Worst experience ever!\"", "Pros": "Only pro about working here was that I got a free crew meal", "Cons": "The manager was very unprofessional , he would get mad at you and would cut your hours or wouldn't give you any at all, the restaurant it self was disgusting ! The employees were nasty , they would do things like drop a patty on the ground and put it back to be served to the customers. No one ever washed there hands . It was just truly a terrible experience for me and made me never want to eat from a fast food restaurant again!"}, "1": {"Date": " Feb 11, 2016", "Summary": "\"Okay to work at for a little while..\"", "Pros": "Made friends with a lot of coworkers, had enough hours, was able to get promoted to crew trainer.", "Cons": "Can be very stressful, understaffed at times, conditions weren't always the best, favoritism and personal problems between others were prevalent."}, "2": {"Date": " Feb 12, 2016", "Summary": "\"Worthless.\"", "Pros": "Flexible scheduling. Can help you to build mental fortitude.", "Cons": "Doesn't add any skill to help pave the way for you in the future."}, "3": {"Date": " Feb 12, 2016", "Summary": "\"McDonald's stock price over employees\"", "Pros": "Good 401K plan, you put in 5% they match with 7%", "Cons": "Employees not valued, Corporate Accounting being outsourced to a Company in India in 2016"}, "4": {"Date": " Feb 12, 2016", "Summary": "\"Crew member\"", "Pros": "Easy place to work at", "Cons": "Not enough hours/money to live on...Never work more then 30 hours a week...A lot of the workers use/sell drugs including management"}, "5": {"Date": " Jan 27, 2016", "Summary": "\"Getting better\"", "Pros": "Pays higher than minimum wage, great benefits after 1 year, easy, college tuition reimbursement, good chances of moving up", "Cons": "Rude customers, sometimes you don't get a break, can be stressful."}, "6": {"Date": " Jan 27, 2016", "Summary": "\"Cashier\"", "Pros": "Easy, free food, benefits none for part time", "Cons": "Packed always,rude customers for no reason"}, "7": {"Date": " Feb 11, 2016", "Summary": "\"General Manager\"", "Pros": "Fast paced. Work with many great people. Free meals! Lots of opportunities for advancement.", "Cons": "No personal life. Lots of hours. Always on call."}, "8": {"Date": " Feb 11, 2016", "Summary": "\"A job till you find a better job\"", "Pros": "Basic labor, you repeat the same actions over and over for an 8 hour shift.", "Cons": "Really repetitive, so much so that it ends up not just physically draining, but also mentally draining."}, "9": {"Date": " Feb 9, 2016", "Summary": "\"Shift Manager\"", "Pros": "Your schedule can be flexible.", "Cons": "negative environment, lack of respect, no room to grow, unprofessional"}}