{"0": {"Date": " Jun 2, 2017", "Summary": "\"hunt enterprise\"", "Pros": "family oriented, trips to amusement parks, picnics, flexible hours", "Cons": "stress, had to constantly kick out beggers"}, "1": {"Date": " Jun 15, 2017", "Summary": "\"Team Member\"", "Pros": "They gave me the best hours and the best schedules. They are very understanding when you need to take some time off for the things you need.", "Cons": "They take their stress out on you in the second window. They shout \"what is the hold up??\" over and over again, to try to make their business run faster and smoother. But them asking this every second doesnt help anything. It doesnt make it faster at all. They act like its your fault, even when its nobody's fault actually. They have a lot of stress and they like to take it out on you."}, "2": {"Date": " Jun 15, 2017", "Summary": "\"mcdonalds manager\"", "Pros": "Has helped me pay for half of each semester for college.flexible schedule.", "Cons": "long hours on feet like 9 hrs without a break.have to deal with nasty costumers.Just became manager about 2 months ago and still have not been taught everything I need to know yet and don't have a key to open the store yet.I am only making $10 an hour and there is only .15 cent raises every 6 months.A closer at my store that is crew is making $9.75 an hour.It is not worth the amount of work to pay ratio."}, "3": {"Date": " May 31, 2017", "Summary": "\"great place awesome place amazing\"", "Pros": "it,s a very nice place to work in", "Cons": "great will get many benefits"}, "4": {"Date": " Jun 1, 2017", "Summary": "\"Manager\"", "Pros": "Free food and drinks. Really close to home", "Cons": "Low pay and benefits are horrible. Plus the food is horrible."}, "5": {"Date": " Jun 14, 2017", "Summary": "\"Great Job for Students & Teens\"", "Pros": "Job Learning Experience & Flexible Schedule", "Cons": "Minimum Wage & Poor Staffing (Depending upon location)"}, "6": {"Date": " Jun 15, 2017", "Summary": "\"McD, Crew member\"", "Pros": "Schedule flexibility, good starter job", "Cons": "Sometimes people don't show up and you, and it's just you and a manager for a while"}, "7": {"Date": " Jun 15, 2017", "Summary": "\"Cashier\"", "Pros": "There aren't many pros unless you like to sit around and work with friends.", "Cons": "Drama and not good pay"}, "8": {"Date": " May 31, 2017", "Summary": "\"Great first job\"", "Pros": "-Great way to introduce yourself to customer service-Learn to interact with customers in a way that benefits the company and yourself", "Cons": "-Other than moving up to a management position within the store, there is not really room to move up within the company"}, "9": {"Date": " May 31, 2017", "Summary": "\"Good\"", "Pros": "Coworkers were amazing and we worked well together", "Cons": "There wasn't a lot except the commute"}}