{"0": {"Date": " Mar 15, 2016", "Summary": "\"It was cool\"", "Pros": "It's cool for a first job and all , you get to meet new people and helps with customer service. When busy time goes by fast", "Cons": "I don't have anything bad to say about it. It was a pretty cool place to work. I just don't like slow days"}, "1": {"Date": " Mar 29, 2016", "Summary": "\"Your Store Varies\"", "Pros": "Quick promotion at store levelHalf off foodOccasional overtimeFlexible schedulingHigh-paced environment", "Cons": "Benefits are more of a maze than a benefitManagement can varyHard to move up past shift managerCustomers/management/coworkers alike can be verbally abusiveHigh-paced environmentStressful environment"}, "2": {"Date": " Mar 29, 2016", "Summary": "\"McDonald's\"", "Pros": "You will have a bond with the customers especially the everyday customers.", "Cons": "Having to go home early because of high labor and the managers treating you like a child"}, "3": {"Date": " Mar 29, 2016", "Summary": "\"Terrible\"", "Pros": "Lots of friends work there", "Cons": "There is terrible working conditions"}, "4": {"Date": " Mar 29, 2016", "Summary": "\"Mcdonald employee benefits\"", "Pros": "They allow paid vacation sometimes", "Cons": "You have to work between positions sometimes like if they need people at the register go to the register same thing with the food station"}, "5": {"Date": " Mar 29, 2016", "Summary": "\"McD's Powder Springs, GA\"", "Pros": "Flexible schedule, free lunch or breakfast", "Cons": "Things always breaking down or not working"}, "6": {"Date": " Mar 29, 2016", "Summary": "\"Dead end job\"", "Pros": "French fries are some of the best. So tasty. Easy to get a job. No qualifications really needed.", "Cons": "Fast food environment. Don't make a lot of money. Have to deal with really nasty customers."}, "7": {"Date": " Mar 30, 2016", "Summary": "\"McDonalds\"", "Pros": "Great employee appreciation activities", "Cons": "Rude customers. Sometimes, management was too strict to be at McDonalds"}, "8": {"Date": " Mar 30, 2016", "Summary": "\"Crew\"", "Pros": "Free food, hours are ok", "Cons": "scheduling is terrible you have to ask for anything two weeks in advance"}, "9": {"Date": " Mar 30, 2016", "Summary": "\"Gm\"", "Pros": "Great company family environment. Corporate seems a little better then the owner operators as far as compensation and incentives. Over all a good company to start with carefully choose what o/o you choose to work for", "Cons": "Tries to do to many different things to be great at one thing."}}