{"0": {"Date": " Nov 6, 2017", "Summary": "\"Not the best first job\"", "Pros": "Schedules are flexible to fit your own lifestyle.", "Cons": "Management is very disorganized.Very late breaks, near the end of shift.Overwork you for just minimum wage."}, "1": {"Date": " Nov 5, 2017", "Summary": "\"Fun job but not so good co-workers.\"", "Pros": "The work is fun and your day goes by quickly.", "Cons": "The location I worked at had management and co-workers who are not kind. Lots of favoritism and then they pick on the good workers."}, "2": {"Date": " Nov 6, 2017", "Summary": "\"Cashier\"", "Pros": "Enjoyed serving the customers. Meeting new people.", "Cons": "Was a hostile work environment, co workers and managers were very rude and acted very immature towards me."}, "3": {"Date": " Oct 21, 2017", "Summary": "\"Good company\"", "Pros": "Great pay and benefits, get a sabbatical after 10 years.", "Cons": "Some leadership is more concern d with their own growth, and tend to forget about the people that helped them get to the top."}, "4": {"Date": " Oct 21, 2017", "Summary": "\"Crew Person\"", "Pros": "They teach you everything you need to know to do your job, so long as your crew trainers are decent.Working for a corporate location there are a lot of opportunities for advancement and a nice benefits package.", "Cons": "Fast paced, stressful, more emotionally demanding than physical. The constant beeping of machines will haunt you in your sleep for the first week or two.Management at my location wasn't great, new store manager under the wing of the GM didn't have the guts to step up and put coworkers in line when they violated policy, leading to issues in the workplace."}, "5": {"Date": " Oct 21, 2017", "Summary": "\"Review\"", "Pros": "flexible hours with my school schedule", "Cons": "I wouldn't necessarily say anything"}, "6": {"Date": " Nov 4, 2017", "Summary": "\"Mcdonald's\"", "Pros": "Free food, became friends with coworkers, first job", "Cons": "Dirty store, managers don't listen to you"}, "7": {"Date": " Nov 4, 2017", "Summary": "\"Assistant Manager\"", "Pros": "Good starting job and flexible hour", "Cons": "No long term prospect for my college degree"}, "8": {"Date": " Nov 4, 2017", "Summary": "\"Managers play favorites and if your not a favorite you get left with bad hours and you do everyone else’s job.\"", "Pros": "Flexible schedules and if you are in a click with a manager teen your experience there will be a good one", "Cons": "Managers play favorites and are rude to employees and put employees In charge during a lunch or dinner rush to play o their phone"}, "9": {"Date": " Nov 4, 2017", "Summary": "\"Great Starter\"", "Pros": "Great food benefits if working for corporate stores.", "Cons": "The pay and lack of raises."}}