{"0": {"Date": " Sep 26, 2016", "Summary": "\"General manager\"", "Pros": "The GM is able to run their restaurant as if it's their own. The GM projects sales, labor. The GM approves the crew schedules.", "Cons": "Most restaurants are 24 hours. The GM is not required to work the graveyard shift. They must be available to cover the shift when necessary"}, "1": {"Date": " Sep 26, 2016", "Summary": "\"good\"", "Pros": "overall good place to work", "Cons": "limited opportunities for future advancement"}, "2": {"Date": " Oct 10, 2016", "Summary": "\"Cashier\"", "Pros": "Easy to get job. Some great people. It is really a great place to work if you are a teaenager", "Cons": "Hard work environment. I also had long hours. The management is not the greatest. Feels like a grind"}, "3": {"Date": " Oct 10, 2016", "Summary": "\"Cashier\"", "Pros": "It's a good place to learn. Also you get a chance to get a job. They would hire anyone.", "Cons": "You won't be able to rank up."}, "4": {"Date": " Sep 24, 2016", "Summary": "\"mcdoanlds\"", "Pros": "You get a raise every six months. You start off making a dollar more than minimum wage.", "Cons": "You work long hours. You may have to work holidays."}, "5": {"Date": " Oct 9, 2016", "Summary": "\"Good to Horrible\"", "Pros": "Most of the crew is lively and fun", "Cons": "Manager conspire against each otherCustomers are constantly rude"}, "6": {"Date": " Sep 20, 2016", "Summary": "\"Cashier\"", "Pros": "Fun work environment, clean, friendly", "Cons": "busy, messy, crazy, dirty, busy"}, "7": {"Date": " Sep 24, 2016", "Summary": "\"My experience with the company...\"", "Pros": "You get to communicate with the public, and be the highlight of someones day. If you like working in a fast-paced environment, this is also the place to go. You'll be done with the day before you know it.", "Cons": "If working with customers, you will eventually get an upset one that you will not be able to help w/o management inclusion. Or, if you are management, you will meet an upset customer that may be difficult to satisfy. This is just a part of customer service, and being mentally prepared for it will help you a lot."}, "8": {"Date": " Sep 24, 2016", "Summary": "\"Crew Member\"", "Pros": "There is comment at this time", "Cons": "Flexible hours and friendly co-worker"}, "9": {"Date": " Sep 24, 2016", "Summary": "\"Manager\"", "Pros": "Great benefits and employees. Love the team", "Cons": "Pay could be a little better."}}