{"0": {"Date": " Sep 21, 2016", "Summary": "\"n/a\"", "Pros": "Management experience ,hard working, honest", "Cons": "N/a ,don't have any cons"}, "1": {"Date": " Sep 21, 2016", "Summary": "\"good\"", "Pros": "Very flexible with hours, no problems to report of, its a great starter company. Anyone in highschool or college should work at mcdonalds.", "Cons": "there are not any cons"}, "2": {"Date": " Oct 6, 2016", "Summary": "\"poor\"", "Pros": "You only get fifty percent off your meals", "Cons": "poor training, managers lying to higher ups, Unprofessional dress code, Employees bad mouthing one another, hypocrisy within management, Favoritism."}, "3": {"Date": " Sep 21, 2016", "Summary": "\"Fun and friendly place\"", "Pros": "Managers were always fun and easy to work withVery flexable schedulingEasy to get promoted", "Cons": "Employees tend to be back stabbersThey never give second chances"}, "4": {"Date": " Sep 21, 2016", "Summary": "\"cashier\"", "Pros": "Work good hours, nice people", "Cons": "Not enough money for a family to live on"}, "5": {"Date": " Sep 21, 2016", "Summary": "\"Workin herre\"", "Pros": "The pay the benefits learn how to move at a fast pace you get free lunch up to seven dollars", "Cons": "Idk its just how you handle the job rude customers slow coworkers machines always broke you gotta do everything such as cashier and janitors job"}, "6": {"Date": " Sep 21, 2016", "Summary": "\"Good first job\"", "Pros": "Nothing is too hard to do. You usually have enough staff to deal with the rushes of people. Different areas to learn if you get bored with one - drive thru, front counter, kitchen, presenter, lobby", "Cons": "Long hours with \"kids\" for co workers usually means you have to deal with your job and theirs.Get used to customers messing up their orders and then blaming it on you to try and get free food."}, "7": {"Date": " Sep 21, 2016", "Summary": "\"Nice place to work.\"", "Pros": "Flexible schedule, great co-workers, lots of hours available to choose from", "Cons": "none that I know of. I really liked my job"}, "8": {"Date": " Oct 5, 2016", "Summary": "\"Cashier\"", "Pros": "Good atmosphere. I applied during an open interview and interviewed on the spot. The process was simple, mainly questions about my personality. Decent first job", "Cons": "The hours were bad. As a new employee I didn't have much discretion."}, "9": {"Date": " Oct 5, 2016", "Summary": "\"Slight Prejudices\"", "Pros": "Having a job at McDonald's teaches a person how to deal with overbearing managers and miscommunication that you'll eventually experience in the future. Work was flexible with school and religious affiliations.", "Cons": "Managers seemed to refuse to speak english to some crew members and forced men to do any or all of the \"nasty jobs\" such as filtering the oil or taking out the trash.The management didn't give me my performance review at 6 months, as was expected, and told me after a year that \"they ran out of raises, since they gave them to the other cooks\"."}}