{"0": {"Date": " Jun 21, 2017", "Summary": "\"server\"", "Pros": "flexable hours and easy schedueling", "Cons": "pay could be a little better"}, "1": {"Date": " Jun 21, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Easy to get into, highers basically anyone, good pay, good hours", "Cons": "Stressful at times if not managed correctly, menial work"}, "2": {"Date": " Jun 6, 2017", "Summary": "\"Satisfied\"", "Pros": "Working with other people", "Cons": "I really can't think of any"}, "3": {"Date": " Jun 7, 2017", "Summary": "\"Mcondalds\"", "Pros": "Free food up to 6 bucks", "Cons": "Customers are always angry at you"}, "4": {"Date": " Jul 12, 2017", "Summary": "\"crew member\"", "Pros": "Good for high schoolers. stay in school kids", "Cons": "not great, you should want much more in life"}, "5": {"Date": " Jul 13, 2017", "Summary": "\"Ame\"", "Pros": "Good pay. Good benefits and good opportunities for new things.", "Cons": "Horrible people and no sense of knowledge at all. Had to be the dumbest people I worked with."}, "6": {"Date": " May 30, 2017", "Summary": "\"Crew Member\"", "Pros": "Great pay, fun people, easy to work, great pay for a high school student, flexible hours, easy to request off", "Cons": "Super busy, rude costumers, dishonest workers, people lie and say the ice cream is broken when they're too lazy, lazy workers"}, "7": {"Date": " Jun 21, 2017", "Summary": "\"It was okay for the most part\"", "Pros": "None really. Good for a high school kid that need money. Don't expect them to stay to long because of management.", "Cons": "Management, no room for advancement, it took me 2 years to get a .25 cents raise. High turnover rates. When I started didn't get o training had to learn everything myself."}, "8": {"Date": " Jun 22, 2017", "Summary": "\"Good\"", "Pros": "Good food great people that come inside the othe", "Cons": "Horrible service from bosses and people are rude slot of the times"}, "9": {"Date": " Jun 22, 2017", "Summary": "\"Service Worker\"", "Pros": "Nothing was good about this job", "Cons": "People were mean. Not a place to work for a college student"}}