{"0": {"Date": " Oct 5, 2017", "Summary": "\"hamburger flipper\"", "Pros": "free food is alway great", "Cons": "weight. does my bum look big in this?"}, "1": {"Date": " Oct 6, 2017", "Summary": "\"Student assistant\"", "Pros": "Easy to get maximum hours, the staff is friendly, and the managers care about you and that sometimes you're busy.", "Cons": "The location was such a drive or walk for me that I was spending hours a week walking to work; the pay isn't great either"}, "2": {"Date": " Nov 10, 2017", "Summary": "\"There's a reason that they aren't taken seriously...\"", "Pros": "The benefits were great, insurance is good. Can't argue with free food, either.", "Cons": "Some managers are outright rude to customers and employees. Most people didn't do anything at all, and left the work to a few select people. Managers didn't take complaints seriously, or would reprimand the people who came to them with the problem. Please, don't waste your time."}, "3": {"Date": " Oct 20, 2017", "Summary": "\"Cashier\"", "Pros": "Its very flexible if you have school", "Cons": "Low pay no room for improvement"}, "4": {"Date": " Oct 20, 2017", "Summary": "\"Staff are disrespectful, emotionally abusive, and are quick to terminate employees\"", "Pros": "They are accepting of diversity, a few staff recognize good work, the benefits are slightly good (50% on shift, 20% off shift, free meals on overnight shifts, and scholarship opportunities.", "Cons": "Usually understaffed, emotionally abusive environment(get snapped at by management for asking reasonable requests, starts at 8 an hour, not much chance for advancement,"}, "5": {"Date": " Oct 20, 2017", "Summary": "\"A nonstop workflow that can become difficult, annoying, and most of all, stressful.\"", "Pros": "You get half-off all food with the exception of specialty items.", "Cons": "It never slows down, end up going on lunch late, and it is extremely draining."}, "6": {"Date": " Oct 5, 2017", "Summary": "\"Fry cook\"", "Pros": "Worked with my busy schedule", "Cons": "Cleanliness of restaurant not always up to par"}, "7": {"Date": " Oct 5, 2017", "Summary": "\"Good for beginners\"", "Pros": "Good pay for minors, gain work experience, fast pace work environment", "Cons": "Managers, rude customers, constantly on your feet for hours"}, "8": {"Date": " Oct 5, 2017", "Summary": "\"It wasn't as bad as I thought it would be.\"", "Pros": "You get time off if you ask for let's say, a vacation to somewhere out of town.The pay is not too bad, its a good start for a young worker.", "Cons": "Rude customers.Some people that are hired shouldn't be.Some of the co workers are stuck up.They wait too long to give someone a higher position"}, "9": {"Date": " Oct 5, 2017", "Summary": "\"When I was there\"", "Pros": "Best thing about working for McDonald's is the opportunity for advancement. They like to promote from within, and their benefits packages then were nothing to sneeze at, & college tuition reimbursement, for bachelors level degrees", "Cons": "Long hours, and rapid employee turnover, until a team is established. I worked there 5 years, and most of my crew were high school students that continued to work for me until they were through their first or second year of college."}}