{"0": {"Date": " Aug 30, 2017", "Summary": "\"Not the best place to work\"", "Pros": "You get free food if you want to stay over 8 hours they let you some of the management is ok", "Cons": "They don't give your schedule two day in advance and never honored my requested days off no holiday pay no overtime pay working more than 8 hours they let managers kids get away with everything they do not give out raises like they advertise you can go years without a raise from minimum wage"}, "1": {"Date": " Aug 9, 2017", "Summary": "\"Crewtrainer\"", "Pros": "You meet a lot if nice people, some of your coworkers are nice.", "Cons": "Some of the managers play favoritism with certain people. It seems to me and some of the customers also said that \"it is all for the money\", some places don't care how they treat their crew or customers."}, "2": {"Date": " Aug 9, 2017", "Summary": "\"This is my honest oppinion\"", "Pros": "Good hours, and good pay. Theres a reason for everything.", "Cons": "An enjoyable working enviornment is a thing of the past."}, "3": {"Date": " Jul 24, 2017", "Summary": "\"Cashier\"", "Pros": "You get paid every week", "Cons": "You are rushed a little too much."}, "4": {"Date": " Aug 7, 2017", "Summary": "\"Good.\"", "Pros": "Good crew good customers. Excellent management. I was happy to be part of the team. Would apply here again because environment is great", "Cons": "Can get quite busy and no commission or raises. Work a lot of hours for just minimum wage. Wish is unfortunate"}, "5": {"Date": " Aug 7, 2017", "Summary": "\"cashier\"", "Pros": "its not bad if you need the money and a simple job", "Cons": "many rude customers, low pay"}, "6": {"Date": " Aug 7, 2017", "Summary": "\"Maintenance\"", "Pros": "It's great if you are into physical labor. There is a lot of heavy lifting.", "Cons": "Little pay. Tons of work. Has to be done in a short period of time."}, "7": {"Date": " Aug 7, 2017", "Summary": "\"Asst service manager\"", "Pros": "Food to eat and drink.", "Cons": "Lots of work to do"}, "8": {"Date": " Aug 8, 2017", "Summary": "\"manager\"", "Pros": "great food. great drinks great", "Cons": "bad smell in bathroom urinal"}, "9": {"Date": " Jul 23, 2017", "Summary": "\"Great first job.\"", "Pros": "Flex hours, perfect for school", "Cons": "Benefits, retirement, depends on individual owner"}}