{"0": {"Date": " Aug 4, 2016", "Summary": "\"Poor management\"", "Pros": "Half off on meals, Free meal if working more than 6 hours, break every 2 hours. free drinks.", "Cons": "horrible customers, gross bathrooms, poor management, didn't offer direct deposit, inconvenient work hours ( I was in high school and college at time)"}, "1": {"Date": " Jul 20, 2016", "Summary": "\"Great place to work\"", "Pros": "Friendly staffGood environment and people", "Cons": "Bad payNot good for career"}, "2": {"Date": " Aug 26, 2016", "Summary": "\"Franchise\"", "Pros": "You get to Meet new people", "Cons": "Never work for a franchise"}, "3": {"Date": " Aug 5, 2016", "Summary": "\"Worst experience ever\"", "Pros": "you get great Food discounts", "Cons": "rude managers , stingy with breaks, works long hours, lagging mangers, low wages"}, "4": {"Date": " Jul 20, 2016", "Summary": "\"Good\"", "Pros": "Good if your are in desperate need of money. Overall nice honest people working there, not gonna lie.", "Cons": "Good enough break time. Busy around lunch time, staff often don't pull their weight around here though."}, "5": {"Date": " Jul 20, 2016", "Summary": "\"Crew Member (Cashier) Experience\"", "Pros": "You'll learn how to work in a very fast paced environment. My McDonald's had very few periods of calm even in off-hours. I had to learn how to multi-task and work efficiently. Also, I learned how to deal with a wide range of individuals with differing priorities: very wealthy or homeless; speedy delivery or accuracy over efficiency; some people even wanted me to slow down and focus on customer service itself. So it was interesting to learn how to treat each customer as a unique individual and focus on their needs.It's a repetitive job, but it can be rewarding when everyone is satisfied with their orders.", "Cons": "Some of the regulars would regularly forget that you were not a perfect robot.Since our breaks were all spread out in order to accommodate the customers, I didn't get to interact much with the other team members.There were a lot of Spanish-speaking or heavily accented individuals that I couldn't help but offend when I didn't understand them. Learning common Spanish words is very useful."}, "6": {"Date": " Jul 20, 2016", "Summary": "\"Crew Member\"", "Pros": "Great peopleAlot of hoursPays above minimum wageForward thankingFast pacedClean", "Cons": "Managers can choose favoritesFast pace can be tough when you first start"}, "7": {"Date": " Aug 3, 2016", "Summary": "\"Manager\"", "Pros": "Social life if fun also", "Cons": "Very unstable and very stressful"}, "8": {"Date": " Aug 4, 2016", "Summary": "\"Assistant Manager\"", "Pros": "Good benefits and business experience.", "Cons": "Lack of communication between super management and store level"}, "9": {"Date": " Jul 19, 2016", "Summary": "\"Great benefits\"", "Pros": "The best benefits work the sabbaticals after 10 years of service and if you were a remote worker you most likely had a company car would you could use during your entire vacation at no cost to you. In addition to your sabbatical you could also have the option of adding your regular vacation time and if you lasted for 10 years you had 5 weeks of vacation.", "Cons": "I was a remote worker which allowed many freedoms but new leadership micromanaged."}}