{"0": {"Date": " Feb 23, 2017", "Summary": "\"It's McDonald's\"", "Pros": "-Consistent pay is really good", "Cons": "-Rude customers can be very frustrating to deal with"}, "1": {"Date": " Feb 8, 2017", "Summary": "\"Employee\"", "Pros": "Some of the best reasons to work her are they are super nice I haven't gone into there and been disrespected", "Cons": "There aren't really any cons the employees are super nice"}, "2": {"Date": " Feb 9, 2017", "Summary": "\"employement\"", "Pros": "I love working with my co-wokers and managers. They always polite and smiling.", "Cons": "Not enough help need more staff"}, "3": {"Date": " Feb 9, 2017", "Summary": "\"Good\"", "Pros": "Making sure the customers are satisfied and happy", "Cons": "When the customer doesn't get the right thing"}, "4": {"Date": " Feb 8, 2017", "Summary": "\"Good first job and career, just not for me\"", "Pros": "Fast-paced work makes shifts fly by, and there's usually good and supportive co-workers", "Cons": "Sometimes stressful; customers tend to blame you for things out of your control"}, "5": {"Date": " Feb 9, 2017", "Summary": "\"Drive Thru\"", "Pros": "Fast paced. Fun coworkers always", "Cons": "Pay sucks. Not alot of opportuntity"}, "6": {"Date": " Feb 22, 2017", "Summary": "\"review\"", "Pros": "got free food after work", "Cons": "got stuck behind a fryer all day"}, "7": {"Date": " Feb 23, 2017", "Summary": "\"McDonalds\"", "Pros": "Flexible hours. Always have something to keep you busy", "Cons": "Little to no raises. Rude customers"}, "8": {"Date": " Mar 15, 2017", "Summary": "\"This place is very terrible\"", "Pros": "I can use my previous job here to leave a review on it so I can unlock glassdoor reviews on better jobs.", "Cons": "If the manager doesn't like you, they schedule you 2 hours then try to manipulate you into working an 11 hour shift in one day.They don't give you your breaks and if they don't give you your lunch break, they assume they did and take 30 minutes out of your pay.When I worked for a corporate McDonald's, they just shuffled the bad managers to other stores instead of firing them.When I worked at franchise, there seemed to be no standards for leadership."}, "9": {"Date": " Feb 23, 2017", "Summary": "\"Silvina is a great company\"", "Pros": "I love silvina because it allows freedom in the workplace", "Cons": "The hours varied which was difficult"}}