{"0": {"Date": " May 25, 2016", "Summary": "\"Negative\"", "Pros": "Good hrs good check some OK managers", "Cons": "Never Can call in sick or you have no job"}, "1": {"Date": " May 10, 2016", "Summary": "\"McDonalds Was A Very Friendly, Fast, And Upbeat Place With Great Device.\"", "Pros": "Stay BusyMeet New PeopleMeet Interesting PeopleMake Lifetime FriendsLearn New ThingsGreat Opportunities", "Cons": "Maybe A Little Too FastYou Might Work With People You Don't LikeDealing With Rude CustomersHaving To Take Money And Orders Can Get Confusing"}, "2": {"Date": " May 11, 2016", "Summary": "\"hard worker\"", "Pros": "I just live to work no matter what the job might be", "Cons": "Can be crazy at times but you got to suck it up and stay true to yourself knowing you can do it"}, "3": {"Date": " May 11, 2016", "Summary": "\"Fun, Easy & hectic at times\"", "Pros": "- good management- promotions- flexible hours", "Cons": "- disrespectful crew members that have no idea how to do their job."}, "4": {"Date": " Jun 16, 2016", "Summary": "\"Crew Member\"", "Pros": "Always on timeEfficiently did job assignedNever missed work, unless sick. ... was not sick much.Have worked there over 2 years", "Cons": "Pay was not enoughDidn't get enough hoursWas laid off, without notice. .. sometimes, two weeks in a row"}, "5": {"Date": " May 25, 2016", "Summary": "\"Would NEVER work there again.\"", "Pros": "A free meal every time you worked a shift that was at least 4 hours. That's pretty much it .. Honestly.", "Cons": "They couldn't,.. I'm sorry WOULDN'T make my work schedule flexible around my school schedule.. I was still in high school, so school was more important to me than working there. Plus, they didn't care if you had any family emergencies or anything, they expected you to come to work no matter what."}, "6": {"Date": " May 26, 2016", "Summary": "\"Not for anyone with health issues. You will be a target.\"", "Pros": "Meal discountWork experienceChance to learn multiple skills", "Cons": "Don't woek here if you have disabilities or health issues. They had multiple violations of ADA, and when confronted (after my 3rd hospital visit for something preventable), upper management did nothing to the manager responsible."}, "7": {"Date": " May 10, 2016", "Summary": "\"Crew Member\"", "Pros": "You get a lot of expierence", "Cons": "Sometimes you would get rude customers"}, "8": {"Date": " May 10, 2016", "Summary": "\"Admin Coordinator\"", "Pros": "nice people, great values, some good perks.", "Cons": "not quick to evolve too many layers and not enough supervisory/manager positions."}, "9": {"Date": " May 10, 2016", "Summary": "\"General manager\"", "Pros": "Fun environment a lot of training orientation and just a great atmosphere", "Cons": "Nothing bad to say about the organization"}}