{"0": {"Date": " Feb 26, 2018", "Summary": "\"its an ok job\"", "Pros": "reasonable pay, and good scheduling", "Cons": "management really sucks, rude customers"}, "1": {"Date": " Feb 26, 2018", "Summary": "\"Member of crew while part time student\"", "Pros": "team environment, successfully made it such that the whole is greater than the sum of its parts", "Cons": "little to no move up / raise oppurtunities"}, "2": {"Date": " Feb 27, 2018", "Summary": "\"I became one of the fastest members in the Drive-Thru\"", "Pros": "I've got to know many people that live in town", "Cons": "Getting up at 4 in the morning and it be freezing or snowing"}, "3": {"Date": " Feb 27, 2018", "Summary": "\"It was a learning expernice\"", "Pros": "helped learned to deal with people", "Cons": "it was very disorganized"}, "4": {"Date": " Feb 11, 2018", "Summary": "\"Cashier\"", "Pros": "McDonald's makes great burgers and great fries and great shakes and great cookies and really good salads. I really like all of the restaurants", "Cons": "McDonald's can sometimes be dirty on the inside which does not make for a pleasurable experience. I only like clean facilities"}, "5": {"Date": " Feb 11, 2018", "Summary": "\"Cashier\"", "Pros": "People person. Hard worker. Have experience", "Cons": "I might gain weight because food is so good"}, "6": {"Date": " Mar 19, 2018", "Summary": "\"My McDonald's Experience\"", "Pros": "You will meet many nice and friendly repeat customers, you will mostly have freedom with your shifts like if you need time off or want to work certain times or days.", "Cons": "The managers just stand around looking at their phones instead of helping the employees even if you are swamped with orders. you have to be great at multi tasking. Don't look forward to career advancement because even if you become a crew trainer the will find away not to give you your deserved raise or promote you to manager."}, "7": {"Date": " Feb 26, 2018", "Summary": "\"Crew Member\"", "Pros": "Very open and compensating with your schedule.", "Cons": "Management does not seem to care much about their employees!"}, "8": {"Date": " Feb 11, 2018", "Summary": "\"i work at mcdonalds and i get payed this much\"", "Pros": "EasyGood payFun people Good oversight", "Cons": "Kind of grimyFood gets kind of old after eating it all the time."}, "9": {"Date": " Feb 11, 2018", "Summary": "\"Nice Company\"", "Pros": "Many Friendships created, Nice management", "Cons": "Hard hours, very angry customers"}}