{"0": {"Date": " Aug 16, 2016", "Summary": "\"Excellent\"", "Pros": "Food was goodmanagement was decentcustomers were always friendly", "Cons": "Low pay to those who do not try"}, "1": {"Date": " Aug 17, 2016", "Summary": "\"good\"", "Pros": "people i worked with were", "Cons": "no free fries ever man"}, "2": {"Date": " Sep 21, 2016", "Summary": "\"hm\"", "Pros": "They pay you i guess that better then not getting anything but really there are not many pros to working at a place that gives people diabetes", "Cons": "rude people annoying managers rude customers it basically makes up all businesses that have to deal people when they serve food"}, "3": {"Date": " Sep 21, 2016", "Summary": "\"Fry Cook, Window The Drive Thru And Etc\"", "Pros": "I like the people that I have worked with", "Cons": "there was only one of the people that I didn't like at all"}, "4": {"Date": " Sep 21, 2016", "Summary": "\"Terrible\"", "Pros": "free lunch for the breaks", "Cons": "very unprofessionalterrible trainingincompetent managers"}, "5": {"Date": " Aug 31, 2016", "Summary": "\"cashier\"", "Pros": "Easy Job, convenient location near my home.", "Cons": "Low pay. Lack of professionalism from superiors."}, "6": {"Date": " Aug 31, 2016", "Summary": "\"Good starting point, but don't turn into a lifer.\"", "Pros": "Flexible schedule, 1 weekend off a month, raises twice a year, benefits like 401k and tuition reimbursement", "Cons": "stressful environment, working holidays without a choice or holiday pay, generally low pay, there are promotion opportunities but if you are at a low volume store you may get ignored even if you are good enough for a promotion"}, "7": {"Date": " Sep 1, 2016", "Summary": "\"Crew\"", "Pros": "You get some work experience.", "Cons": "The management doesn't care about your health or about safety. They are more focused on their times for orders being low and their paycheck."}, "8": {"Date": " Aug 16, 2016", "Summary": "\"Pretty good\"", "Pros": "Make new friends, flexible hours, and not very time consuming unless you put in a lot of hours.", "Cons": "Management sometimes expects you to work hard, the pay isn't much."}, "9": {"Date": " Aug 17, 2016", "Summary": "\"Crew Member\"", "Pros": "I like to customer service, cash flow management, and multitask.", "Cons": "Very low pay rate and no pay raise."}}