{"0": {"Date": " Oct 13, 2017", "Summary": "\"Shift Manager\"", "Pros": "Paid Sick days, and reviews every 6 months.", "Cons": "Its a horrible job in general don't work there"}, "1": {"Date": " Oct 14, 2017", "Summary": "\"Worst place EVER\"", "Pros": "The other crew members are super nice and helpful!", "Cons": "Where do I begin? I only worked a day and that's all it took. 1) one of the managers smelled like they hadn't taken a shower in a week. Another manager you could see her stomach cuz she was out of buttons on her shirt. 2) I was scheduled from 4:15am to 1:00 pm. They made me take a 30 minute break at 6:00 am and refused to let me take a break for the next 7 hours. 3) the managers wouldn't train me but then griped when I was doing something wrong. 4) they treated the employees like crap. 5) the managers are lazy 6) I had to be given permission to go to the bathroom and get a drink. I even had to get permission to leave AFTER my scheduled shift was over and they finally decided I had permission to after 1:15 pm."}, "2": {"Date": " Sep 22, 2017", "Summary": "\"Kitchen\"", "Pros": "It was very easy to apply and obtain position", "Cons": "Very low pay, hours were scheduled so as to minimize worker protections"}, "3": {"Date": " Sep 22, 2017", "Summary": "\"Job Review\"", "Pros": "Job securityHoursLearn to work as a team", "Cons": "Upper management sucksMost people you work with are lazyThey don't give out raises when they're supposed toThey show very little to no appreciation"}, "4": {"Date": " Sep 23, 2017", "Summary": "\"can't complain - what can you say\"", "Pros": "it's a minimum wage job, at least you're making money", "Cons": "too much to list, it's a fast food place"}, "5": {"Date": " Sep 7, 2017", "Summary": "\"Worked a lot so Great pay, but that's all.\"", "Pros": "Got a lot of hours working overnight so I was making like 650+ every 2 weeks, which isn't a lot but it's more than anywhere else I've worked.", "Cons": "People are extremely rudeOther employees are horrible, attitudes, rude to the customers, even managers treat people with no respect. And as a customer myself before and now, I'm just completely dissatisfied with there training and the way they treat there customers.Having one worker and a manager that doesn't even do anything working overnight, when there is supposed to be at least three people is ridiculous. It's exhausting and even for a person that doesn't there hardest it was just to much."}, "6": {"Date": " Sep 7, 2017", "Summary": "\"Assistant manager\"", "Pros": "Its a really good pay and bonuses", "Cons": "Some good stress but manageable"}, "7": {"Date": " Sep 7, 2017", "Summary": "\"Good work\"", "Pros": "Work as expected. Not too shabby.", "Cons": "Not the best obviously, but at least you get some money."}, "8": {"Date": " Sep 8, 2017", "Summary": "\"Manager trainee\"", "Pros": "Dealing with customers great place to start out working with others and how to deal with he public on many levels", "Cons": "some time too many hours and some time not enough..pay is low depending on your experience"}, "9": {"Date": " Sep 21, 2017", "Summary": "\"Frustrating\"", "Pros": "You get to make people smileDirect employees", "Cons": "Have to deal with customersHigh expectations from managementUnreliable coworkers"}}