{"0": {"Date": " Aug 7, 2017", "Summary": "\"Former cook\"", "Pros": "Welcoming environment to start in", "Cons": "Pay sucks even with previous experience"}, "1": {"Date": " Jul 22, 2017", "Summary": "\"Administrative Coordinator\"", "Pros": "Good benefits, positive work environment.", "Cons": "Pay is on the low side for the amount of work that is expected of you."}, "2": {"Date": " Aug 27, 2017", "Summary": "\"McDonald's-possibly the worst company to work at\"", "Pros": "The very few pros are some scholarships and the McPerks program.", "Cons": "The company never called back when I applied, I had to be told to go in through my friend who was an employee there. There was no interview process, it's like they just let anyone work there. I wasn't told my schedule or pay. They barely trained me and put me right on the register when I went in for my first day. No one ever welcomed me to the job and didn't care to converse with me. The whole environment was very unprofessional. Mostly everyone that worked there was hispanic and I don't speak Spanish so I didn't know what was going on 90% of the time."}, "3": {"Date": " Aug 6, 2017", "Summary": "\"Basoc\"", "Pros": "The company sucks but a job is a job. Wish they had better values.", "Cons": "The food is disgusting and they have no morals or values"}, "4": {"Date": " Aug 5, 2017", "Summary": "\"McDonalds\"", "Pros": "Good starting job for teens", "Cons": "You are working in fast food.."}, "5": {"Date": " Aug 5, 2017", "Summary": "\"Reasonable\"", "Pros": "Pretty reasonable with scheduling shifts.", "Cons": "Can work with some shady/sketchy people, including sketchy management. Had an issue where a supervisor with drug problems took money out of my drawer and even after being caught, I received no apology."}, "6": {"Date": " Aug 6, 2017", "Summary": "\"swing manager\"", "Pros": "get promoted quickly give overrides", "Cons": "it sucks no life balance uder appreciated"}, "7": {"Date": " Jul 21, 2017", "Summary": "\"Crew chief\"", "Pros": "Room for growth. Great pay.", "Cons": "No benefits. No paid time off."}, "8": {"Date": " Jul 21, 2017", "Summary": "\"Cashier\"", "Pros": "I like working here b/c it is fun", "Cons": "I don’t hoe the team works people or selfish"}, "9": {"Date": " Jul 21, 2017", "Summary": "\"McDonald's life\"", "Pros": "Decent pay, helps with education, friendly company workers and management.", "Cons": "Long hours of standing, tough work sometimes physical."}}