{"0": {"Date": " May 8, 2016", "Summary": "\"McDonalds best for you?\"", "Pros": "When no customers are ordering there is down time to clean just about everything. When we get overwhelmed with orders people offer there help if your all alone on prep table.", "Cons": "Its McDonalds… Sometimes you can watch as one person works, and three people are laughing while management still complains to that one working employee. Hours are cut up to 20 hours for some part time people out of the blue."}, "1": {"Date": " May 29, 2016", "Summary": "\"Depressing\"", "Pros": "there are literally no pros to working at mcdonalds it sucks", "Cons": "Sucks working here. stay in school kids"}, "2": {"Date": " May 8, 2016", "Summary": "\"dont do it\"", "Pros": "good with my school schedule being part time. but other than that a dead end. Food is not for me", "Cons": "managers were uneducated and thought they were amazing. they really werent, what do you expect from mcdonalds though"}, "3": {"Date": " May 9, 2016", "Summary": "\"Take care of your people...\"", "Pros": "Flexible schedule, rewarding if you like to work with the public, can be lucrative for top management and/or large franchisees with room for growth", "Cons": "Needs to update people policy to 21st century; offer retirement and PTO, can be frustrating at times because commitment level of employees is very inconsistent."}, "4": {"Date": " Apr 23, 2016", "Summary": "\"My experience is great.\"", "Pros": "The best reasons would be the customers. Be able to socialize with new people everyday is a wonderful thing for me.", "Cons": "Well the challenges will always come. No matter where you work expect the challenges. I had many challenges, but I conquered each one, each time."}, "5": {"Date": " May 7, 2016", "Summary": "\"First Job\"", "Pros": "Managers were friendly, good teamwork, training went well, good first job to have when in high school.", "Cons": "Team of high schoolers, work environment could have been better"}, "6": {"Date": " May 7, 2016", "Summary": "\"meh\"", "Pros": "burgers are not good for you when you work here a lot lol this is a fake review lol this is not real", "Cons": "I did not have a car and they never offered to drive me home so I had to take my pogo stick"}, "7": {"Date": " Apr 22, 2016", "Summary": "\"Finance Manager\"", "Pros": "Great people to work with.Flexibility for time off", "Cons": "Long hours at certain times"}, "8": {"Date": " Apr 22, 2016", "Summary": "\"Hard working\"", "Pros": "It's my first job been working there since I made 18 I'm going to be 19 I want a better job", "Cons": "Not enough and getting under paid"}, "9": {"Date": " Apr 22, 2016", "Summary": "\"Team member\"", "Pros": "One of the best fast food friendly motivated company for experience the food and fruit yummy", "Cons": "Negative people don't like people"}}