{"0": {"Date": " Jan 8, 2018", "Summary": "\"It pays the bills\"", "Pros": "Amazing benefits: 3 weeks paid vacation, no cost health insurance, matching 401k. Owners are nice to work for. I make my own schedule.", "Cons": "Constantly being on call 24 hours a day. Working all weekends and holidays. Not enough help. Hardly get anyone that applies."}, "1": {"Date": " Jan 8, 2018", "Summary": "\"crew member\"", "Pros": "the best part of working at Mcdonalds was working as a team and making friends", "Cons": "no room for improvement. It is very hard to move up within the company"}, "2": {"Date": " Jan 22, 2018", "Summary": "\"Fun At Times\"", "Pros": "It felt really rewarding to learn new positions, and to teach others new skills as a Crew Trainer. Some of the customers could be so kind and fun to talk with. I made some of my best friends working at McDonalds.", "Cons": "I worked at a franchise, so a lot of this may vary place to place. I was promised promotions so often and had them swept out from under me by people less qualified. It took MONTHS to get a pay raise once I finally did get promoted, as well as the raise that came with working overnight. As is the case with most customer service job, there were a lot of threats against my crew and I for MINOR mistakes. Rude customers, things thrown at me, people demanding free food while drunk."}, "3": {"Date": " Jan 22, 2018", "Summary": "\"cashier\"", "Pros": "clean work environment, good pay", "Cons": "long hours, late hours, some coworkers..."}, "4": {"Date": " Jan 7, 2018", "Summary": "\"Shift Manager\"", "Pros": "great coworkers and team attitude", "Cons": "Angry customers can be challenging"}, "5": {"Date": " Feb 12, 2018", "Summary": "\"part time\"", "Pros": "- flexible hours- easy job- steady wage", "Cons": "- poor working conditions- poor management"}, "6": {"Date": " Feb 12, 2018", "Summary": "\"Manager\"", "Pros": "you eat fo free yo", "Cons": "this place sucks a bunch"}, "7": {"Date": " Jan 21, 2018", "Summary": "\"My experience\"", "Pros": "It if pretty fun to work at my mcdonalds at 21st and Greenwich, the GM is a super chill guy who you can talk to and make friends with.", "Cons": "The Management in the restaurant is pretty lacking and they is fighting in the kitchen that holds up the orders"}, "8": {"Date": " Jan 21, 2018", "Summary": "\"Cashier\"", "Pros": "Fast Pace, learned how to manage time effectively.", "Cons": "Pay was not worth the amount of work."}, "9": {"Date": " Jan 22, 2018", "Summary": "\"It was ok.\"", "Pros": "Free Big Macs all day.", "Cons": "You're working at McDonalds, so that's a con."}}