{"0": {"Date": " Jun 16, 2017", "Summary": "\"Crew Trainer\"", "Pros": "They have no pros besides the fact that they are close..", "Cons": "Managers don't do anything.. Slow people"}, "1": {"Date": " May 11, 2017", "Summary": "\"Good Company for part time work\"", "Pros": "Liked the people that worked there", "Cons": "no cons for this location"}, "2": {"Date": " May 11, 2017", "Summary": "\"Manager\"", "Pros": "Friendly, People are caring and I enjoy working", "Cons": "There are no cons to discuss"}, "3": {"Date": " May 11, 2017", "Summary": "\"Good\"", "Pros": "Free lunch which is really good and im only writing this extra part because it's twenty words minimum okay I hope this is enough I will go away now", "Cons": "Standing a lot and im only writing this extra part because it's twenty words minimum okay I hope this is enough I will go away now"}, "4": {"Date": " May 11, 2017", "Summary": "\"Employee for a Summer\"", "Pros": "The very few workers that helped out did a good job.", "Cons": "Not many people enjoyed working there besides the managers. The young works did not do much at all besides look at their phone and not pull their own weight."}, "5": {"Date": " May 12, 2017", "Summary": "\"Great job with a great franchise company\"", "Pros": "Great incentives around the holidays, dedicated to it's employees and promoting growth.", "Cons": "A lot of pressure put on it's managers with difficult to achieve expectations and select stores have very poor general management resulting in low employee morale."}, "6": {"Date": " May 24, 2017", "Summary": "\"Crew\"", "Pros": "Decent paying job... not too hard to work", "Cons": "Really greasy and the food get gross after awhile to eat."}, "7": {"Date": " May 25, 2017", "Summary": "\"Definitely a first Job\"", "Pros": "-Relatively flexible so long as you let them know in advance-Had security so it felt safe-Good workplace standards and kept clean usually-Overall easygoing coworkers who would help for the most part-50% employee discount", "Cons": "-3 hour training video that taught nothing-If your crew trainer doesn't care you'll be thrown into the flames with no understanding-Consistent state of panic since almost everyone's new yet they expect you to understand the job from day 1-Understaffed and overworked-Breaks would be cut short if they were going down with threats of a write up-Don't expect a pay raise or better position, I trained crew after 4 months of working and still got nothing from it, it's expected."}, "8": {"Date": " May 25, 2017", "Summary": "\"Worker\"", "Pros": "Good people. Not too challenging. Can be laid back depending on hours", "Cons": "Can be difficult to work with customers. Environment is not the best."}, "9": {"Date": " Jun 15, 2017", "Summary": "\"McDonald's\"", "Pros": "No hospitality, not clean , people are disreptful, no flexible hours", "Cons": "When the food is hot it s really amazing,"}}