{"0": {"Date": " Dec 12, 2016", "Summary": "\"Department Manager 3\"", "Pros": "As a salaried manager working at McDonald's you are a guaranteed 45 hours a week. There is no less then that, and you have to have open availability. You are to work 9 hours a day, and get your entire month's schedule a month in advanced. You can request day's off with the exception of holidays. You are taught numerous business management courses for free, which can be up to college credits for free. You are in charge of a specific department as well as your crew, fellow managers under you, and of course the customers.", "Cons": "Restaurant never closes so you can be scheduled to work open to closes. Any holidays, if not all holidays. Other managers with limited availability don't have to work on holidays. You get the same paycheck every two weeks. That is if you work only 45 hours a week strictly. The norm is 47-50 hours a week. Raises are only once a year and bonuses are based of PAC between all 50 restaurants. Milwaukee stores are the usual ones to get them."}, "1": {"Date": " Nov 27, 2016", "Summary": "\"good company\"", "Pros": "1. good working environment2. provider training to each employee4. very good work life balance3. can wear jean", "Cons": "It is very politics compayny"}, "2": {"Date": " Dec 13, 2016", "Summary": "\"Crew member\"", "Pros": "Got to meet new people", "Cons": "You get treated badly for such a low paying job"}, "3": {"Date": " Nov 27, 2016", "Summary": "\"McDonald's Review from a formal Manager-in-training\"", "Pros": "I met some really good people, made great friends. I have gained skills in customer service, and management. Flexible hours.", "Cons": "The hours are flexible, however the management sometimes would still schedule people on days they cannot work."}, "4": {"Date": " Dec 11, 2016", "Summary": "\"McDonald's\"", "Pros": "Flexible schedule and decent paced work", "Cons": "Unappreciated for the hard work you do"}, "5": {"Date": " Dec 12, 2016", "Summary": "\"Well its McDonalds\"", "Pros": "Good standardized training and goal setting", "Cons": "its fast food, hard to feel good about that"}, "6": {"Date": " Dec 12, 2016", "Summary": "\"Ok for first job\"", "Pros": "they hire you with no experienceif you're a hard worker they're willing to promote", "Cons": "low pay, even for managers"}, "7": {"Date": " Nov 26, 2016", "Summary": "\"Mcdonalds\"", "Pros": "People are nice and the food is good", "Cons": "sometimes mcdonalds messes up an order"}, "8": {"Date": " Nov 26, 2016", "Summary": "\"Drive Thru Graveyard shift\"", "Pros": "Free food, not much going on", "Cons": "It was McDonalds at midnight to 8 AM"}, "9": {"Date": " Dec 10, 2016", "Summary": "\"Improvements should happen\"", "Pros": "Great connection with customers and possibillity for advancement with in your franchise.", "Cons": "Lazy workers, bad pay and not enough attention and recognition for outstanding employees."}}