{"0": {"Date": " Aug 22, 2016", "Summary": "\"Wasn't horrible\"", "Pros": "I enjoyed working at a privately owned McDonalds. Everyone was much more friendly then at a corporate location. Once you were in the swing of things the job wasn't bad.", "Cons": "Working at a corporate location was one of the downsides. I feel as though people care less when working for a corporation because they arnt working for themselves."}, "1": {"Date": " Aug 22, 2016", "Summary": "\"An okay place to work\"", "Pros": "Average pay, average hour opportunity. The restaurant was close to my home. I got to eat pies and burgers and sandwiches for free when my boss was not looking directly in my direction.", "Cons": "I did not get along well with my manager. I believe she saw me as competition, which makes sense and I cannot blame her. I was not able to get promoted because of this."}, "2": {"Date": " Aug 23, 2016", "Summary": "\"cashier\"", "Pros": "great benefits free food nice co-workers", "Cons": "hate cleaning, really busy,noisy, and fun"}, "3": {"Date": " Sep 12, 2016", "Summary": "\"Bad managment\"", "Pros": "Have an income coming in.", "Cons": "Managment is awful.Store manager is unprofessionalThey do not acknowledge the hard work and hours you do.Breaks are never respected. I was in my 8th hour and still didnt get my half.When asking for new uniforms they don't pay attention to your needs. Its more than obvious there is a favortism among managers and employees."}, "4": {"Date": " Sep 12, 2016", "Summary": "\"not lovin it\"", "Pros": "its better than being homeless", "Cons": "the french fry machine beeps until you wanna quit"}, "5": {"Date": " Aug 22, 2016", "Summary": "\"Every day\"", "Pros": "If you want to deal with people absolutely every second of when you work whether they are rude or not then its defiantly the place for you.", "Cons": "Bad environment, not so great people and not organized at all."}, "6": {"Date": " Aug 23, 2016", "Summary": "\"Crew Member\"", "Pros": "Learned how to deal with customers and work with a team.", "Cons": "Poor management and lack of communication"}, "7": {"Date": " Aug 21, 2016", "Summary": "\"McDonalds-Huntington Park\"", "Pros": "Easy to learn tasks and responsibilities. Helpful crew members and easy to get along with. Good first job for maybe 3 months tops to get experience.", "Cons": "The majority of the floor and assistant managers, maybe except 1 or 2, are unprofessional and act on their emotions rather than as helpful and customer service oriented managers. When looking in nearby locations and comparing it to this one, it shows that this location looks rather old and unclean. Lots of rude and unfriendly customers, seems to be related to the location, and it adds on stress so much that it can bring you down."}, "8": {"Date": " Aug 21, 2016", "Summary": "\"great\"", "Pros": "food was okay and usually got discounts or free meals while on the clock but usually ate afterwards", "Cons": "got to see how some stuff is handled and some is not that good. ice cream machine is cleaned only once a week so i suggest not buying sindaes smoothies etc."}, "9": {"Date": " Aug 21, 2016", "Summary": "\"Average\"", "Pros": "- Nice coworkers- Flexible boss", "Cons": "- Poor working conditions- Sub-par pay"}}