{"0": {"Date": " May 13, 2016", "Summary": "\"Cashuier\"", "Pros": "Fast paced, can be mostly independent work", "Cons": "Employees have a lot of time to talk."}, "1": {"Date": " May 13, 2016", "Summary": "\"Prep\"", "Pros": "Working with amazing customers", "Cons": "Co-workers being rude. Not enough hours"}, "2": {"Date": " May 12, 2016", "Summary": "\"Great work environment!\"", "Pros": "Great pay for graveyard shifts!", "Cons": "Lacking a backup plan for shift changes, should you need to get off at a certain time."}, "3": {"Date": " May 12, 2016", "Summary": "\"good when your young\"", "Pros": "16+ and is good for a first job", "Cons": "stupid mangers and customer. disliked them"}, "4": {"Date": " May 27, 2016", "Summary": "\"Part Time\"", "Pros": "There was barely anything good about working there.", "Cons": "Disorganized scheduling, did not know how to treat employees"}, "5": {"Date": " May 27, 2016", "Summary": "\"Good for high schoolers I guess?\"", "Pros": "Pretty flexible if you have a reason you can't make work", "Cons": "CRAPPY PAY. Especially for someone who's been in customer service for two years. Less than 6.40 after taxes!!!The people you work with all pretty much suck. Everyone thinks they're better than you, just because they make 25 more cents an hour ( LOL )Rude rude customers.Too much effort and too much time for the amount you get paid. Not worth it at all."}, "6": {"Date": " May 13, 2016", "Summary": "\"Okay if you want to give all information\"", "Pros": "No weekends. I could get as fat as I want.", "Cons": "This is none of your business"}, "7": {"Date": " May 26, 2016", "Summary": "\"Great\"", "Pros": "I'm lovin' it. good part time job for college.", "Cons": "not much to be said"}, "8": {"Date": " May 26, 2016", "Summary": "\"easy job\"", "Pros": "convenient to home. They train you in all areas of the business and hire a lot of disadvantaged workers. Overall a great place", "Cons": "low wage, management is not educated and are threatened by those with education. It was a good filler for in between jobs."}, "9": {"Date": " May 27, 2016", "Summary": "\"owner operated\"", "Pros": "some of employee's and manager's", "Cons": "either little hours or to many hours for alot of work for crap payno benefit's with without paying for them that can be half or most of your check"}}