{"0": {"Date": " Feb 5, 2018", "Summary": "\"Good to Start Out\"", "Pros": "Good for first job experience, get to meet nice people and get to learn about responsibility.", "Cons": "Rude customers and overwhelming at times especially on weekends."}, "1": {"Date": " Feb 5, 2018", "Summary": "\"Working At Mcdonalds Franchise Terrible\"", "Pros": "10.75 pay, went up to 11.75 on new years", "Cons": "Managers treat you like less than human, say theyre going to work with your schedule and turn it around to the exact opposite as what was said. Some weeks you can have 1 day off or none. Also being told to work a closing shift that can last to as late as 4am then asked to come in and do a morning shift the next day."}, "2": {"Date": " Jan 20, 2018", "Summary": "\"Kitchen Manager\"", "Pros": "Got to do independent work when doing inventory and ordersAll positions are easy to learnFlexible scheduling", "Cons": "Uncooperative coworkers can make work difficult/more challenging to meet store goals"}, "3": {"Date": " Feb 3, 2018", "Summary": "\"Crew Member\"", "Pros": "Not really many pros to working here. Meals were half off on 30 minute breaks. Opportunity to work your way up if you want to.", "Cons": "It's busy, fast paced, and stressful. It would be worth it if pay was at least above minimum wage."}, "4": {"Date": " Feb 24, 2018", "Summary": "\"Abusive Managers\"", "Pros": "Its a somewhat flexible job.", "Cons": "Managament is abusive and incompetent."}, "5": {"Date": " Feb 25, 2018", "Summary": "\"Not a good place to work\"", "Pros": "One free meal a day", "Cons": "Management doesn't care about you, the higher-ups don't care about you and if you are the type of employee that cares about doing your job well, everything is unappreciated and laughed at for caring so much! Do not work there if you are an older more decent employee! Leave it to the 17yo's!"}, "6": {"Date": " Feb 3, 2018", "Summary": "\"Horrible Job\"", "Pros": "None, but if I had to give it something right, if you really love McDonald's and I mean REALLY love it. The 50% off anything on the menu up to $25 dollars is okay I guess. I never really ate the food, in my opinion.", "Cons": "Very sloppy, horrible work environment, constant movement at all times. They were overall a bad work experience in every way, I would never do it again in my life."}, "7": {"Date": " Jan 19, 2018", "Summary": "\"McDonald's has great food.\"", "Pros": "I would like to work here because I would like to learn some responsibility and I would be fun to make friends with the employees.", "Cons": "The smell of food makes me hungry that would be hard. Also counting money is hard for me. Math is not my cup of tea."}, "8": {"Date": " Jan 19, 2018", "Summary": "\"Fun to work\"", "Pros": "It was a fun place to work at, very busy, so the hours went by pretty quick", "Cons": "I had issues with one manager, but nothing I couldn't work with. Very busy, so it is a pro and a con."}, "9": {"Date": " Jan 19, 2018", "Summary": "\"Great high school job\"", "Pros": "Works around schedule, taught hard work, professional, constant performance- based raises", "Cons": "Can be strenuous and dirty, low pay"}}