{"0": {"Date": " Oct 10, 2016", "Summary": "\"Great First Job\"", "Pros": "Learn how to excel under time crunches, establish a good work ethic, and lern how to work with difficult customers", "Cons": "Some shifts can be long, customers can be difficult, long periods of time on your feet"}, "1": {"Date": " Oct 10, 2016", "Summary": "\"fast food restaurant really fast on orders\"", "Pros": "85% to 87% clean, efficient service, an courteous to our customers manager considerate in giving more hours", "Cons": "insignificant space, 85% cleanliness"}, "2": {"Date": " Nov 16, 2016", "Summary": "\"Shift Manager\"", "Pros": "Free food and drinks and desserts", "Cons": "Manager is very rude, there is alot of sexual harassment, arguments, don't work well together, forced to work hours that you cant, biased on pay."}, "3": {"Date": " Oct 25, 2016", "Summary": "\"Very bad place to work.\"", "Pros": "Free food on your lunch breaks, third shift can play music or whatever they want, some coworkers are really nice", "Cons": "Management is lazy and pushes their job off onto other people, don't even try to file for employees comp you will be fired, the drunk customers are the worst"}, "4": {"Date": " Oct 25, 2016", "Summary": "\"Not the best place but it was ok\"", "Pros": "It had a good training program.", "Cons": "they dont treat people fairly. or appearicate you"}, "5": {"Date": " Oct 10, 2016", "Summary": "\"Mcdonalds\"", "Pros": "It's easy to get hired, the job isn't that difficult. You get experience", "Cons": "Sometimes you have to deal with rude or ignorant customers. Sometimes you get weird hours."}, "6": {"Date": " Oct 11, 2016", "Summary": "\"Manager\"", "Pros": "Love interacting with customers. Enjoy training and helping develop new employees", "Cons": "Salary and incentives could have been better"}, "7": {"Date": " Oct 11, 2016", "Summary": "\"general review\"", "Pros": "Learn to work with people and the public, once you learn several positions you can get a job in any city, any state at McDonalds, gain stamina, chances for rapid advancement.", "Cons": "Work near hot grills making the back work area very warm and you are hot all day, very fast pace, go home very tired every day."}, "8": {"Date": " Oct 24, 2016", "Summary": "\"Not that great\"", "Pros": "Relatively flexible hours, and it's an alright place to start your working career. They also pay weekly, which is nice for a fast food place.", "Cons": "You have to deal with all kinds of angry customers.Some managers are either ridiculously strict or ridiculously unprofessional"}, "9": {"Date": " Oct 24, 2016", "Summary": "\"It's What You Expect\"", "Pros": "Laid back environment, flexible hours", "Cons": "understaffed and often need to do others jobs"}}