{"0": {"Date": " Apr 13, 2016", "Summary": "\"Crew Member\"", "Pros": "McDonalds helps you with setting yourself up to begin your life. It helps you with understanding the important things like teamwork, dedication, and get it done mindset.", "Cons": "Higher ups tend to over exaggerate their titles, and take advantage of your hard work and loyalty, per say. Favors become necessary tasks just to finish your day. Plus, sometime unfair, and don't want to here your side of the story, saying it's an \"excuse\", because they always want to be right."}, "1": {"Date": " Apr 14, 2016", "Summary": "\"Salty sweat, Burger blood and tasteful tears\"", "Pros": "Food and working with people about the same age. A fast and good way to meet new friends if you handle stress.", "Cons": "Stressful and sometimes your co-workers are meatheads."}, "2": {"Date": " Apr 13, 2016", "Summary": "\"fisrt job\"", "Pros": "flexable easy free food friendly", "Cons": ".never have enough employees.slow.never organized"}, "3": {"Date": " Mar 30, 2016", "Summary": "\"Neutral Work place\"", "Pros": "Advancement happens fast. Some Flexibility. Depending on management, you can have a great time doing good work.", "Cons": "Again, depending on management you can have a bad time killing yourself to be told to do better. Sometimes they'll promote the people who are just good friends with managers instead of hard workers."}, "4": {"Date": " Apr 12, 2016", "Summary": "\"Depends On Which Company Owns It\"", "Pros": "Guaranteed hours, free lunch, and some good co-workers", "Cons": "Being yelled at for no reason, very manipulative upper management, and lazy employees"}, "5": {"Date": " Apr 12, 2016", "Summary": "\"Ok\"", "Pros": "1 Free Meal as Supervisor, No other real pros honestly.", "Cons": "Too Many Hours, Late Nights, No schedule changing, too much work with not enough time"}, "6": {"Date": " Apr 12, 2016", "Summary": "\"needs better pay\"", "Pros": "they work around you and the time that best suites your schedule .if you like flipping burgers and nothing but free time on your hands this is it.", "Cons": "no where near enough pay plus your paid like 200 every two weeks unless your a manager don't work here its not worth it ."}, "7": {"Date": " Apr 12, 2016", "Summary": "\"cook\"", "Pros": "It a easy job to work at and you balance your life with it .", "Cons": "If you not a full-time work then you don't get day off."}, "8": {"Date": " Apr 13, 2016", "Summary": "\"Good Place to work\"", "Pros": "Work generally with nice peopleGenerally really understanding with time off requestsReally good with scheduling around your lifeCan be on call if you need more hoursCan cross trainhalf off food during your shift", "Cons": "Customers at my store can be a little crazy at time (rude, dirty)if you call out sick and can't get your shift covered you still have to come insome customers are mean and yell at you"}, "9": {"Date": " Mar 28, 2016", "Summary": "\"good\"", "Pros": "lots of hours good enviroment and motavational with lots of fun for first time lots of tie and food", "Cons": "can ruin eating there and not good for animal lovers of food very not nice managers with not verry mch money"}}