{"0": {"Date": " Aug 18, 2016", "Summary": "\"cashier\"", "Pros": "It's fast paced and you're able to work with people which is a huge plus. Working for the company will definitely improve your customer services skills.", "Cons": "very bad mannered and you're also liable to work with people from questionable backgrounds with criminal history."}, "1": {"Date": " Aug 2, 2016", "Summary": "\"Great growth and learning\"", "Pros": "Great management program for younger people.", "Cons": "Owner was not a nice guy"}, "2": {"Date": " Aug 3, 2016", "Summary": "\"Former employee\"", "Pros": "Very great place to work, good people, nice managers", "Cons": "A lot of work for not a lot of pay"}, "3": {"Date": " Aug 16, 2016", "Summary": "\"Is what it is\"", "Pros": "Not much except getting paid", "Cons": "Rude customers and under appreciated,"}, "4": {"Date": " Aug 17, 2016", "Summary": "\"Dept manager\"", "Pros": "It's a well run business by the owners they help with diplomas if you don't have one and a family business", "Cons": "Sometimes deal with rude customers and there is really nothing you can do about and the pay could be more we do a lot and deal with a lot and should get paid for it"}, "5": {"Date": " Sep 6, 2016", "Summary": "\"window\"", "Pros": "great hourspay was goodtraining was easy", "Cons": "managers are meanthe place is a messthey advertise flexible schedules but always scheduled me on days i asked off and threatened to fire me if i missed work on a day i asked off to go to court for a speeding ticket to get to work on time"}, "6": {"Date": " Aug 1, 2016", "Summary": "\"Crew/Closer\"", "Pros": "Great food, half offOK payManagers are great, super niceLots of hours during school time- Also very flexible hours and work with your schedule", "Cons": "Coworkers never want to do workHours were very low during summer timeSome coworkers and customers can be very nasty"}, "7": {"Date": " Aug 1, 2016", "Summary": "\"Mcdonalds\"", "Pros": "I was always early and very friendly to the customers", "Cons": "nothing went bad at all while I was working"}, "8": {"Date": " Aug 1, 2016", "Summary": "\"loved it but hired to many people over summer n cut my hours\"", "Pros": "Friendly customers fast past and got job down and handled", "Cons": "Rude managers the store was not organized like it should have been"}, "9": {"Date": " Aug 2, 2016", "Summary": "\"Manager\"", "Pros": "Recieve free and good Experience", "Cons": "Very Demanding at times and sometimes chaotic."}}