{"0": {"Date": " Aug 1, 2016", "Summary": "\"decent first job\"", "Pros": "friendly people good pay and flexible scheduling", "Cons": "customers can be rude, can also get busy and frustrating but doable"}, "1": {"Date": " Aug 14, 2016", "Summary": "\"cook\"", "Pros": "can learn responsibility and customer service skills. Good opportunities for advancement or being given the chance to advance your education through possible scholarships", "Cons": "not everyone, especially the students who come to work, is very enthusiastic about really doing their jobs"}, "2": {"Date": " Aug 14, 2016", "Summary": "\"Crew\"", "Pros": "Free food and great management.", "Cons": "Low pay and hours cut."}, "3": {"Date": " Aug 14, 2016", "Summary": "\"Alright for temporary employment\"", "Pros": "Easy to move up if you work for it. Achieving management is not hard if you are personable and good with money. Raises every 6 months. Paid time off and tuition assistance for all employees.", "Cons": "Constantly understaffed and the upper management doesn't care. Money is the bottom line and you will work your butt off to meet targets. No holiday pay and open 24 hours on every holiday. Once you advance to a management position, they stopnworrying about your availability and won't bother to work around your schedule."}, "4": {"Date": " Aug 14, 2016", "Summary": "\"good\"", "Pros": "it was a good place to work. really good for beginners", "Cons": "I do not have anything negative"}, "5": {"Date": " Aug 15, 2016", "Summary": "\"McDonalds\"", "Pros": "There is room for advancement, everyone is treated equally", "Cons": "It was just too far in JFK but that was on me, I don't know why I applied there lol But over all there was no cons it was a cool company to work for."}, "6": {"Date": " Aug 15, 2016", "Summary": "\"Things we did\"", "Pros": "Able to work full time", "Cons": "At times could be very stressful"}, "7": {"Date": " Aug 13, 2016", "Summary": "\"Needs better management\"", "Pros": "Discount on food, good environment when everything was going good, fun environment, if you love working with people this is a good place to start", "Cons": "Managers always seem to bad talk other managers and when to many of them worked together it was like war, even some customers complained"}, "8": {"Date": " Aug 13, 2016", "Summary": "\"Shift Manager\"", "Pros": "Free food for management staff", "Cons": "Cooporate stores are the bestFranchise stores suck"}, "9": {"Date": " Aug 14, 2016", "Summary": "\"It was a good experience.\"", "Pros": "That you can grow in this company, once you put your mind to it, my fellow employees are great and managers too. They treat us good.", "Cons": "It's minimum wages, and they can at least raise it to 10.00 an hour."}}