{"0": {"Date": " Jun 27, 2017", "Summary": "\"McDonalds' exp\"", "Pros": "Good people, nice staff and flexible hours", "Cons": "Not the best time, difficult customers"}, "1": {"Date": " Jun 25, 2017", "Summary": "\"Shift Lead\"", "Pros": "SOME of the crew are very nice", "Cons": "The Shift Managers that have been there for 20+ years are abusive to other managers and crew members"}, "2": {"Date": " Jun 25, 2017", "Summary": "\"It's an ok company\"", "Pros": "It's a good employment opportunity for high school students", "Cons": "It's very unorganized and management is lazy."}, "3": {"Date": " May 18, 2017", "Summary": "\"Crew person\"", "Pros": "Flexible schedule, great people, bosses that will work with you.", "Cons": "No permanent weekly work schedule"}, "4": {"Date": " May 21, 2017", "Summary": "\"Cashier\"", "Pros": "Sometimes I get to have a cheeseburger if there are too many cheeseburgers. Then I can eat it and be happy that I am not so hungry anymore. That is a good thing", "Cons": "But then there are times when I don't get to have a cheeseburger and that makes me a sad panda for the day and I have to hide my cries so the boss doesn't get mad"}, "5": {"Date": " May 22, 2017", "Summary": "\"Crew Member\"", "Pros": "You get a half off discount. Cool job while in high school or after graduation before college.", "Cons": "It was stressful having to cook so many orders for lots of customer during lunch hours"}, "6": {"Date": " May 22, 2017", "Summary": "\"Good\"", "Pros": "Yummy Food, Nice people to work with", "Cons": "Gross Environment, hours are not easily moveable"}, "7": {"Date": " Jun 2, 2017", "Summary": "\"Pretty good, bad neighborhood\"", "Pros": "Free food - Breaks - Flexible - Friendly management - easy advancement - help with schooling - raises", "Cons": "Broken A.C - Often very rude and abusive customers - often short hours"}, "8": {"Date": " Jun 4, 2017", "Summary": "\"Isn't the best\"", "Pros": "It's bad food but getting to eat fries whenever is great, usually the staff is funny so working isn't so boring", "Cons": "Managers don't put the time aside for employees"}, "9": {"Date": " Jun 4, 2017", "Summary": "\"Good enough\"", "Pros": "- Helps build soft skills- Always need people/always hiring- Hours to grab- More chill work environment- Free food if we make food cost- Bonus if we make food cost as a manager- Crew outings", "Cons": "- Customers are rude- A lot of people call off so you have to pick up the slack- Pay isn't enough- Always short staffed"}}