{"0": {"Date": " Mar 17, 2016", "Summary": "\".\"", "Pros": "The employees are really great to be around. There are some positions that everyone can get into doing. There are a few costumers who will come everyday and you will know them by name.", "Cons": "The costumers can be rude at times. Some will even call and say you were rude to them but wasn't rude at all."}, "1": {"Date": " Mar 17, 2016", "Summary": "\"Good overall, each dept different\"", "Pros": "The company overall is great. A lot of opportunities if you are willing to relocate.Unusual benefits like short Fridays and sabbaticalPeopleFree pop", "Cons": "Leadership is clueless to how it is to do the job from day to dayWorkload too highToo much uncompensated overtimeShort Staffed"}, "2": {"Date": " Mar 18, 2016", "Summary": "\"Employees are Great, Customers are not\"", "Pros": "Depends on the location, our location happened to be recently renovated. Most of the employees were teenagers or young adults which fit my own age bracket. Kind people.", "Cons": "Many customers of Mcdonald's are rude or crazy, etc. Interesting experiences while dealing with them. You can't let it get to you."}, "3": {"Date": " Mar 31, 2016", "Summary": "\"Not Bad\"", "Pros": "Good starting job to gain early experience, decent opportunities for advancement.", "Cons": "Too much/too little regulation from management."}, "4": {"Date": " Apr 1, 2016", "Summary": "\"They made me edit out my profanity lol for this review\"", "Pros": "It was my first job as a teen (15). I'd say it was a perfect choice for early teens or in high school. It teaches worth ethic, and inforces responsibility to follow all rules or else you will receive a penalty (or get fired). Strict on dress code and arriving on time. And best of all ---(*best of all for a young'uns... not anyone else wanting an good job*)--- working at McDonalds will teach you that your ONLY option is to follow the rules. And that life is not a free-for-all/game.You gain a new and profound respect for your parents (or with whom ever supported you), and you view money COMPLETELY different.Working at a strict, highly stressful job place, all day sweating your a$$off and shaking from the post-adrenaline lunch rush -which is ALWAYS full of hollering, confusion, blaming, and being aggravated--- allows some new to the work field gain insight that \"Wow....I complained about taking out the trash and I THOUHT CLEANING MY ROOM was hard?!?! .....pssssh. I definitely prefer that, that spending the past hour and a half in another lunch rush and getting a big mac thrown in your face. All that only to make ....LESS THAN $9?!?!?! WTF.\"That makes me wish McDonalds would hire my daughter. But she is only 9. She thinks she knows \"hard work.\" Psh 15 minutes in the garden is nothing.Lol", "Cons": "Pay sucksToo strick (no tattoos? Really? This is McDonalds...not a law firm!)Pay is horribleAlways under employed or short staffedHigh turn over rateAgain, due to suckage in payNo benefitsAnnnnnd pay is bad bad.Gave it a 3 cuz its a good firat job and teaches lessons.No way in hell I'd work there again."}, "5": {"Date": " Apr 1, 2016", "Summary": "\"Ehhhhh..\"", "Pros": "Build Experience, flexible, employee meals complementary", "Cons": "Poor management, rude co workers, little hours given"}, "6": {"Date": " Mar 16, 2016", "Summary": "\"its a job\"", "Pros": "flexible good starting job for younger kids", "Cons": "some days you get treated like crap"}, "7": {"Date": " Mar 16, 2016", "Summary": "\"Not all the same\"", "Pros": "It is what you make of it. *Plenty* of opportunity to make a great living if you apply yourself. Lots of development opportunities with world class training once you enter management. The large majority of restaurants are franchisee so results may very. Research the quality of the operator you consider.", "Cons": "Locations with 24hr operations add extra stress."}, "8": {"Date": " Mar 30, 2016", "Summary": "\"Dysfunctional\"", "Pros": "Very Flexible scheduleThe atmosphere is team orientedYou can learn several skills", "Cons": "Very dysfunctional managementSome shift managers but others are awful"}, "9": {"Date": " Mar 30, 2016", "Summary": "\"Crew Member\"", "Pros": "I received a good amount of hours when I needed them for a first job and they were pretty flexible with my schedule especially when it came to school obligations.", "Cons": "The environment is really fast paced, it can get very easy to eat far too much fast food. Managers were really mean."}}