{"0": {"Date": " Feb 7, 2017", "Summary": "\"Very Unstable.\"", "Pros": "Lots of consistent work, good flexible schedule policy and work life balance.", "Cons": "It's all white men in charge of this organization with one woman. They lack diversity in their leadership team big time. Over the last few years there have been a number of lay offs and there is a big lack of certainty about jobs. It's extremely difficult to trust leadership when you feel like no one cares about you as a person - and even if you are doing a ton of work, i.e. lots of late night, and weekend work, being a high performer doesn't mean you are exempt from potentially getting let go. And if you don't get let go, you have to worry every day about when the other shoe is going to drop. They literally do not care at all about their employees. They spent a lot of time telling us about the new building in the city, only to let us now all worry of any of us will end up making it there. It kind of feels like a sham. The compensation is not as good as good as you can get other places and there seems to be a huge disparity over how they treat men and women. There are almost no women in leadership in IT at all. And there are almost no women in the infrastructure team - literally I can think of one and that is it. It just seems kind of unbalanced."}, "1": {"Date": " Feb 9, 2017", "Summary": "\"Cashier\"", "Pros": "Great fast pace environment that gives you great teamwork skills and time management skills", "Cons": "low pay, management sometimes not consistent"}, "2": {"Date": " Feb 9, 2017", "Summary": "\"Crew Member\"", "Pros": "Free one meal. Great regular customers.", "Cons": "No health insurance. Bad management."}, "3": {"Date": " Feb 9, 2017", "Summary": "\"Okay\"", "Pros": "Flexible schedule, quality varied by coworkers.", "Cons": "Bad pay, quality varied by coworkers."}, "4": {"Date": " Feb 9, 2017", "Summary": "\"Crew Trainer\"", "Pros": "Awesome employees, easy to pick up extra shifts, good for a first job, easy room to grow.", "Cons": "Management SUCKED, little pay for the amount of work done. Not somewhere to stay for long term."}, "5": {"Date": " Jan 25, 2017", "Summary": "\"It's good place so far but I want to elevate\"", "Pros": "It's a opportunity to talk to customers", "Cons": "It's not flexible as it is on the application"}, "6": {"Date": " Feb 9, 2017", "Summary": "\"Ehh\"", "Pros": "Fun and fast paced", "Cons": "RUDE CUSTOMERS DURING HOLIDAYS"}, "7": {"Date": " Feb 9, 2017", "Summary": "\"cashier\"", "Pros": "I was able to eat for free", "Cons": "The pay was terrible and the hours were long"}, "8": {"Date": " Jan 25, 2017", "Summary": "\"Great Job if you are a High School student. I think i will work till i graduate from High School\"", "Pros": "1. 50% off of everything2. Flexible Hours3. Scholarship if you decide to work for them in College4. Really good Job if you are a foodieThats all i have for the Pros of this Job Its a great Job for a high schooler", "Cons": "1. Sometimes the manager tells you to leave early because of a slow day2. The customers are rude sometimes.3."}, "9": {"Date": " Jan 26, 2017", "Summary": "\"Great company!\"", "Pros": "work/life balance, benefits, compensation and culture", "Cons": "company is going through an identity crisis in some markets, causing turmoil for the employees."}}