{"0": {"Date": " Feb 27, 2018", "Summary": "\"Crew Worker\"", "Pros": "customers and co-workers were mostly friendly. If you do it long enough you'll become quick at the cash register or the grill and you'll really feel like youve mastered something", "Cons": "management was hit or miss. I had some that were very helpful and wanted to educate me about learning skills to apply in the workplace... while some were kind of rude and innapropriate"}, "1": {"Date": " Feb 27, 2018", "Summary": "\"asst manager\"", "Pros": "Flexibilty Of Hours. Friendly People", "Cons": "Pay. They hire kids as young as 14. Young kids are good workers, but are kids just the same and lose focus and wine. Should not schedule 14 year olds for 8 hours."}, "2": {"Date": " Feb 27, 2018", "Summary": "\"ok\"", "Pros": "If you like the people you work with, it can be fun. Fast paced.", "Cons": "Rude customers from time to time. Frustrating at times when the kitchen slows down a bit. Depending on the manager, it can be complete hell."}, "3": {"Date": " Feb 28, 2018", "Summary": "\"Not for everyone\"", "Pros": "You get free food and ice cream", "Cons": "No respect for schedule, no proper training, lack of respect"}, "4": {"Date": " Feb 28, 2018", "Summary": "\"Good Place To Work\"", "Pros": "Friendly, fast, eggicient, eggcelent, nice", "Cons": "Fries, burgers, stuff, cups, coffee"}, "5": {"Date": " Feb 28, 2018", "Summary": "\"Ehhhh\"", "Pros": "You get to eat all the food", "Cons": "Fast paced, rude customers, horrible pay"}, "6": {"Date": " Feb 12, 2018", "Summary": "\"Manager\"", "Pros": "Good pay work life balance", "Cons": "Being available all the time"}, "7": {"Date": " Feb 12, 2018", "Summary": "\"It was a great job they worked with your hrs\"", "Pros": "Its a great place to be they have the best food in the world", "Cons": "Its a very fast paced enviorment and things could easily get you upset quick"}, "8": {"Date": " Mar 21, 2018", "Summary": "\"Don't work here\"", "Pros": "Free milkshakes and drinks, discount on food, and sometimes nice customers", "Cons": "Bad work hours, to many customers, manager doesn't fix problems, food is unsafe, bad pay"}, "9": {"Date": " Feb 27, 2018", "Summary": "\"An average work place\"", "Pros": "You can get hired easily and is a fairly repetitive task", "Cons": "It is a very repetitive task, unkind managers"}}