{"0": {"Date": " Jan 19, 2017", "Summary": "\"Shift Manager\"", "Pros": "Love working with the people, and the fast pace environment", "Cons": "Everyone putting all the work on you."}, "1": {"Date": " Jan 19, 2017", "Summary": "\"Everyday is new\"", "Pros": "No two days are ever the same, there is always a new challenge.", "Cons": "The stigma assumed by the general public of a meaningless job."}, "2": {"Date": " Jan 19, 2017", "Summary": "\"Good\"", "Pros": "People are nice, friendly. It feels like a family to me especially to a foreigner as me.", "Cons": "Working environment is not ideal, and sometimes you got bad customers who really spoiled your mood"}, "3": {"Date": " Jan 19, 2017", "Summary": "\"Its okay\"", "Pros": "Okay Benefits and good experience", "Cons": "The job is very hands on and is very fast paced. Pay could be better"}, "4": {"Date": " Jan 19, 2017", "Summary": "\"Maintence Salary\"", "Pros": "The ones that get a lot of consistent business are often ran properly by caring staff and if the building is of decent size then it tends to run very smoothly and be quite a pleasant working environment.", "Cons": "Other company hiring managers usually don't consider working for McDonald's as actual work and thus will completely look right over that segment of your applications and resumes."}, "5": {"Date": " Jan 20, 2017", "Summary": "\"Good place to work; but kind of stressful\"", "Pros": "Who wouldn't want to work for a company like McDonald's? Great place to learn ins and outs of big business.", "Cons": "Always pushed to produce quickly, sometimes with unrealistic deadlines. As the company has been reorganizing, they've taken away some of the great benefits they used to offer."}, "6": {"Date": " Jan 18, 2017", "Summary": "\"Crew member\"", "Pros": "I worked there as a non-citizen of USA. But ı had a great teammates. They were always in good behavior to me.", "Cons": "First of all, language was the main problem. Then sometimes the work hours could be challenging. I got used to it."}, "7": {"Date": " Jan 18, 2017", "Summary": "\"vdsfswaef\"", "Pros": "so much fun love it.", "Cons": "crappy fries way too greasy."}, "8": {"Date": " Jan 19, 2017", "Summary": "\"food handler and cashier\"", "Pros": "Great communication. Fast learner. Great observer.Im currently seeking a career for my life.", "Cons": "none other then the simple fact that I'm currently homeless and have no car which tend to make it hard time to time for me to get around from point a to b."}, "9": {"Date": " Feb 2, 2017", "Summary": "\"OK\"", "Pros": "I love the flexibility of there shifts and that they hired me pregnant.", "Cons": "Favoritism from manages to employees."}}