{"0": {"Date": " May 13, 2017", "Summary": "\"Cook\"", "Pros": "I really liked that it is a big coorporation and that it has a lot of resources to grow from.", "Cons": "They pay is low and I dound myself strggling financially. Also it is not fulfilling to work for this company."}, "1": {"Date": " Apr 28, 2017", "Summary": "\"Manager\"", "Pros": "Flexible AvalabilityGreat Co-WorkersGood working environment", "Cons": "Rude CustomersHectic Rushes during busy hours"}, "2": {"Date": " Apr 28, 2017", "Summary": "\"Nice to customers, rude to employees\"", "Pros": "Pay above minimum wageFriendly to customers", "Cons": "Many managers seem to struggle under pressure. They can keep calm by being nice to customers but when customers are not near and they are busy, they tend to be rude to employees. These make me feel like I do not have potential. They mainly tend to not encourage me to do better."}, "3": {"Date": " Apr 29, 2017", "Summary": "\"Cashier\"", "Pros": "Good benefits, coworkers were nice.", "Cons": "Rude customers every now and again."}, "4": {"Date": " Jun 3, 2017", "Summary": "\"Not a good place to work\"", "Pros": "I did meet some cool people there.", "Cons": "Highly stressful, be prepared to not have time or money for a life outside of work."}, "5": {"Date": " May 13, 2017", "Summary": "\"eh\"", "Pros": "easy scheduling, thats about it.", "Cons": "over worked dont explain much, bad training. doesnt value employees"}, "6": {"Date": " May 13, 2017", "Summary": "\"There are much better places to work.\"", "Pros": "*Great co-workers, they are some truly great people*Awesome regular customers, every day we see them", "Cons": "*No Benefits*Lack of pay, minimum wage (sure managers make more than crew, but at my store, we have managers who are making less than 70% of the crew)*Franchise stores are owned by actual owners and not corporate, the owners can basically set their own rules, pay, and treat people however they please.*No respect from upper management*A bad stigma around McDonald's and its crew (which is mostly not true, except for a few bad eggs) that customers use to the extreme*CUSTOMERS. While some are pleasant and awesome, some are downright awful.*Drugs, I have had people passed out in my restroom floors, I have found needles in the restroom trash cans, and I have found a dead body in a car sitting in the parking lot."}, "7": {"Date": " May 14, 2017", "Summary": "\"Nice people\"", "Pros": "Easy interview nice employees", "Cons": "Horrible pay not sure how staff are maintains there bills"}, "8": {"Date": " Apr 29, 2017", "Summary": "\"Cook\"", "Pros": "The employer are really nice", "Cons": "The shift hours are all over"}, "9": {"Date": " May 12, 2017", "Summary": "\"Okay job\"", "Pros": "... made enough money to buy things I wanted but didn't want to ask parents for", "Cons": "...not many hours, decent management"}}