{"0": {"Date": " Dec 18, 2015", "Summary": "\"Great First Job\"", "Pros": "Great co-workers. Wonderful customer interactions.", "Cons": "Weekend work. Late night and early morning work"}, "1": {"Date": " Jan 22, 2016", "Summary": "\"Cashier\"", "Pros": "There are no pros to this job.", "Cons": "Terrible leadership, crew interaction and etc."}, "2": {"Date": " Jan 22, 2016", "Summary": "\"McDonald's\"", "Pros": "Flexible scheduleOpportunities to move up in the company", "Cons": "Poor managmentAbusive environmentUnprofessional behaviorRude coworkers"}, "3": {"Date": " Jan 22, 2016", "Summary": "\"Hiring Manager\"", "Pros": "NONE , they are a horrible company to work for .", "Cons": "EVERYTHING. you give them an inch they take a mile"}, "4": {"Date": " Dec 18, 2015", "Summary": "\"I know everything at McDonalds but I'm a little slow at mccafes and iced coffee\"", "Pros": "Very high advancement and good management raises are good but I think it should start out at 15 cents instead of 10", "Cons": "Nothing really just sometimes bad employees to work with and sometimes employees bring their home life to their work life"}, "5": {"Date": " Jan 1, 2016", "Summary": "\"Iffy\"", "Pros": "Time went by fast and the work environment was always exciting and unpredictable", "Cons": "Rude Customers and my checks wasn't all that, because I was in highschool at the time"}, "6": {"Date": " Jan 1, 2016", "Summary": "\"Okay\"", "Pros": "Working here gives you experience under pressure and can give you experience dealing with a manager or being one.", "Cons": "Downsides would be having to deal with customers that are rude or when it is super busy and things can get stressful."}, "7": {"Date": " Dec 17, 2015", "Summary": "\"Crew trainer\"", "Pros": "Good hours, friendly staff, clean and safe environment", "Cons": "No cons to speak of"}, "8": {"Date": " Jan 21, 2016", "Summary": "\"Not for professionals\"", "Pros": "The only reason I could ever think someone would actually want to work for this company is when there are no other options. They are always hiring, so if you're down on your luck you can use them as a last resort. With no experience, you know you qualify to work there!", "Cons": "Very cliquish work environment. Inadequate and improper training methods. Managers promote irresponsibility and poor work ethic, while taking advantage of those who have both already."}, "9": {"Date": " Jan 21, 2016", "Summary": "\"Train Your Employees\"", "Pros": "I Always had a check.", "Cons": "Did not train employees correctly."}}