{"0": {"Date": " Feb 17, 2016", "Summary": "\"Fun environment\"", "Pros": "It was really fun working there, because I was in a student-dominated area.", "Cons": "Other locations like downtown are pretty scary. Scheduling is hard too, but expected."}, "1": {"Date": " Feb 17, 2016", "Summary": "\"Sr. IT Consultant\"", "Pros": "Good working environment and employees are nice and friendly ...", "Cons": "sometimes working pace may be slowly, a typical big corporation's style..."}, "2": {"Date": " Feb 29, 2016", "Summary": "\"Lots of cleaning\"", "Pros": "Easy job with easy hours.", "Cons": "Had to clean all the time. Very repetitive."}, "3": {"Date": " Mar 2, 2016", "Summary": "\"ok company\"", "Pros": "Great co-workers. Flexable scheduling. Days off request usually honored", "Cons": "Dont get treated fairly. No repect from management"}, "4": {"Date": " Mar 2, 2016", "Summary": "\"great for starting your career\"", "Pros": "no experience need to be hiredfriendly co workers", "Cons": "sometime its too busy but don't have enough people to handle it"}, "5": {"Date": " Mar 2, 2016", "Summary": "\"Cashier\"", "Pros": "Able to work after school, see my friends ordering food", "Cons": "Smelled like fries all day"}, "6": {"Date": " Mar 2, 2016", "Summary": "\"Not too bad but gets tiresome\"", "Pros": "Good for a first job, flexible hours, mostly good co workers.", "Cons": "Sometimes unorganized, not the most fun, lots of rude customers"}, "7": {"Date": " Mar 3, 2016", "Summary": "\"McDonald's\"", "Pros": "The hours can be very flexible.", "Cons": "The pay is relatively low and it is hard to get a raise."}, "8": {"Date": " Mar 3, 2016", "Summary": "\"what you would expect\"", "Pros": "You get to eat the food, there is little responsibility. This is also a downside, but it allowed work to be relatively stress free, even if it was boring.", "Cons": "Working at any fast food place will have its downsides, McDonalds is no different. Customers were often rude, and there was little opportunity for professional growth."}, "9": {"Date": " Mar 2, 2016", "Summary": "\"Manages store\"", "Pros": "Good pay, flexible schedule, nice people", "Cons": "Yelling, unorganized, rude customers, dirty"}}