{"0": {"Date": " Aug 6, 2016", "Summary": "\"Shift Manager\"", "Pros": "working with a variety of people", "Cons": "Pay can be pretty low, high turn over with employees"}, "1": {"Date": " Jul 22, 2016", "Summary": "\"crew\"", "Pros": "it fun and you'll make new friends", "Cons": "to many rude customers manager stuck up"}, "2": {"Date": " Aug 7, 2016", "Summary": "\"One bad manager can make or break you\"", "Pros": "Most coworkers were kind, friendly, and helpful, including most managers.", "Cons": "Bad management ruined my experience, one in particular was rude and condescending, practically verbally abusive to most staff."}, "3": {"Date": " Jul 22, 2016", "Summary": "\"Good\"", "Pros": "Its a great team to work on and they do feed you free meals under a certain cost", "Cons": "It gets very busy and the mangement is not all that great. They tried to inforce hours that werent even my hours."}, "4": {"Date": " Jul 22, 2016", "Summary": "\"A job everyone needs to have\"", "Pros": "Working at McDonald's is often looked down upon and treated as a joke, a joke until you see how many times they come in to eat", "Cons": "The hours are kind of bad u either work 9-5 or 4pm-1am some nights 2 just cleaning the store and preparing for the morning shift"}, "5": {"Date": " Aug 27, 2016", "Summary": "\"Cashier/order taker\"", "Pros": "Free food, nice customers, new menu items", "Cons": "Some mangers are nice and others are not."}, "6": {"Date": " Aug 6, 2016", "Summary": "\"It wasnt worth it\"", "Pros": "free/or discounted food, some of the people you meet working there.", "Cons": "hours are not consistent, the hourly wage is low, work life can be frustrating...Hungry and angry customers..The only thing the managers are focused on is keeping the hourly labor below $20 an hour. No considerations made for their human employees not even water breaks"}, "7": {"Date": " Jul 21, 2016", "Summary": "\"Alright job\"", "Pros": "Overall, the job was fairly simple.Good pay, started at 8.25, 20 cents over minimum wage", "Cons": "Rude customersLower management was not understanding"}, "8": {"Date": " Jul 21, 2016", "Summary": "\"Fry Cook\"", "Pros": "McDonalds staff is a group of driven and enthusiastic individuals who come in every day passionate and loving what they do", "Cons": "Sometimes can be too fast paced. Shifts can be arduous and help may be needed at last minute needs as demanded."}, "9": {"Date": " Aug 4, 2016", "Summary": "\"Decent\"", "Pros": "They adapt to your schedule and give you good hours.", "Cons": "Don't care about employees enough."}}