{"0": {"Date": " Apr 24, 2016", "Summary": "\"Cook\"", "Pros": "Good food some nice people they work u like a dog and pay nothing some manangers are nice but most are on a ego trip like its a fastfood place not a 5 star restaraunt", "Cons": "Cranky people crappy service people always called in late or just never showed up not a great place to work at all"}, "1": {"Date": " Apr 24, 2016", "Summary": "\"Other employees , it seems that they were there for the money\"", "Pros": "Great facility you feel like family.", "Cons": "Lack of communication between uppermanagement and the centers"}, "2": {"Date": " Mar 19, 2016", "Summary": "\"Mcdonalds Job\"", "Pros": "Lots of learning, steady job", "Cons": "none, none, none, none, none"}, "3": {"Date": " Apr 2, 2016", "Summary": "\"Not enough training\"", "Pros": "They give you a crew meal for each shift. It's fast, so the shifts go by quickly.", "Cons": "Shifts are often short. They will not offer full-time hours to many crew members if any. Most feedback from managers is negative. It's somewhat stressful."}, "4": {"Date": " Apr 2, 2016", "Summary": "\"Time There\"", "Pros": "Expands the field in working with the immediate public, helps to open doors to other opportunities.", "Cons": "My time shared there was interesting, for when I first started it was quite wonderful working with the current manager but as time passed and hands were changed the current staff became more stressed and lax."}, "5": {"Date": " Apr 23, 2016", "Summary": "\"so gross\"", "Pros": "the other employees were nice", "Cons": "the kitchen is so gross, they had cockroaches and ants under the stove."}, "6": {"Date": " Apr 23, 2016", "Summary": "\"They have no leadership it is not a career job it is a stepping stone I learned that the hard way.\"", "Pros": "You can choose your work schedule. Also learn good people skills and how to deal with difficult customers. And customer service.", "Cons": "A lot of young people work there an it's there first ever job so they are clueless to the job world. Everybody wants to be the boss an no one want to take advice."}, "7": {"Date": " Mar 17, 2016", "Summary": "\"mcds\"", "Pros": "Everyone is super nice. It's a fun and exciting environment.", "Cons": "Pay is minimum wage and sometime you have bad days with customers ."}, "8": {"Date": " Apr 1, 2016", "Summary": "\"Associate\"", "Pros": "Pays good, can get more hours maybe", "Cons": "Sucked badly no room for growth"}, "9": {"Date": " Apr 1, 2016", "Summary": "\"Cashier\"", "Pros": "Most of the employees are nice", "Cons": "Most of the managers don't respect you like they should"}}