{"0": {"Date": " Feb 3, 2017", "Summary": "\"Ok\"", "Pros": "Money food friends love money", "Cons": "Crazy people in the world"}, "1": {"Date": " Jan 13, 2017", "Summary": "\"The company\"", "Pros": "Schedule is usually pretty flexible and I get enough hours. The usual customers make it worth being there.", "Cons": "Doesn't pay enough and doesn't evaluate all employees as well at they should. I have been working for the company for almost 4 years now and have been a manager for around 2 1/2 years. I make less than some crew members and some managers who have been employees / managers who haven't been there/ managers as long as I have."}, "2": {"Date": " Jan 13, 2017", "Summary": "\"Cashier\"", "Pros": "Helped teach me responsibility regardless of the lack of training and awful management", "Cons": "Crazy busyMinimum wageHigh turnoverLack of trainingUnderstaffed"}, "3": {"Date": " Jan 14, 2017", "Summary": "\"Crew Worker\"", "Pros": "There are some good days, some pretty decent managers but you have to watch your time", "Cons": "They play with your hours and time. Get paid every other week. Managers do not fit the manger roll"}, "4": {"Date": " Jan 14, 2017", "Summary": "\"McDonald's\"", "Pros": "Flexible schedule, food discounts, great GM,", "Cons": "Low pay, small raises, poor benefits."}, "5": {"Date": " Dec 29, 2016", "Summary": "\"Cashier\"", "Pros": "discounted meals, good place to help start career", "Cons": "fast food industry, many menial tasks"}, "6": {"Date": " Dec 29, 2016", "Summary": "\"Floor Super\"", "Pros": "free food and a lot of other benefits", "Cons": "schedule is constantly changing. work environment is stressful"}, "7": {"Date": " Jan 12, 2017", "Summary": "\"Cashier\"", "Pros": "Hours, nice environment, friendly coworkers", "Cons": "Hours, only offered part time"}, "8": {"Date": " Jan 13, 2017", "Summary": "\"McDonald's Crew, Part-time\"", "Pros": "Low barrier for entryMeet lots of people", "Cons": "Minimum wageHigh turnoverVery few benefits"}, "9": {"Date": " Feb 2, 2017", "Summary": "\"Restaurant Manager\"", "Pros": "I got some experience full time managing", "Cons": "Their training program isn't all that they make it out to be. It's actually really bad and they leave you to figure a lot of things out on your own. They never give you time to actually complete their online training class and then hold it against you when you ask for a raise or promotion.They don't pay well at all in comparison to industry standard and certainly don't pay managers well for the amount of work we had to do"}}