{"0": {"Date": " Mar 14, 2017", "Summary": "\"Some good, some bad\"", "Pros": "Fair hoursDecent pay for what it is", "Cons": "Low team moralePay isn't good for people who aren't single"}, "1": {"Date": " Mar 14, 2017", "Summary": "\"Boring\"", "Pros": "It pays the bills and stuff", "Cons": "Managers are rude, customers are bad."}, "2": {"Date": " Mar 15, 2017", "Summary": "\"Crew Member\"", "Pros": "Work with schedule and make adjustments accordingly", "Cons": "Limited growth opportunities for the average worker"}, "3": {"Date": " Feb 27, 2017", "Summary": "\"Crew member\"", "Pros": "Productive and fast moving never just sitting around.", "Cons": "Although it can be very fast moving and productive there are times when you will work all day without even a 10 minute break. When people do go on break certain foods should be free because of how much energy was burned. Also new employees are treated different by managers and other employees which is unprofessional."}, "4": {"Date": " Feb 27, 2017", "Summary": "\"Great place\"", "Pros": "Great environment and fun people", "Cons": "Managers weren't really caring to workers"}, "5": {"Date": " Feb 28, 2017", "Summary": "\"Director\"", "Pros": "Great diverse workforce and very flexible with work/life balance.", "Cons": "Moving away from tenured track employees."}, "6": {"Date": " Feb 28, 2017", "Summary": "\"Pleasant\"", "Pros": "Every criteria was essentially self explanatory and since everyone is pretty much relying on one another it's a pretty easy going environment. And you feel somewhat important.", "Cons": "Sometimes you don't always get the nicest customers, it's great practice for your patience. They're also very cheap, for lunch we had only a $3 limit."}, "7": {"Date": " Mar 13, 2017", "Summary": "\"Decent work, tough managers\"", "Pros": "time passed quickly and the work was easy if you knew what you were doing", "Cons": "managers would go bananas if you messed up even the smallest thing"}, "8": {"Date": " Mar 13, 2017", "Summary": "\"Location and Who you Work with matters.\"", "Pros": "If you have a good team and love your co-workers it isn't so bad.", "Cons": "rude customers thinking you are dumb cause you work at McDonald's."}, "9": {"Date": " Mar 13, 2017", "Summary": "\"Managers\"", "Pros": "A lot of hours", "Cons": "Managers were rude and always in a bad mood"}}