{"0": {"Date": " Aug 10, 2016", "Summary": "\"boo\"", "Pros": "It is a job. it has food. I cook food. Nice management and decent hours. At least they don't cook dogs.", "Cons": "Bad customers and grumpy coworkers. The food is not very good. I hate this job."}, "1": {"Date": " Aug 10, 2016", "Summary": "\"OTP2\"", "Pros": "Getting paid, Nothing else at all", "Cons": "Everything, Manager people smell of the awful food"}, "2": {"Date": " Jul 20, 2016", "Summary": "\"Cashier\"", "Pros": "Very nice place to work, I found good friends a long the way and they are still my friends and I like them very much", "Cons": "Dont like the food, poor salary the working hours are hard and its tugh to get hom at night when you are tierd from the shift"}, "3": {"Date": " Jul 21, 2016", "Summary": "\"Eh\"", "Pros": "Get to interact with others and are part of a team", "Cons": "Very slow at times and can get very boring"}, "4": {"Date": " Jul 5, 2016", "Summary": "\"Laid back\"", "Pros": "The management was great, let me take off whenever and gave me as many hours as I needed or wanted.", "Cons": "stressful and exhausting. The placed needed a new air conditioner very badly."}, "5": {"Date": " Jul 6, 2016", "Summary": "\"Great opportunities\"", "Pros": "Flexible schedule, structure, support, freedom to run as your own business, growth opportunities, tuition assistance, ESL, online high school diploma", "Cons": "Work life balance, must be available 24/7"}, "6": {"Date": " Jul 19, 2016", "Summary": "\"Anonymous Review\"", "Pros": "Crew Members were great, and the atmosphere was vibrant. Everyone was willing to help each other out. It was an ok first job.", "Cons": "Management was sometimes not efficient in helping their worker. There was sometimes avoidable drama during working hours."}, "7": {"Date": " Jul 19, 2016", "Summary": "\"cashier\"", "Pros": "good about working flexable hours", "Cons": "not enough increase in salaries"}, "8": {"Date": " Jul 20, 2016", "Summary": "\"The\"", "Pros": "The Pay was okay. Managers were okay. 50% meals. The customers were nice. I was. Cashier and wired at the window", "Cons": "The managers were mean and the food is so unhealthy and the drinks are unhealthy low pay. Work environment okay"}, "9": {"Date": " Jul 20, 2016", "Summary": "\"Cook\"", "Pros": "Good work environment, good location", "Cons": "No free food,small hats, uniform"}}