{"0": {"Date": " Sep 19, 2017", "Summary": "\"Cashier\"", "Pros": "Meeting new people and getting to work with different kinds of customers", "Cons": "When it's your time to leave work some jobs ask you to stay over 15 minutes"}, "1": {"Date": " Sep 19, 2017", "Summary": "\"McDonald's\"", "Pros": "Works around schedule and meets fun people", "Cons": "A lot of disrespect toward employees"}, "2": {"Date": " Sep 20, 2017", "Summary": "\"It's Great\"", "Pros": "The best thing about working here is being able to work at the cash register and being able to talk to the customers.", "Cons": "Some of the bad things about this job is when you have a rude customer because some times they can be so nasty but you HAVE To keep your composer because the customer is always right."}, "3": {"Date": " Sep 20, 2017", "Summary": "\"Crew\"", "Pros": "flexible hours of working allowed", "Cons": "Unfriendly staff members and management"}, "4": {"Date": " Oct 3, 2017", "Summary": "\"McDs\"", "Pros": "Loved working with the people. The incentives make going to work fun.", "Cons": "Short staffed. Rude customers. It's fast food so there's a high turn over rate."}, "5": {"Date": " Oct 3, 2017", "Summary": "\"Ok place to work\"", "Pros": "You like to work this is the place for you", "Cons": "No weekends off and you have to wear slip grip shoes"}, "6": {"Date": " Oct 3, 2017", "Summary": "\"What's expected in food service.\"", "Pros": "Meeting different people. Fun times with coworkers.", "Cons": "Sometimes the managers can be rude. High turnover rate led to long hours."}, "7": {"Date": " Oct 3, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Food when ever you want", "Cons": "I gained some weight but not too much"}, "8": {"Date": " Oct 3, 2017", "Summary": "\"No room for growth\"", "Pros": "Work is simple most people there are friendly.", "Cons": "I was a diligent and loyal employee for 2 years and kept inquiring about becoming a crew trainer and kept getting the run around."}, "9": {"Date": " Oct 3, 2017", "Summary": "\"experience\"", "Pros": "Some of the people were ok to work with", "Cons": "most people had attitudes and i didn't get trained"}}