{"0": {"Date": " Mar 15, 2017", "Summary": "\"Shift manager\"", "Pros": "I have​enjoyed working there but I want to further my management experience", "Cons": "You just half to come in with a positive attitude and smile"}, "1": {"Date": " Mar 16, 2017", "Summary": "\"Not so bad, but not for those short on patience\"", "Pros": "Ok first job to learn the basics of customer service, great career opportunities if that's your interest", "Cons": "Upper management doesn't care about lower-level staff. Customers are also incredibly disrespectful to fast food employees in genearl"}, "2": {"Date": " Mar 16, 2017", "Summary": "\"Okay\"", "Pros": "Flexible with hours, easy to take off days, teaches work ethic", "Cons": "Awful coworkers most of time, mundane work"}, "3": {"Date": " Mar 17, 2017", "Summary": "\"Terriffic\"", "Pros": "Good food good food good food", "Cons": "Slippery floors pay could be better"}, "4": {"Date": " Mar 1, 2017", "Summary": "\"Working at Mcdonalds isn't bad\"", "Pros": "Flexibility is good, very understanding of schedule", "Cons": "Food isn't that great, managers are handsy"}, "5": {"Date": " Mar 1, 2017", "Summary": "\"Good company to work for\"", "Pros": "Great coworkers to work with and family environment.", "Cons": "Can be long hours required on holidays."}, "6": {"Date": " Apr 7, 2017", "Summary": "\"Absolutely Not\"", "Pros": "Good pay, will help with college (with stipulations), fast-paced.", "Cons": "Absolutely never again in a million years. The managers did anything but manage, up to and including playing with their phone the whole time they were there or not paying their employees overtime to make their own paychecks better. Ridiculous demands of a disabled person and 17 year old high school student (at the time) such as \"we can't send you home whenever you have these...whatever they are\" (never asked to leave, only to take five minutes to calm down and openly mocking me during service hours. I was sexually harassed by two coworkers and eventually assaulted by one. As a minor, curfew was 10pm; I was consistently told (not asked) to stay until 11 pm for menial tasks like dishwashing. I once had to work a 16 hour shift because coworkers didn't come in and only got a 10 minute break about 12 hours in. 0/10, would never, ever work there again."}, "7": {"Date": " Mar 1, 2017", "Summary": "\"Cook\"", "Pros": "Great experience working at this restaurant", "Cons": "Not enough other staff members"}, "8": {"Date": " Mar 1, 2017", "Summary": "\"Easy job long hours\"", "Pros": "Flexibility. You can a find a job in any location and you get to meet all type of people. You learn something each day.", "Cons": "Long hours for not much pay. Sometimes undervalued as employee. Having to tell adults how to behave as adults. Dealing with rude people in a daily."}, "9": {"Date": " Mar 1, 2017", "Summary": "\"Great Starter Job\"", "Pros": "Great work-family atmosphere, Great job for students because of the flexibility they provide, easily move up the chain. Fun but Serious job", "Cons": "pay raises are small between 10 and 45 cents every 4ish months. I ended up in a store that had a great set of employees then another store lost half the employees in a month and stole employees from our store daily. Over a one year span we lost a lot of our employees because they wouldn't shut down an old and failing store. They also lost me. I LOVED MY JOB! But then the Truax store ruined everything."}}