{"0": {"Date": " Aug 20, 2016", "Summary": "\"Best experience I could have hoped for...\"", "Pros": "Great, friendly people to work with/for.Hard work builds a lot of experience.", "Cons": "Nothing bad to say about the company itself."}, "1": {"Date": " Sep 25, 2016", "Summary": "\"Zone Manager\"", "Pros": "Very flexible with hours, good starting job for a teenager", "Cons": "Customers are not always the nicest, AC sucks"}, "2": {"Date": " Sep 26, 2016", "Summary": "\"Manager\"", "Pros": "Worked with different people and got to travel some to different places", "Cons": "They didn't pay what they promised"}, "3": {"Date": " Sep 4, 2016", "Summary": "\"bad but goodcfor beginners\"", "Pros": "employee meal, friends, uniform, builds character and passiveness", "Cons": "customers treat you like crap"}, "4": {"Date": " Aug 20, 2016", "Summary": "\"Fun\"", "Pros": "Usually fair paced, mostly nice customers, easy", "Cons": "Customers leave messes and can get impatient and rude when it's busy"}, "5": {"Date": " Aug 20, 2016", "Summary": "\"Ok\"", "Pros": "Great job for someone startingThey can also work with your school schedule which is a +", "Cons": "Management can be biased at times"}, "6": {"Date": " Aug 21, 2016", "Summary": "\"Cashier - Good\"", "Pros": "Perfect par-time job when in college. Manager where very flexible with my sometimes hectic student schedule. For the most part its a fun working environment , friendly co-workers. like any job it sometimes got stress full dealing with costumers.", "Cons": "Some times dealing costumers was a bit of a hassle, nothing major. Ohh and the the smell of fried food kind of lingers on you after you're done working."}, "7": {"Date": " Sep 3, 2016", "Summary": "\"Swing Manager in Training\"", "Pros": "Free meal every work day. The people overall were pretty wonderful. Worked well with a fulltime 12 credit school schedule. Pay is a dollar above the state minimum which was nice incentive to stay working there while in school.", "Cons": "Stressful environment, I was often stuck picking up other peoples slack. Many call-ins, often understaffed, and overworked. Not often a moment to breath."}, "8": {"Date": " Aug 19, 2016", "Summary": "\"pros\"", "Pros": "Good Food, Good Customers and", "Cons": "Rude Co-Workers, more pay and"}, "9": {"Date": " Aug 19, 2016", "Summary": "\"Cashier\"", "Pros": "The job was very flexible with my school schedule. I think that it paid well for the work that we did.", "Cons": "I didn't see anything bad."}}