{"0": {"Date": " Mar 2, 2016", "Summary": "\"sucks\"", "Pros": "great food that you got to eat in between shifts and also after shifts.", "Cons": "low paying horirible boss dirty resteraunt"}, "1": {"Date": " Mar 3, 2016", "Summary": "\"Poor management and horrendous customers. This job should be your last resort.\"", "Pros": "There are NO pros. Don't work here. This is a temporary job for a teenager or a last resort. Of course customers are sometimes rude but McDonalds customers take it to a whole new level. They make me weep for humanity.", "Cons": "Drive thru is always broken in some way. Management is unqualified. Customers are cruel. They don't follow your availability even after you've given it to them verbally as well as written. Definitely not somewhere to work for long."}, "2": {"Date": " Jan 26, 2016", "Summary": "\"cashier\"", "Pros": "good management and reviews every few months", "Cons": "it could get busy and some employees would often call off"}, "3": {"Date": " Feb 9, 2016", "Summary": "\"Loved my job\"", "Pros": "I never had to worry about losing my job because the job is simple and the policies are clear.", "Cons": "A lot of employees and customers just have a predisposed bad attitude towards mcdonalds and assume that the employees are dumb"}, "4": {"Date": " Feb 9, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Free food, people are really nice , feels like second family", "Cons": "Overwork you , to many shifts where I worked past shift, get payed to little"}, "5": {"Date": " Jan 25, 2016", "Summary": "\"manager\"", "Pros": "Give to the customer a great place of service and good experience of food.", "Cons": "Sometimes but rare waiting too much time for food."}, "6": {"Date": " Mar 1, 2016", "Summary": "\"Do not work for Mcd's\"", "Pros": "Free food. That is the only pro I can think of.", "Cons": "Managers do not really back you up. There's not a lot of teamwork. There's no structure or things being coordinated. It is a complete mess."}, "7": {"Date": " Mar 1, 2016", "Summary": "\"Avoid Working Here\"", "Pros": "None what so ever, the pay is bad, the benefits are bad, and the people who run the company are bad.", "Cons": "Everything about this company is so bad, they make 10+ Billion dollars every year and they can even pay their employees a living wage or provide good benefits."}, "8": {"Date": " Mar 1, 2016", "Summary": "\"Made Promises, Never Came Through.\"", "Pros": "Good Shift Managers50% Discount for mealUnderstanding when your need a day off.Flexible schedule.Multiple uniforms provided among hire.", "Cons": "Bad EmployeesUnclean - Plunger was kept in the kitchen of my store - Gray, Maine.BoringWorthless Upper ManagementStore owner who couldn't care less about his employeesWould you like me to go on? I will if so...."}, "9": {"Date": " Mar 1, 2016", "Summary": "\"steer clear if you dont have tough skin !!!!\"", "Pros": "free meal on break", "Cons": "horrible management and racism within the store it was the worst experience of my life"}}