{"0": {"Date": " Jan 3, 2017", "Summary": "\"People Department Manager\"", "Pros": "Free food at all times, Could pick up hours whenever I wanted, even in another store in the companies franchised stores.", "Cons": "Very bad pay for the work performed.Severe lack of training for certain parts of the restaurantExpectation of not having a life outside of work."}, "1": {"Date": " Dec 18, 2016", "Summary": "\"Cashier\"", "Pros": "McDonald's is a great experience workplace. You can build up experience and some side cash for about a year part-time, and find another job to work up the food chain.", "Cons": "The smell. It just gets sickening after a while. Jesus some more ventilation would go a long way."}, "2": {"Date": " Jan 2, 2017", "Summary": "\"McDonalds Admin Review\"", "Pros": "Great benefits/ Chance for advancement depending on the department you work in.", "Cons": "No clear or concise job assignments and no structure for back-up even though policies are in place, tools are available. You can't use a tool for what it is designed for if you don't know what it is designed for."}, "3": {"Date": " Jan 2, 2017", "Summary": "\"Shift manager\"", "Pros": "Good hours and it's good experience if you want to get good experience with customer service", "Cons": "It's busy and some customers are rude and don't understand that you are just trying to do your job.."}, "4": {"Date": " Jan 2, 2017", "Summary": "\"Not returning\"", "Pros": "Flexibility in schedule was much appreciated", "Cons": "The pay was a bit on the lower end."}, "5": {"Date": " Dec 31, 2016", "Summary": "\"Highschool review.\"", "Pros": "Helped pay the bills during high school.", "Cons": "Bad hours for students sometimes, just depended on who made them. and if they cared about your preferences."}, "6": {"Date": " Jan 22, 2017", "Summary": "\"Enid\"", "Pros": "they hire everybody and they come off as nice at first", "Cons": "they put their employees down and then fire them when they dont think they are trying hard enough"}, "7": {"Date": " Dec 16, 2016", "Summary": "\"Like my job\"", "Pros": "Regular incentives , peaceful environment", "Cons": "Too much pressure, Little support from coworkers"}, "8": {"Date": " Dec 30, 2016", "Summary": "\"Nice\"", "Pros": "discounted meals, good work start", "Cons": "some managers are really bossy but it's a nice work enviroment"}, "9": {"Date": " Dec 30, 2016", "Summary": "\"It's an ok first job.\"", "Pros": "Good experience for a first jobNot hard you learn as you goMost of the crew is greatFree meals on breaks", "Cons": "It's fast food so it's always busy.You have to clean fast and a large area.Some workers can get on your nervesPay could be better"}}