{"0": {"Date": " Nov 7, 2016", "Summary": "\"the mcd\"", "Pros": "good food when I am very hungry.", "Cons": "bad drinks when I am very thirsty"}, "1": {"Date": " Nov 7, 2016", "Summary": "\"First Job\"", "Pros": "Minimum Wage RaisePaid Time OffFlexibilityEasy job", "Cons": "ManagementHoliday Time OffGave to wait tables but can't accept tips"}, "2": {"Date": " Nov 7, 2016", "Summary": "\"Cashier\"", "Pros": "Overall it was pretty easy work just clocked in and clocked out ringing people up", "Cons": "Smell like burgers after work"}, "3": {"Date": " Nov 7, 2016", "Summary": "\"Mcdonalds swing manager\"", "Pros": "Reinburses you for college up to 5,000 and change. Teaches you skills you need for business. 5 weeks paid vacation.", "Cons": "Must work all shifts and its inconvenient when going to school. The business comes first in their eyes. They dont care about developing their people who want to learn and grow. Vacation is done by seniority so by the time you get the available days everything is taken."}, "4": {"Date": " Nov 8, 2016", "Summary": "\"Crewmember\"", "Pros": "Because it is something to do and it's beneficial", "Cons": "It's way to far and there's no way I can get back and forth with no car"}, "5": {"Date": " Nov 7, 2016", "Summary": "\"General manager\"", "Pros": "the money is good if you know how to nogotiate", "Cons": "a lot of pressure for no reason"}, "6": {"Date": " Oct 23, 2016", "Summary": "\"Meh\"", "Pros": "I enjoy the fast pace of the business which helps the day go my quickly. It's nice to know your regular customers and being able to touch base with them.", "Cons": "A lot is expected with very little time to complete. Minimum wage makes it hard for us to be able to keep hard working employees."}, "7": {"Date": " Oct 23, 2016", "Summary": "\"Good starting job\"", "Pros": "cool employees, foods good, easy", "Cons": "smell sticks with you, just entry level"}, "8": {"Date": " Oct 23, 2016", "Summary": "\"Management could be better\"", "Pros": "Worked around my schedule most days", "Cons": "Inconsiderate to my family needs"}, "9": {"Date": " Nov 28, 2016", "Summary": "\"Manager at McDonalds\"", "Pros": "Great at being flexible with hours as long as you are not a manager. good first job. would not reccommend to anybody.", "Cons": "management is horrible. general manager does not know how to run a store and the owners do not care about their employees. the one i worked at was open 24/7 365 days. will not give overtime or pay holiday pay."}}