{"0": {"Date": " Jan 18, 2018", "Summary": "\"Minimum wage job\"", "Pros": "Not much to put here.", "Cons": "Bad management and rude customers."}, "1": {"Date": " Dec 28, 2017", "Summary": "\"Mcdonalds\"", "Pros": "It pays not well but it pays", "Cons": "Managment and customers really, plus no benefits"}, "2": {"Date": " Dec 12, 2017", "Summary": "\"General Manager\"", "Pros": "Working with the public the fast paced environment getting to know your regular customers. And being able to train staff to advance", "Cons": "Staffing issues having broken equipment not getting fixed not having the proper equipment to run the store call offs and ncns"}, "3": {"Date": " Dec 12, 2017", "Summary": "\"cashier\"", "Pros": "Great super goodFlexibleentertaining", "Cons": "Great strandart base pay job"}, "4": {"Date": " Dec 13, 2017", "Summary": "\"Team memeber\"", "Pros": "There was a lot of great people to work with and it was a good clean environment", "Cons": "they had so many people there and when new people get hired everybody else looses a lot of hours"}, "5": {"Date": " Dec 26, 2017", "Summary": "\"Crew Trainer/cook\"", "Pros": "Great work experience in a leadership role and customer service.", "Cons": "High employee turnover rate lack of reliable employees ,too many unexperienced shift Managers"}, "6": {"Date": " Dec 26, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Free food and drinks", "Cons": "Short staffed in the evening"}, "7": {"Date": " Dec 9, 2017", "Summary": "\"Manager\"", "Pros": "Everyday is a little different, seeing a smile on a customers face because I placed their order in a timely manner. Or holding the door open for my regulars who come in every morning.", "Cons": "Sometimes the day doesn’t go very well. Some people might not show up or it is unexpectedly busy. I have to change my plans but I always end up coming up with a different solution to any problem"}, "8": {"Date": " Dec 11, 2017", "Summary": "\"Shift manager\"", "Pros": "Working with people who love there job", "Cons": "Constantly on your feet"}, "9": {"Date": " Dec 12, 2017", "Summary": "\"Cashier\"", "Pros": "Working can help you pay for your new car or if you have and bills you need to pay for.", "Cons": "You could get annoyed with some of the customers if they have an attitude towards you but you just have to stay calm."}}