{"0": {"Date": " Feb 20, 2016", "Summary": "\"Cashier\"", "Pros": "Fun working with the team", "Cons": "Get misunderstanding with people"}, "1": {"Date": " Mar 28, 2016", "Summary": "\"Chillin it\"", "Pros": "You get food free sometimes", "Cons": "It smells bad most of the time"}, "2": {"Date": " Mar 6, 2016", "Summary": "\"Good for starting and not much else\"", "Pros": "You don't really need to have any experience to work at McDonald's. It's a great way to get some job experience under your belt before you starting going after what you really want to do. You learn how to deal with people very quickly; it's a good skill to have. Very fast-paced as well.", "Cons": "This all depends on your location's manager, but employee's aren't always treated the best. Schedules would always go up on Sundays so you hardly had any notice for the upcoming week, managers would always call me in when I wasn't scheduled to work, many customers are rude, it can be very overwhelming, and VERY exhausting. People think McDonald's is an easy job but it most certainly is not. I would always leave completely drained."}, "3": {"Date": " Mar 6, 2016", "Summary": "\"Not so great\"", "Pros": "Not very many to list besides if you manage to make it to management, and even then it's dodgy.", "Cons": "Too obsessed with labor, the only flexible hours are what they say is flexible, good luck getting a raise depending on if your owner operated or corporate."}, "4": {"Date": " Mar 7, 2016", "Summary": "\"Got Mc Screwed\"", "Pros": "They have Bathrooms and food. Free Drinks for employees. A uniform that could be new who knows. Good place to make new friends.", "Cons": "Low pay, Low Hours, No room to advance. Your basic one stop shop for teens to enter the work force."}, "5": {"Date": " Mar 7, 2016", "Summary": "\"Sales associate\"", "Pros": "The best reasons to work in that job was it gave me experience with the people and a better understanding of individuals", "Cons": "Overall not a long term job based on what they give ."}, "6": {"Date": " Mar 7, 2016", "Summary": "\"Okay first time job for a high school student\"", "Pros": "The people that worked there were relatively decent and some willing to help.I can't say there are a lot of pros to working here other than I was making money as a poor high school student about to go to college.", "Cons": "My managers were absolutely awful people that didn't care about their employees at all. The only time I ever saw general concern for an employee was when they were under 18 and legally not allowed to consecutively work more than 4 hours at a time....so that concern was more for themselves then the actual employee. I was made to stand outside during midday in the central Florida heat (about 95 degrees, 100% humidity) in all black, heavy clothing to take orders. The entire process was totally unnecessary in the first place, but they made me stand out there for over 90 minutes. This was because I was the only young person under 40 working midday. I was so overheated that I had to take a break and drink an entire liter of Gatorade.This was just one small example of the ridiculous things they made me do because I was one of the younger people working there.The pay is also terrible for how I was treated and the manual labor I was doing. There were a lot of times we were under-staffed and I was simultaneously yelled at by management and customers for things that were completely out of my control, such as how fast the food was being cooked. I was behind the cash register, not the grill."}, "7": {"Date": " Feb 16, 2016", "Summary": "\"I got burned.\"", "Pros": "Free food. Lots of buns. Fresh meat. I really liked talking to people on that drive-in speaker phone thingamajig. Happy meals make me happy.", "Cons": "Grease on my face. Dirty dishes. My boss sucked. The worst part was having to be at work at 5 am."}, "8": {"Date": " Mar 5, 2016", "Summary": "\"title\"", "Pros": "great people. Fast pasted. Definitely a good learning experience. Good job for high school students. Eye opening experience to say the least.", "Cons": "Hard work and low pay. Angry customers expecting premium service for 1.50. Really other than that there were no cons to speak of. This is a perfect first job."}, "9": {"Date": " Mar 5, 2016", "Summary": "\"Resturant Manager\"", "Pros": "Good work ethics and pay structure including perks of the job staff where pleasant and the customers nice", "Cons": "I found i was working late and the unsocial hours meant it impacted a bit on my family and home life"}}