{"0": {"Date": " Feb 19, 2017", "Summary": "\"Good for your first job\"", "Pros": "Customers are absolutely greatTeam Members", "Cons": "ManagementPay could be way betterBenefits"}, "1": {"Date": " Feb 4, 2017", "Summary": "\"Crew Member\"", "Pros": "Great customers, loyal commentient. I loved working with ther customers all the time and it was one of the best times to sepnd time and see their faces regular.", "Cons": "Bad hours, Rude managers, dirty resturant they are very rude when it comes to favorites and if you are not one they just give you the cold shoulder and make you feel unwanted and yell at you in front of customers"}, "2": {"Date": " Feb 4, 2017", "Summary": "\"Great first job, you'll have the opportunity to meet a bunch of different people from all walks of life.\"", "Pros": "-Helps you develop people skills-get to work with different people-different positions (chance to grow)-out of work activities (potluck, volleyball, etc.)-learn how to handle cash and bank type transactions-help with college or to get your GED", "Cons": "-having upper management show favoritism-unprofessionalism show by coworkers-getting yelled at by customers for their incompetence-not enough employees staffed for shifts at times"}, "3": {"Date": " Feb 4, 2017", "Summary": "\"It's McDonald's\"", "Pros": "There are many opportunities to move up, they are always looking to make people into managers. It's not always ex- convicts and high school kids working there.", "Cons": "The public treats you harshly because they think you're not as smart or skilled. Have to have tough skin."}, "4": {"Date": " Feb 4, 2017", "Summary": "\"Analyst Intern\"", "Pros": "Fun to work, hard work is rewarded", "Cons": "Difficult work - life balance"}, "5": {"Date": " Feb 18, 2017", "Summary": "\"Great for a first job\"", "Pros": "Learn expert customer service skills.Build friendships and strong leadership skills.Learn to keep a clean and stable work environment!", "Cons": "You will always have those few rude customers that will always make your shift harder than it already is. Long hours may not always consist of a break."}, "6": {"Date": " Feb 3, 2017", "Summary": "\"Its a decent first job\"", "Pros": "Flexible hoursGood for students scheduleFun coworkersCool managers", "Cons": "CustomersBad benefits and independently owned mcd30 min break per 8 hour"}, "7": {"Date": " Feb 4, 2017", "Summary": "\"Active worker\"", "Pros": "Previous maintence work management material", "Cons": "All around worker good work history"}, "8": {"Date": " Feb 17, 2017", "Summary": "\"Cashier\"", "Pros": "You are always meeting new people", "Cons": "Pay should be better or at least give more hours"}, "9": {"Date": " Feb 17, 2017", "Summary": "\"Crew member\"", "Pros": "Learned to deal with crazy customers", "Cons": "Its Mcdonalds there is not much to say"}}