{"0": {"Date": " Jul 20, 2016", "Summary": "\"Crew member\"", "Pros": "Hospitality and Customer service, free meals on break,", "Cons": "Poor management, low pay, attitudes, rude customers"}, "1": {"Date": " Jul 19, 2016", "Summary": "\"Bad Managment\"", "Pros": "pays money, half off food", "Cons": "everything about the darn place"}, "2": {"Date": " Jun 30, 2016", "Summary": "\"crew member\"", "Pros": "Its a great job especially if you are young and looking for work. Everything is pretty easy to learn and the people are usually great.", "Cons": "It can get fast paced, but as long as you understand what you are doing and helping out you will be fine."}, "3": {"Date": " Jul 4, 2016", "Summary": "\"Cashier and Cook\"", "Pros": "Great place for a first job. You will learn great skills that you can take with you wherever you go in the future.", "Cons": "Very low pay for the amount of work. The work itself isn't hard but it's continuous without many efficient breaks."}, "4": {"Date": " Jul 5, 2016", "Summary": "\"Shift Supervisor\"", "Pros": "Flexibility, great team to work with", "Cons": "Long hours, not everyone puts in equal effort."}, "5": {"Date": " Jul 18, 2016", "Summary": "\"OK for weekends\"", "Pros": "I work weekends only and I'm glad that's all I need to work there.Newer location so its nicerIngrid is great manager.", "Cons": "It's McDonald'sThey go days without changing grease.employees think they are managers just because they are old"}, "6": {"Date": " Jul 18, 2016", "Summary": "\"Past Employer\"", "Pros": "Understanding the importance of Team Work & Training.", "Cons": "Hours may be tedious unless you specify availability limitations. Some locations will not pay overtime."}, "7": {"Date": " Jul 18, 2016", "Summary": "\"bad\"", "Pros": "Mcdonalds does Offer free meals to employees", "Cons": "Not many hours given to employee weekly"}, "8": {"Date": " Jul 4, 2016", "Summary": "\"Manager\"", "Pros": "Job security. Excellent systems. No surprises. McDonald's is McDonald's. Ray was first to figure it out. These people are brilliant.", "Cons": "Due to $1 ish menu, margins are low. Wages and salaries are low and that is not because of greed. That's just how the numbers work and the system is designed to absolutely minimize labor cost."}, "9": {"Date": " Aug 9, 2016", "Summary": "\"Just bad\"", "Pros": "The customer is never right and the managers know that, they always stick up for you", "Cons": "poor management, poor quality, poor sanitation, poor hours, zero training"}}