{"0": {"Date": " Oct 20, 2017", "Summary": "\"Good\"", "Pros": "Good environmentGood payGood hoursGood outfitsGood crew meal", "Cons": "Cant think of nothingLong hours standing on foot"}, "1": {"Date": " Nov 3, 2017", "Summary": "\"Works to get yourself by\"", "Pros": "It's a job and one that requires little to no thinking, good for a student who's mind is fried by the end of the day.", "Cons": "Low salary and minimal growth opportunities."}, "2": {"Date": " Nov 3, 2017", "Summary": "\"Terrible Management\"", "Pros": "Great first job, Customer service experience, Consistent hours.", "Cons": "Low pay, Management didn't seem to care, Management never paid attention to days off needed for school functions, Customers were rude."}, "3": {"Date": " Oct 19, 2017", "Summary": "\"register\"", "Pros": "it's good when you have great cowokers", "Cons": "some customers are really annoying"}, "4": {"Date": " Oct 19, 2017", "Summary": "\"McDonald's life\"", "Pros": "The offer tuition. Assistance to help with school", "Cons": "Work to hard for what your paid"}, "5": {"Date": " Oct 20, 2017", "Summary": "\"was warking there at the Work&Teavel programme\"", "Pros": "friendly atmospheregood conditions and environment", "Cons": "mamagement wants you to make everything on different positions (example - while taking order on drive-thru you must do some stuff at the kitchen and than go to the other window and take money from the customer/ if there is no people you can't just stay and wait , all the time you shuld do stuff at the different fields)"}, "6": {"Date": " Nov 2, 2017", "Summary": "\"Was a great experience which I won't forget\"", "Pros": "Not only was there a great atmosphere, but boy are the big mac's delicious", "Cons": "Sometimes there wasn't enough mustard"}, "7": {"Date": " Nov 2, 2017", "Summary": "\"Okay Stepping Stone\"", "Pros": "Easy to get hired, close to my home", "Cons": "management puts too much pressure on workers"}, "8": {"Date": " Nov 2, 2017", "Summary": "\"Okay place to work\"", "Pros": "The company offers a Flexible schedule- am or pm shifts. The Job is very easy with simple and thorough training.", "Cons": "When I worked there, there were no benefits offered. There is little to no room for advancement. But it’s a good job to get you through college."}, "9": {"Date": " Nov 3, 2017", "Summary": "\"Crew trainer\"", "Pros": "Awesome managers that you can crack jokes with, the co-workers are all great. You get put down by customers quite often if your customer service and shouted at if your in the grill, but do your job right and it's a pretty good job for a beginner or someone looking to take it easy", "Cons": "Raises are not given to those who work hard, but for those who work more. If you have a set availability, you won't get a raise past 8.25. (That is what I've been told) so you need to have an open availability to move up to management or to make more money"}}