{"0": {"Date": " Dec 6, 2017", "Summary": "\"Great Atmosophere\"", "Pros": "Interactive work days with a great support staff. Management was very understanding and flexible with scheduling and compensatio. Overall great place for a high school job", "Cons": "Long shifts and sometimes slow days. Trivial tasks like sweeping after every customer came in became kind of an annoyance but i was grateful to have the job."}, "1": {"Date": " Dec 10, 2017", "Summary": "\"Cashier\"", "Pros": "Good Food, good hours, good culture", "Cons": "Low pay, minimal breaks, bad atmosphere"}, "2": {"Date": " Dec 10, 2017", "Summary": "\"Good\"", "Pros": "Nice people at the place", "Cons": "Lot of work to do always"}, "3": {"Date": " Dec 25, 2017", "Summary": "\"Crew/Server\"", "Pros": "Friendly workers, making customers happy", "Cons": "Making the food wrong and the customers are not happy"}, "4": {"Date": " Dec 23, 2017", "Summary": "\"Working at McDonald's\"", "Pros": "Flexible hours, willing to hire starting at fourteen, good customer service experience, always hiring", "Cons": "No raises, minimum wage salary"}, "5": {"Date": " Dec 23, 2017", "Summary": "\"Fun work, bad management.\"", "Pros": "Flexible hoursAbove minimum wageEasy to become skilledRoom to improve speed and accuracyFriendly coworkersEasy work", "Cons": "Management can really buck you over, one manager would be strict and neat, one was literally a junkie that worked graveyard, one was horrible to workers, one didn't care about anything but what the GM thought, and one would lounge around in the back and yell at workers and eat on the job. One manager would have me work in front of the fryer, for an entire 8 hour shift, without any break, without water breaks, while also telling me that I work slowly and to pick up the pace. Needless to say, I quit, telling the GM that he really needed to get a handle on his managers."}, "6": {"Date": " Dec 8, 2017", "Summary": "\"Very good\"", "Pros": "Pay and employees were good.", "Cons": "Scheduling interfering with my plans."}, "7": {"Date": " Dec 9, 2017", "Summary": "\"Shift manager\"", "Pros": "Customers, co workers. Easy job not at complicated as it seems. Over all I find it a great starting job and to move up and great experiences to becoming a great worker.", "Cons": "Cons are rude people or people you can’t understand or come employees tend to not to listen to you or mess around while we’re busy."}, "8": {"Date": " Jan 13, 2018", "Summary": "\"Terrible employee treatment\"", "Pros": "75% off food on day u work awesome!", "Cons": "SalaryteatmentbenifitsenvironmentI hate this companyhaenteringcustomers are so rude to you everyday"}, "9": {"Date": " Jan 14, 2018", "Summary": "\"Poor Treatment\"", "Pros": "Simple, easy, convenient lunch, structure", "Cons": "Low pay, poor treatment, dead-end job"}}