{"0": {"Date": " May 25, 2016", "Summary": "\"Horrible management, not worth it\"", "Pros": "Free or reduced meals if working a full shift, quick promotions to management if you put the time in, pretty hard to be fired", "Cons": "Horrible management. They refuse to actually train you then get mad that you don't know how to do anything. The pay is horrible, especially when you consider the customer interactions. You're often expected to work over regardless of your schedule or availability and are expected to ignore policy, such as going in regardless of your illness."}, "1": {"Date": " May 4, 2016", "Summary": "\"Crew Member\"", "Pros": "-Got plenty of hours-Fast pace shifts often made the day go quickly-Allowance for lunch-Depending on what crew i was working with, shift could actually be fun", "Cons": "-Often had to stay over to cover a shift, didn't have much of choice-Days got very repetitive and boring-Rude customers-Not much room for a flexible schedule"}, "2": {"Date": " Apr 19, 2016", "Summary": "\"Solid Business\"", "Pros": "Excellent education benefits and insurance", "Cons": "Lack of public respect for the company"}, "3": {"Date": " May 3, 2016", "Summary": "\"Work at McDonalds as a last option\"", "Pros": "You learn what it takes to run a business for a franchise and why you should not eat there any more.", "Cons": "after about 3 months there is nothing else to learn from McDonald that could help you later in life."}, "4": {"Date": " May 3, 2016", "Summary": "\"Manager\"", "Pros": "Decent pay, upper management was understanding with schedule.", "Cons": "Having to deal with not only upset customers, but employees and homeless people."}, "5": {"Date": " May 3, 2016", "Summary": "\"Bitter sweet\"", "Pros": "Typically easy work it's not rocket science but safety is key. Better for young students with flexible hours that just want a little bit if pocket money", "Cons": "Never let you go home on time, you have to wait for someone to take over for you. If they called out, you'll be stuck until a manager finally steps up and sends you home."}, "6": {"Date": " May 3, 2016", "Summary": "\"An alright job. New experiences.\"", "Pros": "Working with friends, being with the same people every day builds great friendships! The food! The atmosphere at a successful McDonald's is great. Everyone is part of a cohesive team.", "Cons": "The customers can be SO rude. Be prepared for all the mental abuse from people. It can get really busy, frustrating. Days when you hate your job are quite common."}, "7": {"Date": " May 3, 2016", "Summary": "\"Hate it. Hoping to find somewhere else ASAP\"", "Pros": "The customers are the best part about working there. I absolutely love them! They are fun to interact with and they are genuinely good people", "Cons": "The people I work with are very immature. People are constantly being yelled at and belittled. It's unprofessional and I don't want to work here anymore"}, "8": {"Date": " Apr 19, 2016", "Summary": "\"At&t customer\"", "Pros": "I receive an 8% discount on my cell phone bill for being a McDonalds employee. All I had to do was show them a check stub.", "Cons": "I dont get my raise every 6 months, like I'm suppose to."}, "9": {"Date": " May 24, 2016", "Summary": "\"Worst place to work\"", "Pros": "It is a place close to home, only a 7 minute drive.", "Cons": "Lie in interview to get you to work and never evaluates an employee and rarely gives raises."}}