{"0": {"Date": " Sep 28, 2016", "Summary": "\"What I call \"Hell\"\"", "Pros": "Very flexible hours and easy advancement opportunities. It would not be difficult to make a career out of McDonalds's and if you do, I have some major respect for you.", "Cons": "Horrible management. Often understaffed, so the few employees there are over worked and underpaid. I was expected to work 9-10 hour shifts with one thirty minute break in the first two hours. Procedures were randomly followed, one day you will do something in front of the manager, you do the same thing the next day and get yelled at because it's not \"procedure\". Honestly, I could go on for days. It's been over a year since I quit and I still have anxiety dreams about this place."}, "1": {"Date": " Sep 28, 2016", "Summary": "\"Not the best\"", "Pros": "Weekly payEasy to move upMoney comes in because of lack of employees they need you to stay", "Cons": "If raises exceed promotion salary then you pay will be the sameNever any peopleHave to do 10 peoples jobs at one end because of the lack CrewBad scheduling techniques ex. Work from 6pm -1am one day to come back at 4am-12pm next day"}, "2": {"Date": " Sep 12, 2016", "Summary": "\"Assistant manager\"", "Pros": "Advancement opportunities competitive pay, flexible schedule, uniforms", "Cons": "If you accept salary, they call you 24/7"}, "3": {"Date": " Sep 26, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Some managers are cool and chill. Some are not. Scheduling is very unstable and weird sometimes.", "Cons": "When working there, it's a little boring. Sometimes customers are angry."}, "4": {"Date": " Sep 26, 2016", "Summary": "\"mcdonalds\"", "Pros": "a job is a job", "Cons": "no benefits low pay for the amount of work"}, "5": {"Date": " Sep 26, 2016", "Summary": "\"Ok\"", "Pros": "Money was goodSome people were cool to work with", "Cons": "dirty place to workco-worker can be hood ratsome co-worker wouldnt show"}, "6": {"Date": " Sep 26, 2016", "Summary": "\"Average\"", "Pros": "Flexible hours, need days off they will work with you.", "Cons": "Work environment was messy and management was childish."}, "7": {"Date": " Sep 26, 2016", "Summary": "\"Crew Member\"", "Pros": "The coworkers are fun to be around", "Cons": "Too fast paced at times and customers can be finicky at times"}, "8": {"Date": " Sep 26, 2016", "Summary": "\"Consultant\"", "Pros": "Various benefits to choose from", "Cons": "Managers cared more about profits than people."}, "9": {"Date": " Sep 27, 2016", "Summary": "\"Good experience\"", "Pros": "Got to understand the values and missions of the chain restaurant. Employees were friendly. The environment was great when there were less customers.", "Cons": "Not much to say, but it could be a little exhausting when it is busy. Rude customers do not count as part of the con but I would say I did not have a clear instructions as to how to respond to this people."}}