{"0": {"Date": " May 19, 2016", "Summary": "\"Crew\"", "Pros": "You get paid, but not much.", "Cons": "Very low pay honestly not worth it."}, "1": {"Date": " May 2, 2016", "Summary": "\"Fair Employer Fair Wage\"", "Pros": "Lots of support and help. Lots of opportunities for advancement. Lots of resources and connections.", "Cons": "Kind of boring and monotonous. Wish they gave more free food to employees"}, "2": {"Date": " May 20, 2016", "Summary": "\"McDonald's Cashier\"", "Pros": "A lot of hours provided due to high turnover rate.", "Cons": "Low pay, management was often rude to employees, worked 10 hour shifts with no breaks"}, "3": {"Date": " May 18, 2016", "Summary": "\"McDonald's Crew Trainer\"", "Pros": "There aren't many. It's a good part time job while still in school and you get a discount on food.", "Cons": "Quick turnover of employees, inconsistent breaks, rude management, higher expectations in drive thru than what is achievable"}, "4": {"Date": " May 18, 2016", "Summary": "\"crew trainer\"", "Pros": "Free food when you get a break", "Cons": "Long hours on your feet,rude customers"}, "5": {"Date": " May 19, 2016", "Summary": "\"Crew Member\"", "Pros": "Fast paced atmosphere and fun people", "Cons": "Minimum wage, but it is a low skill job"}, "6": {"Date": " May 3, 2016", "Summary": "\"Memorable\"", "Pros": "The amazing relationship I had between my coworkers and upper management. This job has set a path for a lot of us out there and I wouldn't take a second back.", "Cons": "They do not try to develop or train the crew/management with detail. Everything is about numbers and speed. Detail is everything"}, "7": {"Date": " Jun 9, 2016", "Summary": "\"Poor Training\"", "Pros": "It's easy to get an interview and get hired to start working.", "Cons": "Poor communication and poor training."}, "8": {"Date": " May 18, 2016", "Summary": "\"Don't work at McDonald's\"", "Pros": "It kept you busy,", "Cons": "Can't sit down. Sometimes you don't get a break, even if you're working a 9 hour shift. Managers are snobby. Physically exhausting. Only get about $500 a month."}, "9": {"Date": " May 4, 2016", "Summary": "\"Crew member\"", "Pros": "good benefits for a starting job, nice discount/ free food, descent starting wages, good management", "Cons": "not much to say here"}}