{"0": {"Date": " Aug 10, 2016", "Summary": "\"Great People\"", "Pros": "Great location. Manager is very flexible in terms of time off and working from home. Excellent people to work with day in and day out.", "Cons": "Lots of turmoil currently. They have been cutting back on staff, promotions, outings, or any other G&A."}, "1": {"Date": " Aug 10, 2016", "Summary": "\"pretty decent custodial work\"", "Pros": "people come in once in a while", "Cons": "sometimes gets boring and gross"}, "2": {"Date": " Aug 24, 2016", "Summary": "\"Former employee\"", "Pros": "Got a lot of hours at the place and had good coworkers. The managers were fun and very willing to work with you if you had a question.", "Cons": "Lots of rushing and got burned a lot. There was no adequate burn care in the place so watch out for that."}, "3": {"Date": " Aug 24, 2016", "Summary": "\"Waa good first jiv to gain experience\"", "Pros": "Lots of people to meet great experience", "Cons": "Pay rate, hours and customers"}, "4": {"Date": " Jul 30, 2016", "Summary": "\"Sr Director\"", "Pros": "Global companyHuge reach and love by customers120 countries, 69 million customers on a daily basisGreat for people with a lot of patience", "Cons": "Highly politicalYou never see the bullet that will kill youSo competitive that it is a constant fight"}, "5": {"Date": " Aug 10, 2016", "Summary": "\"A great company and a great work environment\"", "Pros": "It has a great work base as far as great leadership, the vision of the company, the community and overall great work experience", "Cons": "Pay rate, a lot of hard work for a little pay."}, "6": {"Date": " Aug 9, 2016", "Summary": "\"Cashier\"", "Pros": "Very flexible hours and relaxed managers as long as you worked hard.", "Cons": "The training is quick so it is mostly learn as you go which can be stressful when it is busy/"}, "7": {"Date": " Aug 10, 2016", "Summary": "\"Department Manager\"", "Pros": "You learn how to schedule your time and prioritize tasks. Also, the scheduling is somewhat flexible.", "Cons": "High employee call offs are very unpleasant. I've worked for both corporate and owner operators, The benefits are far less with owner operators."}, "8": {"Date": " Aug 23, 2016", "Summary": "\"Cashier\"", "Pros": "It was just I job. I got paid it was alright because I worked with friends.", "Cons": "The workers are terrible some can't handle customer service."}, "9": {"Date": " Aug 9, 2016", "Summary": "\"Server\"", "Pros": "Customer service, good management training", "Cons": "Rude customers, high worker turnover"}}