{"0": {"Date": " Jun 24, 2016", "Summary": "\"meh\"", "Pros": "it was okay i guess working there is a lot better then eating the food and the manger is cool I guess.", "Cons": "the food is gross and smells ew and the hours suck after you work there for a while it misses with your skin."}, "1": {"Date": " Jul 9, 2016", "Summary": "\".\"", "Pros": "always hiring with no experience", "Cons": "lack of communication, understaffed, understocked"}, "2": {"Date": " Jul 9, 2016", "Summary": "\"Head prep/ cashier\"", "Pros": "Customer service and fast past environment", "Cons": "Some managers are very unprofessional"}, "3": {"Date": " Jul 10, 2016", "Summary": "\"Cashier\"", "Pros": "The food is good.customer service is great.", "Cons": "You go home smelling like food"}, "4": {"Date": " Jul 8, 2016", "Summary": "\"Okay place to work\"", "Pros": "Buying food whenever, trying out new menu items before everyone else, good entry level experience for kids, some upward mobility/able to move through the ranks", "Cons": "Long hours, dealing with rude/sloppy customers, some managers were rude, work was very tiring, just a general food service job"}, "5": {"Date": " Jul 9, 2016", "Summary": "\"Its a job\"", "Pros": "Not nearly as bad as I expected working at McDonalds would be. Its a job, no one goes to work for McDonalds as a career.", "Cons": "Customers are rude, but not much you can do about that. Nobody goes to McDonalds for a long-term job. Its bearable, but still not what I'd call a good job."}, "6": {"Date": " Jul 29, 2016", "Summary": "\"To much drama\"", "Pros": "Always looking to hire new people. Good benefits if u are a full time employee and get to meet new people.", "Cons": "To much drama. Managers want to be everyone's friend instead of making people do there jobs which makes it harder on people that is trying to work and do the job right"}, "7": {"Date": " Jul 9, 2016", "Summary": "\"Working at McDonald's\"", "Pros": "you work as a team, help each other oh if they're having difficulties or if they're behind on something . It's helps your persona skills & your communication skill.", "Cons": "the managers are rude & careless & selfish . Some coworkers Can be lazy, the others can be fun to work with. You get 40+ hours"}, "8": {"Date": " Jun 23, 2016", "Summary": "\"Great experience\"", "Pros": "they care about their workers and do their best to provide good benefits for their employees", "Cons": "it takes a lot of patience to work at a McDonald's"}, "9": {"Date": " Jun 23, 2016", "Summary": "\"My first job.\"", "Pros": "Some coworkers and customers are nice and friendly; 80% discount on crew meals.", "Cons": "I would rather not say."}}