{"0": {"Date": " Jul 4, 2017", "Summary": "\"Test Analyst\"", "Pros": "opportunity to grow in personal & professional life", "Cons": "nothing as such i know about"}, "1": {"Date": " Aug 9, 2017", "Summary": "\"Crew\"", "Pros": "They worked with me . help with over time", "Cons": "They always disrespect me. The manger didnt like me at all.."}, "2": {"Date": " Aug 9, 2017", "Summary": "\"Manager\"", "Pros": "the only pro is the relationships you make with the other employees", "Cons": "Rate of pay has not increased since 1990raises consist of a nickel to a quarterthere is always a reason why someone is not receiving a raisethey always post that they are looking for a store manager but are really looking for bottom dollar management"}, "3": {"Date": " Jul 4, 2017", "Summary": "\"A good first job.\"", "Pros": "Plenty of hoursDiscount on meals.Amazing rgmGood crewChances to advanceAlways a fun shift if you keep a positive outlook.", "Cons": "People in management either don't care or won't do their jobs are being considered for promotion, while people who do care aren't being considered.Owner operator has a say on who gets promoted and favoritism is very transparent.It's a who you know type of a deal"}, "4": {"Date": " Jul 5, 2017", "Summary": "\"You either love it or hate it\"", "Pros": "-Bonus check if your restaurant (corporate) does well on the VOICE reviews that are shown on the receipts-Fast paced and never feeling bored-Good startup job-Easy promotion if you work hard and earn it-More than minimum wage", "Cons": "-\"Customer's always right\"-Stubborn customers who think you are wrong and fight for their side, and you end up having to give in or else an unnecessary argument will fume up-Management sometimes not honest, but who really is completely honest?"}, "5": {"Date": " Jul 5, 2017", "Summary": "\"McDonalds\"", "Pros": "Schedule, Pay, Hours, Advancement, Training", "Cons": "Working on holidays, rushes, work weekends, takes awhile to advance, must learn all positions"}, "6": {"Date": " Jul 18, 2017", "Summary": "\"Store Manager\"", "Pros": "people flexible hours customers and not employed there any more", "Cons": "Wasted 27 years of my life"}, "7": {"Date": " Jul 18, 2017", "Summary": "\"Cashier\"", "Pros": "Easy schedule and fits school schedule", "Cons": "Very busy all the times"}, "8": {"Date": " Jul 18, 2017", "Summary": "\"Good 1st job\"", "Pros": "Flexible hours and good Christmas parties", "Cons": "Mean managers and no benefits"}, "9": {"Date": " Jul 18, 2017", "Summary": "\"Great first job for anyone\"", "Pros": "Flexible hours, gain experience for other jobs, ways to advance", "Cons": "Hard to get full time unless you are a manager"}}