{"0": {"Date": " Mar 20, 2016", "Summary": "\"Terrible Terrible Terrible\"", "Pros": "The worst job in the world almost.", "Cons": "- Management tries to train you during peak hours so u barely learn anything- The pay, I made like $1 more than my employees- Just hated the job, period."}, "1": {"Date": " Feb 14, 2016", "Summary": "\"Great first job.\"", "Pros": "Friendly customers, fast pace working area, good hours!!", "Cons": "The work place is too small."}, "2": {"Date": " Feb 27, 2016", "Summary": "\"cashier\"", "Pros": "The joy of helping people", "Cons": "Rude customers & ignorant managers"}, "3": {"Date": " Feb 27, 2016", "Summary": "\"Make sure you choose the right store to work at.\"", "Pros": "Nice $8.25 base pay, a full dollar above minimum wage", "Cons": "Too many kids working thereManagement CAN be crappy all though some work well"}, "4": {"Date": " Feb 27, 2016", "Summary": "\"Shift Manager\"", "Pros": "Flexible Schedule, Full Time and Part Time Hours always available, multiple varied shifts available", "Cons": "little career advancement, no benefits or sick days, no annual raises"}, "5": {"Date": " Feb 27, 2016", "Summary": "\"Good ... For a first Job\"", "Pros": "Flexible schedule , plenty hours , discount food", "Cons": "Poor pay , poor management"}, "6": {"Date": " Feb 26, 2016", "Summary": "\"Eh\"", "Pros": "Flexible with schedule and time off good benefits", "Cons": "Slow job growth and not moving quickly"}, "7": {"Date": " Feb 26, 2016", "Summary": "\"Good job to get your feet grounded before moving on to bigger and better things.\"", "Pros": "Flexible schedule. Friendly, laid back coworkers. More experience generally yields more hours. Relatively easy to get hired and get some work experience on your resume.", "Cons": "Low pay. Raises are small, few and far between. Sometimes stressful and hectic if people call in sick or no show."}, "8": {"Date": " Feb 27, 2016", "Summary": "\"Cesar\"", "Pros": "easy job, good environment job", "Cons": "low pay rate, low pay rate"}, "9": {"Date": " Feb 11, 2016", "Summary": "\"Daily Work\"", "Pros": "Having a part job can help me to study in the morning and win a little bit of money working to continue my studies", "Cons": "That I go to school in weekend and I might not go to work on weekends , I only need to work on week days"}}