{"0": {"Date": " Apr 13, 2017", "Summary": "\"Mediocre\"", "Pros": "Good pay, flex hours, good eniroment", "Cons": "technolgoy needs to be enhances"}, "1": {"Date": " Apr 13, 2017", "Summary": "\"Fun job not enough money\"", "Pros": "It was fun working with the people I worked with", "Cons": "Not enough money, sometimes management was not very good."}, "2": {"Date": " Apr 12, 2017", "Summary": "\"Crap\"", "Pros": "You get money for college", "Cons": "It is terrible. Every second you are there you want to be somewhere else."}, "3": {"Date": " Apr 13, 2017", "Summary": "\"Cashier\"", "Pros": "Interesting people. Never the same.", "Cons": "Hours. Smells. Safety. Low pay."}, "4": {"Date": " Apr 11, 2017", "Summary": "\"Dependent on management and coworkers\"", "Pros": "Good first job, Helps you gain experience that can be used at future jobs, Can be rewarding with good management and coworkers", "Cons": "In my case, it was hard to get a raise. I was started out at minimum wage and only got a raise when I became a Crew Trainer, and that's how much I was making when I quit ($8/hr). Can also be hard to move up; I worked there for almost a year and a half before I was promoted."}, "5": {"Date": " Apr 11, 2017", "Summary": "\"Former general manager in charge\"", "Pros": "Great bonus program and flexible hours.", "Cons": "Ownership expects great people practices out of their managers yet don't hold themselves to it."}, "6": {"Date": " Apr 12, 2017", "Summary": "\"great management\"", "Pros": "great management, great starter job. day shift was a lot easier than evening shift. there is also a good camaraderie with the day shift as it is mostly older people working", "Cons": "the pay is low. not flexible when time is needed off for sick children. customers can sometimes get nasty with workers."}, "7": {"Date": " Apr 12, 2017", "Summary": "\"Cashier\"", "Pros": "I was a good worker so they gave me lots of hours.", "Cons": "Lots of the managers don't really know what they're doing, other coworkers can be difficult, and of course customers can be bad."}, "8": {"Date": " Mar 25, 2017", "Summary": "\"My Experience\"", "Pros": "Friendly workers, good and cheap food.", "Cons": "Not a very clean place to eat or work"}, "9": {"Date": " Mar 27, 2017", "Summary": "\"good company low pay\"", "Pros": "good to learn the company", "Cons": "paycheck is not enough compare to others"}}