{"0": {"Date": " Jul 10, 2017", "Summary": "\"Don't Treat employees as numbers\"", "Pros": "free meals during your shift", "Cons": "under appreciated all the time, upper management and franchise O/O"}, "1": {"Date": " Jul 11, 2017", "Summary": "\"First assistant\"", "Pros": "I think it's a good place to start off at", "Cons": "It could be a little hard to move up in the business if your not with the right company"}, "2": {"Date": " Jun 26, 2017", "Summary": "\"Pretty Good Place to Work\"", "Pros": "The work was hard, but you always stayed busy which made the time go by quickly.", "Cons": "The kitchen was pretty hot during the summer months."}, "3": {"Date": " Jun 26, 2017", "Summary": "\"great first job\"", "Pros": "experience for hight school student", "Cons": "hours that don't work with school"}, "4": {"Date": " Jul 10, 2017", "Summary": "\"My fast food job\"", "Pros": "Easy first job, Easy job to get, no special skills needed, fast paced, easy to learn, college benefits, team based work", "Cons": "Low minimum wage, impatient coworkers and managers,aggressive management, unfair rules, too many duties for such little pay, small breaks"}, "5": {"Date": " Jun 26, 2017", "Summary": "\"Mickey D's!\"", "Pros": "Great place for a first job. You learn a lot!", "Cons": "Customers are setimes rude because of where we were working."}, "6": {"Date": " Jul 31, 2017", "Summary": "\"Wouldn't recommend for introverts or people sensitive to yelling.\"", "Pros": "The schedule was flexible and when you first start you can just request for whatever days work best for you", "Cons": "Screaming, yelling, and lots of violence in the work environment. The manager picked favorites and made is very obvious he didn't like anyone except them. Guilt tripped me for not being able to work over time despite being 16 and not legally allowed to. I didn't even put in my 2 weeks notice because it was so toxic. I would never recommend anyone who has anxiety or yelling sensitivities to work for them. Also the floors were covered in food and wet, which is a slipping hazard. Absolutely disgusting kitchen area."}, "7": {"Date": " Jul 31, 2017", "Summary": "\"Wasn't worth it\"", "Pros": "You got to multitask and learn how to do everything at once.", "Cons": "They would cut your hours. Management was a joke. Didn't know how to run the place."}, "8": {"Date": " Jul 11, 2017", "Summary": "\"Run Away\"", "Pros": "Hard to find any", "Cons": "Rate of pay, hours, benefits"}, "9": {"Date": " Jun 25, 2017", "Summary": "\"Good\"", "Pros": "Great work fmaily and good food", "Cons": "Rude customers and bad min wage"}}