{"0": {"Date": " Aug 22, 2017", "Summary": "\"Not Ok\"", "Pros": "50% discount off foodworks around school schedule", "Cons": "little to NO training but expects you to do and know everythingno helptook 2 months to get hiredyou HAVE to contact them they won't contact youonly get a few hours"}, "1": {"Date": " Aug 22, 2017", "Summary": "\"Crew Member\"", "Pros": "Decent pay for the work you're doing.", "Cons": "Most managers working really do the bare minimum and should even have qualified as a manager."}, "2": {"Date": " Aug 23, 2017", "Summary": "\"Okay job\"", "Pros": "Management is okay for the most part.", "Cons": "There are bad hours that they over work you."}, "3": {"Date": " Aug 7, 2017", "Summary": "\"Great first job\"", "Pros": "Decent PayGood work life balance", "Cons": "Angry customersIrritating Managers and Staff"}, "4": {"Date": " Aug 7, 2017", "Summary": "\"Decent\"", "Pros": "Not a hard job to do", "Cons": "It is only minimum wage"}, "5": {"Date": " Aug 7, 2017", "Summary": "\"Shift Manager\"", "Pros": "Good Coverage. Flexible hours. Learn to work well under pressure. Develop skills that are undervalued.", "Cons": "No payed vacation. Learning to motivate younger employees, learning to work for the first time."}, "6": {"Date": " Aug 22, 2017", "Summary": "\"Would really love to join you guys and be a very good worker\"", "Pros": "They have benefits you get half off your food some of the co-workers are very good and easy to get alone with", "Cons": "Pay not very good but reasonable but i need better pay and dont have set schedule need that as well"}, "7": {"Date": " Aug 22, 2017", "Summary": "\"Crew Member\"", "Pros": "They are very frlixible with your schedule and they offer college tuition assistance.", "Cons": "It can be kind of hard to communicate with some of the employees there and it can kind of be difficult to read the schedule."}, "8": {"Date": " Aug 6, 2017", "Summary": "\"Crew Member\"", "Pros": "They are flexible with schedules, the crew is fun to work with, it's so easy to make friends, the managers are really cool, you get 50% off your orders (for friends and family too), they are really good about breaks, and the job itself is pretty easy.", "Cons": "Some customers are awful, a few managers are clueless, and you occasionally have to pretty much babysit the newer people (and some of the more experienced people)."}, "9": {"Date": " Sep 11, 2017", "Summary": "\"Not a job for me\"", "Pros": "discounts on food, funny coworkers", "Cons": "not a competitive pay, rude customers"}}