{"0": {"Date": " Jan 21, 2016", "Summary": "\"Cashier/Maintenance\"", "Pros": "Its a great place to build your working skills an hand movement.", "Cons": "People are never on time to be at work"}, "1": {"Date": " Feb 24, 2016", "Summary": "\"Team Member\"", "Pros": "Some of the Managers are nice and team members", "Cons": "This McDonald's needs to be shut down. The food department needs to come inside and see the health code violations. The place is disgusting. I never ate there. I did drive through and was standing in a puddle of water, do to the fridge leaking. The soda machine had black residue around it. I never ate once on my break."}, "2": {"Date": " Feb 25, 2016", "Summary": "\"crew\"", "Pros": "there is not many pros of working at McDonald's. The best thing to say is probably the one free meal a day.", "Cons": "McDonald's is not a good job. You don't make a lot of money, Managers are rude and don't care what you have to say, and you have to deal with angry customers on a daily basis."}, "3": {"Date": " Feb 3, 2016", "Summary": "\"Crew Member\"", "Pros": "Experience mostly in a team environment, not much else.", "Cons": "It isn't a fun place to work at, customer's are usually rude, not a lot of upsides."}, "4": {"Date": " Jan 19, 2016", "Summary": "\"Cashier\"", "Pros": "good people that i work with", "Cons": "people being rude to you"}, "5": {"Date": " Jan 20, 2016", "Summary": "\"FRSCO\"", "Pros": "Some pros of working for FRSCO is that you can transfer your job status easily from store to store as long as it is run by FRSCO. You also have minimal interaction with the corporate offices of McDonald's.", "Cons": "There is no playplace in our store and we are severely understaffed."}, "6": {"Date": " Feb 2, 2016", "Summary": "\"maintenance\"", "Pros": "Good people experience ways to learn about the fast food restaurant business", "Cons": "Income and hours are not what it needs to be."}, "7": {"Date": " Feb 2, 2016", "Summary": "\"Former Employee\"", "Pros": "They offer some opportunities for advancement", "Cons": "Sometimes they do not have enough employees to run the store efficiently"}, "8": {"Date": " Feb 2, 2016", "Summary": "\"McDonald's\"", "Pros": "Management was extremely accommodating in creating the work schedule for the week. If you asked for time off, it was pretty much guaranteed that you would get it. The environment was very laid back, and it was easy to become friends with the other workers.", "Cons": "They were extremely understaffed, and they would keep workers who should have been fired in a week. Many people, including managers, would come in to work either drunk, high, or both, and management would not fire them."}, "9": {"Date": " Feb 2, 2016", "Summary": "\"Good money\"", "Pros": "Flexible on hours and decent pay. It was an enjoyable job all around, I would definitely go back if I needed money again.", "Cons": "Sometimes had to work night shifts, which could be long. When you had cleaning duty as well it could be very unpleasant."}}