{"0": {"Date": " Feb 9, 2018", "Summary": "\"Good starting place\"", "Pros": "The pay was decent. The management was okay although it could be better. It was a good first job so I would recommend it.", "Cons": "Encountered a lot of bad customers"}, "1": {"Date": " Feb 9, 2018", "Summary": "\"Line-Cook\"", "Pros": "Fast Paced and quick work environment", "Cons": "Little room for mobility"}, "2": {"Date": " Feb 9, 2018", "Summary": "\"Great job\"", "Pros": "Flexibility with your life schedule", "Cons": "There weren't any con's I can think of"}, "3": {"Date": " Feb 24, 2018", "Summary": "\"Cashier\"", "Pros": "Free Food, Nice Co-Workers, and flexible hours", "Cons": "Tedious, annoying customers at some times"}, "4": {"Date": " Feb 8, 2018", "Summary": "\"Just trying to make a living\"", "Pros": "Great place! Great food! Great arches", "Cons": "Bad food, too greasy and smelly"}, "5": {"Date": " Feb 9, 2018", "Summary": "\"grill crook or team worker\"", "Pros": "meet people work pay experience", "Cons": "not catching bus on time to home"}, "6": {"Date": " Mar 16, 2018", "Summary": "\"Terrible experience\"", "Pros": "The pros of working at McDonald's are the fact that they will help you with college tuition, at my particular store, employees get a free meal with every shift.", "Cons": "The pay is terrible! The management is terrible! They treat their customers like royalty and then turn around and treat their employees like trash, the management seems miserable and they are very unprofessional. They are disrespectful and there is constant conflict at work. It is very cliquey and the management plays favorites. I would absolutely not recommend working there. In my opinion it is a job only for young people just starting out that unfortunately are too inexperienced to know their own worth!"}, "7": {"Date": " Feb 8, 2018", "Summary": "\"Experience At McDonald's\"", "Pros": "- Some Benefits- Opportunities to relocate", "Cons": "- If you can't handle working in a fast stressful environment, this is not the place for you.- Must be able to deal with unsatisfied customers."}, "8": {"Date": " Feb 8, 2018", "Summary": "\"I work at a good store\"", "Pros": "I work at one of the newest stores in my area, food is the best out of all mcdonalds nearby. very good GM, all dodgy managers were removed months ago", "Cons": "work a ton of hours, haven't even been promoted to crew trainer yet despite putting in 40+ hours per week, caring a lot about the store and such. probably deserve more money due to the amount of work and care i put into maintaining the store(again, i am not even a manager, much less a crew trainer)"}, "9": {"Date": " Feb 22, 2018", "Summary": "\"honestly it wasn't a bad job i just had a lot of problems with fellow employees smoking weed all day and not helping\"", "Pros": "free drinks and you get to meet new people for better or worst its a decent first job", "Cons": "inconsistent work schedule, chaotic environment and drugs"}}