{"0": {"Date": " Jan 21, 2016", "Summary": "\"Easy Money\"", "Pros": "I worked here while in high school and for one year in college. Good for younger and inexperienced workers.", "Cons": "Not a difficult job, but the fact that few skills are needed is reflected in the low pay."}, "1": {"Date": " Feb 4, 2016", "Summary": "\"Who knows\"", "Pros": "Get a paycheck, laid back atmosphere, flexible scheduling. If you're a hard worker who performs given task with ease and speed you will get tons of hours.", "Cons": "Favoritism is one. Some of the employees are extremely lazy, and go undisciplined. Also some workers who know multiple positions are taken advantage of ,by means of inadequate pay, and lack of advancement."}, "2": {"Date": " Feb 5, 2016", "Summary": "\"fry cook\"", "Pros": "easy place to work bc the work isnt hard.", "Cons": "not very fun place to work"}, "3": {"Date": " Feb 5, 2016", "Summary": "\"Customer service\"", "Pros": "Meeting some folks who are patient and mannerly.", "Cons": "Some customers are unmannerly and can be threatening"}, "4": {"Date": " Jan 21, 2016", "Summary": "\"Crew trainer. Line cook, Dish washer\"", "Pros": "I love my job.. I enjoy working there in serving the customers to the best of my ability. Its a very nice in clean environment.", "Cons": "The reason why I feel like I need a job to better myself because I've been working here so long putting forth alot of good effort and I'm not making enough to pay my bills.its like I'm not getting no we're. I want to move forward I get great hours every week I get paid every week but it's not helping.."}, "5": {"Date": " Feb 25, 2016", "Summary": "\"McDonalds huh\"", "Pros": "Open schedule, able to learn food service.", "Cons": "Minimum wage, rude crew managers, no benefis, no wage increases. Unable to advance."}, "6": {"Date": " Feb 26, 2016", "Summary": "\"Cooking\"", "Pros": "Not really much to say. Entry level job", "Cons": "Most of the time you work with high school drama"}, "7": {"Date": " Feb 4, 2016", "Summary": "\"Manager\"", "Pros": "They have flexible hours when you're in school. You can always have free meals when you work. They also give you a book of coupons for other businesses when you shop.", "Cons": "No respect to anyone, crew & management, vice versa. Extremely low pay for high demanded work. Terrible communication between the management, crew, owner & supervisor."}, "8": {"Date": " Feb 5, 2016", "Summary": "\"crew member\"", "Pros": "good for students. not for people with children or older folks", "Cons": "the pay sucks unless your a manager, wear hats and not free meals i workedthere for 4 years and it was a bad experience"}, "9": {"Date": " Jan 20, 2016", "Summary": "\"Grill Cook/Crew\"", "Pros": "Flexible hours, cross-training, tuition assistance", "Cons": "Influx of high school students every graduation. Everybody has to start somewhere though."}}