{"0": {"Date": " Jan 28, 2017", "Summary": "\"Sucks\"", "Pros": "I like some of the people", "Cons": "Don't care bad work place"}, "1": {"Date": " Jan 8, 2017", "Summary": "\"BAD\"", "Pros": "It is an easy job, there's really nothing to it. I hated the pay, but no skills are required to work this job. I'm not sure why so many people are demanding higher pay for this skill level of work.", "Cons": "It's a crappy first job, don't do it. Unless you NEED the money, it's honestly not worth it."}, "2": {"Date": " Dec 23, 2016", "Summary": "\"Easy, relaxed friendly working environment.\"", "Pros": "Hours are very flexible, expect to work Holidays if you don't request them off.Pay is alright, but Overtime is often available.Managers are down to earth and understanding. Co-workers will eventually become your friends.The work is easy. Not physically strenuous, or stress inducing. If you do any drugs, co-workers nor mangers will really mind - (may be a con for most people)Most who apply will get a job.Overall, a mellow working experience enjoyable working environment.", "Cons": "Very busy during lunch (11-2pm)Sometimes confusion and lack of communication may occur, often at the worst times.Training is poor.Some employees are bad at handling stress.Will eventually hate everything on the menu."}, "3": {"Date": " Jan 6, 2017", "Summary": "\"Inconsistent Management\"", "Pros": "Flexible work hours, especially for moms with school age children. Management opportunities available for employees. Provides most of uniform.", "Cons": "Too many managers with absolutely no experience or training. Low wages, even for management. No benefits and inconsistent policies."}, "4": {"Date": " Jan 7, 2017", "Summary": "\"Manager\"", "Pros": "Got to work with customers and employees Fri different back grounds.", "Cons": "Horrible pay long hours, and having yo be accountable for everyone's work"}, "5": {"Date": " Dec 22, 2016", "Summary": "\"Great\"", "Pros": "Great people to work with", "Cons": "Hate the hours, had to close on school nights"}, "6": {"Date": " Dec 23, 2016", "Summary": "\"McDonald's, the Good, the Bad, the Ugly\"", "Pros": "Amazing crew, lots of fun, works on people skills, and works on problem solving skills. After a while you will feel like a part of a family. There is also quick advancement, I have become a manager only by working there for 8 months.", "Cons": "Can be stressful, especially during rushes. Also my McDonald's has been sold so less pay, no benefits, nothing."}, "7": {"Date": " Dec 23, 2016", "Summary": "\"mcdonalds\"", "Pros": "its good, very nice people and great enviroment", "Cons": "sometimes very overwhelming and confusing"}, "8": {"Date": " Jan 27, 2017", "Summary": "\"Employer\"", "Pros": "Hardly anything, horrible food, horrible bosses.", "Cons": "Employees are rude, careless, lacking in intelligence, and overall just plain horrible."}, "9": {"Date": " Jan 6, 2017", "Summary": "\"McDonald's\"", "Pros": "Very flexible work schedule and friendly management.", "Cons": "Not enough hours were given."}}