{"0": {"Date": " Dec 1, 2016", "Summary": "\"McDonald's Review\"", "Pros": "Higher pay than minimum wage", "Cons": "I worked difficult hours and shifts"}, "1": {"Date": " Dec 14, 2016", "Summary": "\"Meh\"", "Pros": "You get to build a relationship with your co-workers", "Cons": "Can get busy very very quickly"}, "2": {"Date": " Dec 14, 2016", "Summary": "\"Americas First Job\"", "Pros": "Great for teens who don't know bettergood experience buildergreat side job", "Cons": "obsessed with labor cost over employee experiencehard to be promotedhard to complain about spiteful management"}, "3": {"Date": " Dec 15, 2016", "Summary": "\"Good experience\"", "Pros": "They always work around your schedule if you tell them ahead of time you need off or can only work certain hours they will work with you", "Cons": "They are always short staffed"}, "4": {"Date": " Dec 15, 2016", "Summary": "\"The overall work enviornment was not bad.\"", "Pros": "Consistent schedule, good pay for a fast food job, opportunity to move up quickly.", "Cons": "Working at a very fast pace, dealing with rude customers, being able to stand for long periods of time."}, "5": {"Date": " Nov 29, 2016", "Summary": "\"Crew\"", "Pros": "They work with you schedule very well and the pay is decent for it being fast food it's a great starter job for teens that are in school still or even someone who is in college", "Cons": "It is fast food so you are constantly aroundGreece and sometimes its a constant rush that can last for hours or all day"}, "6": {"Date": " Nov 29, 2016", "Summary": "\"Cashier\"", "Pros": "Team Work, Customer service 0 CSO", "Cons": "nothing to talk bad for Mcdonalds"}, "7": {"Date": " Nov 29, 2016", "Summary": "\"I am a hard worker I will not be late\"", "Pros": "Get to meet new people and lean more about the business", "Cons": "Did not take food or take money from my job be causes I will be fired"}, "8": {"Date": " Jan 4, 2017", "Summary": "\"DON'T WORK HERE EVER\"", "Pros": "where are no pros at all for working with this company", "Cons": "the uppermanagement forces us to lie and rules with an iron fist there are no pros of working here"}, "9": {"Date": " Jan 4, 2017", "Summary": "\"No advancement\"", "Pros": "flexible hours people are nice", "Cons": "low pay with franchise customers are rude"}}