{"0": {"Date": " Jan 10, 2018", "Summary": "\"Bad\"", "Pros": "You get payed for working at macdonals", "Cons": "You work at macdonals is bad"}, "1": {"Date": " Jan 10, 2018", "Summary": "\"Micky dee's\"", "Pros": "I should have stayed in school. Minimum wage is no way to make a living.", "Cons": "The food is gross and stinks"}, "2": {"Date": " Dec 26, 2017", "Summary": "\"Very fun and fast paced\"", "Pros": "Customer service experience money handling experience engaging with other employees learning what I’m good at and what needs work. They word with my schedule and give me great hours", "Cons": "I’m stuck on night shift because no one is willing to work the shifts but me I would rather be working regular day shifts"}, "3": {"Date": " Jan 30, 2018", "Summary": "\"Ehh try to avoid\"", "Pros": "Some of the mangers are pretty cool. Flexible hours for school", "Cons": "Some of the managers were verbally abusive to me. The cooks never wore gloves when handling the food (that's really gross), a lot of customers were total idiots"}, "4": {"Date": " Jan 31, 2018", "Summary": "\"Worker\"", "Pros": "fun, easy, made friends, love mcdonalds", "Cons": "low pay, gross environment, weird management"}, "5": {"Date": " Jan 9, 2018", "Summary": "\"Love being treated like a robot.\"", "Pros": "Helpful staff when needed (Not always but still helpful).Free drinks and a 10$ Food discount.Customers are usually nice.", "Cons": "Being Treated like im not a person but a robot thats supposed to magically know whenever Im supposed to go in (They randomly change my hours on me without warning) And yelling at other people as a result of it.Not everyone shows up there, and it's understandable why. Expects inexperienced people to take over positions they are not trained for when other people are gone.They didn't even train me correctly."}, "6": {"Date": " Jan 8, 2018", "Summary": "\"Hard place to work.\"", "Pros": "It's a good place to have your first work.", "Cons": "The schedules and low payment."}, "7": {"Date": " Jan 8, 2018", "Summary": "\"Okay first job\"", "Pros": "Different age groups and perspectives on thingsGreat regular customers who make the experience betterYou really learn how to deal with a variety of situations and get to try on different hats (cashier, presenter, back booth etc.)", "Cons": "Angry customersYou're just looked at as somebody who's easily replaceableNot a ton of ways to move up after being a shift leaderWorked there in college and I constantly had to go in and talk to management who kept scheduling me during classes, even when I'd provide them with a copy of my schedule"}, "8": {"Date": " Jan 7, 2018", "Summary": "\"Cook\"", "Pros": "Flexible hours, Nice Co-Workers, Good Food", "Cons": "Overturn was ridiculous and management was super immature"}, "9": {"Date": " Jan 29, 2018", "Summary": "\"Just not worth it\"", "Pros": "Its a way for me to get out of the house", "Cons": "The hours are abysmal and the pay isn't even enough to get me back and forth to work"}}