{"0": {"Date": " Jul 11, 2017", "Summary": "\"Jpb\"", "Pros": "Yeah cool job man this is good", "Cons": "Cant think of qnything wronh"}, "1": {"Date": " Aug 15, 2017", "Summary": "\"Cashier\"", "Pros": "It's family oriented and it's the world greatest fast food restaurant", "Cons": "The experience I had was sad but true the worst and unorganized facility I ever worked for there was no real leadership and a team is as strong as their leader. No respect for corporate, nor any towards other Co workers from management. Safety rules nor the hygiene ethics were enforce pour customer service majority of the time and the cleaning of equipment were not followed as demonstrated in orientation video. Actually in orientation we (the group of new employees ) we're instructed that we really didn't have to view the video. Not a good idea to begin your employment with learning to cut corners in the beginning."}, "2": {"Date": " Aug 15, 2017", "Summary": "\"Meh\"", "Pros": "Good beginners jobRepetitive working enviroment", "Cons": "Customers are the worst thing about this job"}, "3": {"Date": " Aug 15, 2017", "Summary": "\"Crew Member\"", "Pros": "Lot of hours and decent pay.", "Cons": "Dirty work area, awful management, and rude coworkers"}, "4": {"Date": " Jul 25, 2017", "Summary": "\"Crew Member\"", "Pros": "Fast paced(when busy) which means time goes by fast.", "Cons": "My biggest issue with working at the Mcdonald's are from my personal experiences which follow as:When it slow you end up getting sent home early. For a young teenager who needs money to pay for college materials it can be hard to do so when you get sent home 2-3 hours before your scheduled time. It's also annoying because I've been on the end where somebody gets sent home early, then right after it gets busy and you can no longer ask them for help because there gone. LABOR is a word that you will hear occasionally, when it's high someone is either going on break or going home.I've had to train people when I'm not a crew trainer. I never got promoted to a crew trainer and never got put in the class to be one but I still had to train people.If your not on the head managers good side then you wont get recognized for employee of the month or any promotions. This is another problem I faced while working here. Normally you would expect hard work to get recognized but at 7793 LAKE WORTH RD, Florida, thats not the case."}, "5": {"Date": " Jul 26, 2017", "Summary": "\"It was harsh\"", "Pros": "easily hired, fun to smoke in the refrigerator", "Cons": "treated everyone the same, even old people working had to do the hard stuff"}, "6": {"Date": " Jul 26, 2017", "Summary": "\"I am an \"overnight\" crew trainer, meaning three other people and myself do literally everything from 10pm-6am.\"", "Pros": "If you're fresh out of school and looking for cash this is your best bet. If you need cash in general this is your best bet, easy job to get, easy to do, not much you can do that can get you fired tbh", "Cons": "The higher up management expectations of shift managers is exceptionally high relative to their actual \"involvement.\" Thus shifting the stress onto a crew already being paid minimum wage and working hard relative to the amount of money they make.Neglected overnight crew"}, "7": {"Date": " Jul 6, 2017", "Summary": "\"Nice perks awesome atmosphere employees are generally friendly and work together to get things done in a decent time due\"", "Pros": "Nice pay, relaxed, not too demanding, good on resume, responsibility, respect of co workers, free meals with every work day best atmosphere to work at with team players", "Cons": "No time off, late arrivals, favoritism, lack of self control, no voice no benefits bosses sometimes will micro manage you just to try and make you quit your job"}, "8": {"Date": " Jul 24, 2017", "Summary": "\"nice\"", "Pros": "Great for short term", "Cons": "Dont reccomend long term here."}, "9": {"Date": " Jul 25, 2017", "Summary": "\"Its sucks being a manager\"", "Pros": "Its a really grest job as a crew member but as a manager i hate it ... they dident evem train me well and then they blame me. The benifits are good and pay is good but i want to lesve soon", "Cons": "Sucks if your a manager"}}