{"0": {"Date": " Apr 7, 2016", "Summary": "\"General Manager\"", "Pros": "Very good compensation for employees.", "Cons": "Can be difficult to maintain work/life balance."}, "1": {"Date": " Apr 7, 2016", "Summary": "\"Legacy Systems Galore\"", "Pros": "- Great company culture- A wide variety of opportunities and lateral movement within IT", "Cons": "- Few opportunities to work with relevant technology- Strong separation between core business and IT efforts"}, "2": {"Date": " Apr 20, 2016", "Summary": "\"Cashier\"", "Pros": "One of the best things about McDonald's is that it is a good place to start. I provides great customer service and time management skills", "Cons": "A major con is the inconsistent hours they want their employers to work."}, "3": {"Date": " Apr 20, 2016", "Summary": "\"Average\"", "Pros": "Steady job where you can always pick up shifts to work. Work can be somewhat interesting when interacting with customers.", "Cons": "It's McDonald's lol. Nobody likes earning the minimum wage. Can be very boring and repetitive while working on the job."}, "4": {"Date": " Apr 20, 2016", "Summary": "\"General Manager\"", "Pros": "Great benefits. Great pay, health, 401k, good vacation time, and bonuses are great as well.", "Cons": "Life/Work balance can get out of hand at time."}, "5": {"Date": " Apr 20, 2016", "Summary": "\"A Good First Job\"", "Pros": "Flexible hours for full time students. Free food. Coworkers are friendly.", "Cons": "Work schedule can be inconsistent. Managers took months to get me to start training for a promotion. They relied on me when they were short on workers, so I'd often wake up to calls from the store or I'd have to work overtime (overtime not paid)."}, "6": {"Date": " Apr 21, 2016", "Summary": "\"An alright job, easy to move up\"", "Pros": "Starting out as a crew member, it's easy to move up if you put in effort to the job. After about 7 months there, I was offered a promotion as a crew trainer, and management comes after that.The pay isn't as bad as people think. This is a good first job or entry-level job.Flexible scheduling", "Cons": "If you work in customer service, you may learn to hate customers.The rushes (\"peak hours\") are intense.Even though the scheduling is very flexible (if you request a day or days more than two weeks beforehand you will certainly get those days off), sometimes things come up sooner than that, and if you are late or can't show up management will make you feel like a burden to the company."}, "7": {"Date": " Apr 5, 2016", "Summary": "\"Marketing\"", "Pros": "McDonald's is the best place I've worked in my career so far. Surrounded by smart and passionate people, I leaned more there than all my years of education and prior experience combined. If you want to learn Marketing, this is a dream job.", "Cons": "Tough to get promoted quickly. Big company, people rarely leave, so tough to advance. But the experience you gain is worth it."}, "8": {"Date": " Apr 6, 2016", "Summary": "\"Manager\"", "Pros": "Fun, upbeat, exciting working environment.", "Cons": "I really didn't see any cons working for the company."}, "9": {"Date": " Apr 5, 2016", "Summary": "\"Team member\"", "Pros": "Flexible schedule and amazing staff", "Cons": "I wish there were more benefits"}}