{"0": {"Date": " Sep 2, 2017", "Summary": "\"Not as hard as you may think\"", "Pros": "Fast past so time goes by fast.", "Cons": "Not enough workers to help out because too many people kept quitting."}, "1": {"Date": " Sep 2, 2017", "Summary": "\"It was ok\"", "Pros": "Good school benefits and usually I can get a lot of hours when I am home from school for breaks", "Cons": "Managers are not fairly compensated. They are short staffed which makes every day difficult. There is no down time at all."}, "2": {"Date": " Sep 3, 2017", "Summary": "\"Cashiet\"", "Pros": "Free foodDiscountsCrew was coolLearned alot of new positions", "Cons": "Customers Management People always late Fast pace never any down time"}, "3": {"Date": " Sep 3, 2017", "Summary": "\"After a change of so many GMs this position lacks interest\"", "Pros": "Schedule Flexibility , Knowledge, College Credit, Tuition Assistance, Some very caring people, Getting to meet regular customers, and getting to meet new friends.", "Cons": "Overworked,underpaid compared to others,rude customers, racism from customers, getting blamed for everything, Always having to do others jobs, and unfair lousy health inspections by customers who lie a lot to get what they want."}, "4": {"Date": " Aug 18, 2017", "Summary": "\"Good\"", "Pros": "Entry levelDirect depositsTrainingThe manger and other co-workers kind and helpful they'll help you out if they see you struggling", "Cons": "The location of this McDonald's isn't the best one but other then that there's nothing else wrong with this McDonald's"}, "5": {"Date": " Sep 1, 2017", "Summary": "\"It was tiring but very worth it.\"", "Pros": "Nice employers, and the atmosphere is great. They will train you efficiently and I've never had any problems with HR.", "Cons": "The bad is, of course, really low and you shoukd only work here if minimum wage is okay with you."}, "6": {"Date": " Sep 1, 2017", "Summary": "\"Shift Manager\"", "Pros": "Fun Crew, and very unique people", "Cons": "A lot of manager BS, and high school students"}, "7": {"Date": " Sep 1, 2017", "Summary": "\"Overnight Worker ($10.50 hr)\"", "Pros": "It will be the easiest job to do.Generally you can get along with the people.Always can change hours.Great for younger kids.", "Cons": "Very stressful.Lack of help.Management will talk behind your back.Management will not do their job correctly.Management can't do most of the jobs that are required by most employees.Management Isn't knowledgeable.Management will try to dig into personal life.Co-workers talk all day instead of doing job.Management will mess up and blame the workers for it.Most Managers aren't qualified for the job.Management gets an appreciation party/Day while workers get nothing.No Paid Vacation.No paid sick leave.Benefits are so expensive it's impossible to get on your pay.No future in moving up.Generally have to work with kids younger than you and it can get pretty annoying real fast.Management rather you be a person who shows up to work every day even if you are deathly sick and doesn't care if you make the customers or other employees sick."}, "8": {"Date": " Aug 17, 2017", "Summary": "\"Job\"", "Pros": "Good food , half off food , & lovely co workers", "Cons": "Poor pay , not many hours"}, "9": {"Date": " Aug 17, 2017", "Summary": "\"cashier\"", "Pros": "The employers were very helpful.", "Cons": "Didn't get along with employees."}}