{"0": {"Date": " Jun 19, 2017", "Summary": "\"fun place to work\"", "Pros": "Corporate office was a fun place to work.", "Cons": "Was a long commute, especially during bad weather."}, "1": {"Date": " Jun 19, 2017", "Summary": "\"As good as you make it\"", "Pros": "Flexible hours, room for advancement", "Cons": "Fast food environment, customers can be rude, almost always rushed"}, "2": {"Date": " Jul 3, 2017", "Summary": "\"Overall\"", "Pros": "Advancement opportunities available for those who qualify", "Cons": "Only part time hours for regular crew"}, "3": {"Date": " Jul 4, 2017", "Summary": "\"Assistant Manager\"", "Pros": "work around school schedules mostly", "Cons": "dose not know how to set up working schedules"}, "4": {"Date": " Jun 16, 2017", "Summary": "\"Good company however the corporation too Hierarchical and leaders didn't care about customers and employees\"", "Pros": "friendship, team players, benefits are great and salaries at corporation are very competitive", "Cons": "very individualist and the boss is always right. the manager has nothing to manage, Director manage everything, didn't respect people's opinion. No respect to diversity."}, "5": {"Date": " Jun 19, 2017", "Summary": "\"Loved It , But I'm Just Looking For Something Better .\"", "Pros": "Cashier , Drive Thru , Speaking To Customers With Very Much Respect", "Cons": "Nothing foreal , ! Just got to be able to mainstain respect"}, "6": {"Date": " Jul 24, 2017", "Summary": "\"Old and outdated\"", "Pros": "The name \"McDonald's.\" The people I worked with. The flexibility of telecommuting.", "Cons": "McDonald's is a giant company so it's easy for you to get lost and your work to not be appreciated. Our Chief People Officer at the time had no HR background and out of the 2 years I was there she stopped by to say hi once. The recruiting system is slow and outdated. The onboarding system is even worse. IT doesn't assist you with setting your work desk, you have to do everything yourself or have a colleague help you. They restructured quite a few times and created new roles with no clear direction or support. Upper management lacks communication. Everything is we must \"wait and see.\" A lot of people jumped ship because of the old and outdated culture."}, "7": {"Date": " Jul 3, 2017", "Summary": "\"Unbearable\"", "Pros": "Easy Work, but not much else.", "Cons": "Terrible Working Conditions, terrible management, overall disgusting hours. Worked at least 43 hours a week while part time."}, "8": {"Date": " Jun 14, 2017", "Summary": "\"Great first job!\"", "Pros": "You become a family with and share a bond with all the workers.", "Cons": "Customers are rude. Some people won't like you for no reason, but that's anywhere."}, "9": {"Date": " Jun 18, 2017", "Summary": "\"Shift Supervisor\"", "Pros": "Flexible Schedule would be opportunity for staff.", "Cons": "Long Hours can be very hard on the staff"}}