{"0": {"Date": " Sep 17, 2016", "Summary": "\"Easy money\"", "Pros": "Will get hired quick. Easy job easy paycheck. Company that will provide you with free/ discount food.", "Cons": "Not that good pay but will get reviewd every 6 months"}, "1": {"Date": " Sep 1, 2016", "Summary": "\"Mcdonalds review\"", "Pros": "Easy JobNOt many hourseasy to get job", "Cons": "sometimes the people are annoyingyou can get fired easliy"}, "2": {"Date": " Sep 2, 2016", "Summary": "\"customer service\"", "Pros": "free food and flexible schedule", "Cons": "nothing really. You set your own limits."}, "3": {"Date": " Oct 7, 2016", "Summary": "\"I got Tooken advantage of and disrespected constantly.\"", "Pros": "Some customers where nice.Free foodLocationDon't require experienceNo diploma16 or olderGood payNothing really much more this job sucks", "Cons": "No hoursComplete DisrespectDo more than your job descriptionPeople think just because you work here you can be yelled at by them and remake there stuff for no reason ."}, "4": {"Date": " Sep 17, 2016", "Summary": "\"Realy not wroth it\"", "Pros": "bad managementno pair vacation even after yers of working there", "Cons": "no benefitsunreasonable hoursI worked full time and they had me as part time so I would get benefits"}, "5": {"Date": " Sep 1, 2016", "Summary": "\"Good Experience\"", "Pros": "gain experience in the fast food industry to start, if you are interested you can go up as a shift manager", "Cons": "Not very high wages, but you can get experience, sometimes schedules could be complicated."}, "6": {"Date": " Sep 1, 2016", "Summary": "\"Good Co To Work When In HS\"", "Pros": "-Very Good Co To Work For, Especially When in HS-Fast Pacing Job,", "Cons": "-Co-Workers Can Be a (You Know What) Somewhat, But Its Tolerable-If You Are Under (What Ever The Age is Again) You Are NOT Offered a 401K Benifit"}, "7": {"Date": " Sep 2, 2016", "Summary": "\"Cashier\"", "Pros": "Team environmentMoneySomething to do instead of laying around all dayFood discount is sweet", "Cons": "How people view youNo upward mobilityWork makes you hate yourself"}, "8": {"Date": " Sep 2, 2016", "Summary": "\"Good\"", "Pros": "Good management and good hours", "Cons": "rude customers low pay messy"}, "9": {"Date": " Sep 15, 2016", "Summary": "\"College Job\"", "Pros": "You get as many hours as you can handle.Half off of food .", "Cons": "The pay sucks they give you the minimum , over worked and under paid ,"}}