{"0": {"Date": " Jun 24, 2016", "Summary": "\"Been there done that\"", "Pros": "Some good people in places, but not allGood BenefitsReasonable Work / Life Balance", "Cons": "Lifers and Corporate climbers willing to trash anyone in their pathPolitics often trump rationalityEverything and everyone is disposable mindset"}, "1": {"Date": " Jun 25, 2016", "Summary": "\"Not great, not bad to work for\"", "Pros": "This was an okay company to work for. It wasn't the greatest, but I was lucky because I had a good manager that treated me fairly and taught me about business.", "Cons": "Often times we were short staffed and so people ended up running around and doing several jobs. This was sometimes nice, because it gave me a lot of different experiences, but most the time it was super stressful."}, "2": {"Date": " Jun 25, 2016", "Summary": "\"Good temporary job\"", "Pros": "Fast pacedFun, at firstYou get to see people that you know", "Cons": "You don't get paid enough, but it's fast food so you can't really complain"}, "3": {"Date": " Jun 25, 2016", "Summary": "\"Crew member\"", "Pros": "close with employeesno day is ever the sameraise every 6 months", "Cons": "low paycustomers can be rude"}, "4": {"Date": " Jun 10, 2016", "Summary": "\"Crew member Kitchen , Line assembly\"", "Pros": "coworkers are nice also some managers, I think there are bonuses for students if you ask", "Cons": "pay and really fast pace, most white people are slower than foreigners, some managers are mean, schedule, they raise your hour pay twice a year you get between 5 and 15 cents por raise"}, "5": {"Date": " Jul 16, 2016", "Summary": "\"Former Shift Supervisor\"", "Pros": "A free meal a day.", "Cons": "~Horrible Management.~Low Pay.~Bad employee retention because half - wait no 90% of the time you are thrust into this pit of hell without any formal training.~Often when you actually ARE a good employee and they promise to work you up, they lie, or don't follow up on their promises to train you.~Working environment is abysmal; so much negativity emanating from the managers which trickles down into ordinary employees."}, "6": {"Date": " Jun 25, 2016", "Summary": "\"\"McDonald's Crew Member\"\"", "Pros": "50% employee's discount, flexible, friendly atmosphere and customers", "Cons": "no breaks or increase in pay for the overnight shift, the occasional rude customer, shift prior to mine leaving work area a mess or not stocking, not much employee satisfaction or interest in company, messy and greasy environment"}, "7": {"Date": " Jun 25, 2016", "Summary": "\"Not worth it.\"", "Pros": "The only good thing is that hiring manager will work with you with your schedule. Whatever you get will most likely be the schedule you get stuck unless you request hours. On top of that, free uniform and employee meal if you dont each much like I do in the mornings.", "Cons": "Calling days off isnt impossible but people act like you messed up the entire restaurant if you do even though co-workers and management makes you feel like you dont mean much while half the employees shows up late every day and call days off. Also, managers acts like they're the only ones who gets vacation which is not true though will not tell you crew members can get vacation.Depending on which restaurant you worked in (I worked at two) you have to deal and do a lot for bad pay. First McDonald's job had me do maintenence work even though I got hired for grill. I cleaned lobby including restrooms, cleaned over filled grease traps, having to change difficult Coca-Cola tanks, etc. Nobody else did it. Not morning shift nor overnight.Little to no pay raise. To get anything REMOTELY good you really need to be working 3 years. Was told theres supposed to be meetings ever 6 months, which is false."}, "8": {"Date": " Jun 10, 2016", "Summary": "\"Cashier\"", "Pros": "Flexible schedule always clean training was great", "Cons": "Under paid and over worked"}, "9": {"Date": " Jun 10, 2016", "Summary": "\"Cashier\"", "Pros": "Good pay , friendly environment, co-workers", "Cons": "too hot some times , other than that I loved it"}}