{"0": {"Date": " Apr 24, 2017", "Summary": "\"mistake\"", "Pros": "free lunch with every shift worked", "Cons": "the manager was a witch"}, "1": {"Date": " May 14, 2017", "Summary": "\"Eh.\"", "Pros": "Learn to be really fast at making sandwiches.", "Cons": "Free Food (easily get overweight)Management sucks."}, "2": {"Date": " Apr 23, 2017", "Summary": "\"Not the worse, you know when you are out of options.\"", "Pros": "I worked here for 3 weeks back in 2015 as a crew memberFree uniform, free meal for your lunch if your working. They handed me a book of discounts I could use at different places. Even if is not my favorite place for working I'm grateful because they don't require any experience at all and it was my first job ever. Working here made me remember that I needed to go back to school.", "Cons": "Let start from the beginning; the application: it takes more than two hours! and they ask question about stuff that are no relative. The manager was very rude and she lied to me about her name the day of the interview she used another manager's name. I used to burn my hands almost everyday and the smell couldn't get it off me. I was so miserable. You'll be require to watch your hands and change gloves every 15 minutes, but can't take too long because you are also require to complete every order on time. Huge lack of communication; the book of discount I was given couldn't even use because my username or something was wrong and I requested assistance and they never help me with it or explain me what was happening because they were always busy but even if they could of help me I wasn't even going to be able to to use it because I was always working even though I applied for just part-time! they were under staffing because almost everyone was quitting and calling off and it was horrible because I had to do all the work without even knowing what I was doing. No consideration towards their employees; I had a bike accident while I was off end up with bruises all over my arms and one of my hand and next day showed up to work and they still made me wash the dishes. Only 30 minutes for lunch and when you work a full shift that's just isn't enough. Just too stressful! People come all at once."}, "3": {"Date": " Apr 8, 2017", "Summary": "\"Not bad\"", "Pros": "Good people, Pick up shifts if needed", "Cons": "Grill in the summer means you'll get very hot"}, "4": {"Date": " Apr 8, 2017", "Summary": "\"Corporate McDonald's is a great company to work for\"", "Pros": "They care about their employees as a company and there are good benefits.", "Cons": "Management can be not so great depending on the individual store"}, "5": {"Date": " Apr 9, 2017", "Summary": "\"Great first job\"", "Pros": "Very flexible hours and nice co workers", "Cons": "Customers were kind of snappy"}, "6": {"Date": " Apr 22, 2017", "Summary": "\"Inner management was awful, alright aside from that.\"", "Pros": "Job was easy to pick up. A good chunk of my coworkers were nice to work with. Was generally easy to balance scheduling issues, though always talk to management about it.", "Cons": "Issues with those who ran the franchise. Store manager that was generally well liked by everyone at the store got backstabbed out of the store by the regional manager. Replaced by catty, uppity person. Loyalty means absolutely nothing, no matter how much they'll ask you for it. Same general customer issues you'll have in retail(a lot have no respect for you and complain about everything, try to get stuff for free)"}, "7": {"Date": " Apr 7, 2017", "Summary": "\"Good food\"", "Pros": "Drugs, Weed, Beer, LSD, Sex", "Cons": "ice cream machine keeps breaking"}, "8": {"Date": " May 14, 2017", "Summary": "\"McDonald's\"", "Pros": "Some people were nice and others we mean. It's easy to get a job there", "Cons": "People are rude to customers and workers always disrespectful to each othet"}, "9": {"Date": " Apr 7, 2017", "Summary": "\"would recommend\"", "Pros": "Employees are very nice and are always looking for improvement.", "Cons": "Break room is very small."}}