{"0": {"Date": " Oct 24, 2016", "Summary": "\"Crew Member\"", "Pros": "Half off discount on everythingSalary", "Cons": "Rude customersUncooperative managersTough hoursSmall workplaceNo worker's compensation"}, "1": {"Date": " Oct 25, 2016", "Summary": "\"McDonalds\"", "Pros": "There's was barely anything good to say about them. There was a manager who always tried to make sure we were doing the right and when we did, he rewarded us with trips.", "Cons": "Lazy coworkers, whom was always saying that's not my job when it came to cleaning. People were barely working."}, "2": {"Date": " Oct 10, 2016", "Summary": "\"Great company. Great Brand to work for!\"", "Pros": "Great! Culture, People first attitude", "Cons": "Restructuring, Business decisions sometimes force difficult decisions"}, "3": {"Date": " Oct 10, 2016", "Summary": "\"Manager\"", "Pros": "Great people. Flexible time off.", "Cons": "They have a hard time finding reliable help."}, "4": {"Date": " Nov 14, 2016", "Summary": "\"Terrible management\"", "Pros": "Literally no pros. Just the fact that you have a job. Other than that, the location I worked at was terrible.", "Cons": "Terrible managers. Rude, condescending, aggressive, and terrible leadership skills. Managers at my location were always gossiping about team members and always yelled at customers."}, "5": {"Date": " Nov 14, 2016", "Summary": "\"Horrible\"", "Pros": "You learn customer service skills, and how to manage being treated like crap.", "Cons": "Everything. You WILL be discriminated against, and unless you can actually get in contact with a representative for Mcdonalds that has no direct affiliation with your owner, you won't ever be heard. Good Luck. That is pretty much why Mcdonalds is considered a joke."}, "6": {"Date": " Oct 24, 2016", "Summary": "\"Cashier\"", "Pros": "There is good pay at $15 and I got free drinks, because drinks are hard to count for", "Cons": "It is a very fast-paced environment and drains a lot out of you; and of course many rude and downright crazy customers"}, "7": {"Date": " Oct 24, 2016", "Summary": "\"Bronx Mcdonalds\"", "Pros": "Weekly pay30 minute breaks2 days off a wek", "Cons": "Lack of respectLack of professionalism"}, "8": {"Date": " Oct 24, 2016", "Summary": "\"Mc.donalds\"", "Pros": "It's a job the team was great. Decent hours that's always nice. Wasn't so bad and vibes were good", "Cons": "Pay could of been better, managent could of been better needs improvement and stuff"}, "9": {"Date": " Oct 9, 2016", "Summary": "\"not bad\"", "Pros": "Not as bad as people think. Just a regular food service job.", "Cons": "management could be inflexible at times."}}