{"0": {"Date": " Jan 17, 2017", "Summary": "\"Okay\"", "Pros": "Semi flexible work schedule, decent living wage, great classes that focus on building the/a business, ability to develop a team,", "Cons": "Because it's franchise-owned, the benefits package isn't necessarily the best. There isn't always support from Supervisor's and it's hard to balance work and life. Make sure the team you have is competent or it's difficult to have a family."}, "1": {"Date": " Jan 17, 2017", "Summary": "\"Crew\"", "Pros": "Flexible hours and gaining basic job skills.", "Cons": "Breaks were not mandatory unfortunately."}, "2": {"Date": " Jan 17, 2017", "Summary": "\"Easy Going\"", "Pros": "They were flexible with my schedule, all my co workers were very nice and helpful", "Cons": "Low pay, the customers are sometimes rude but you have to put it up with it no matter what."}, "3": {"Date": " Jan 18, 2017", "Summary": "\"Hard Work, Low Pay, Lots of hours\"", "Pros": "Lots of hours to be picked upGreat Coworkers", "Cons": "Extremely tense enviormentSome team members don't put in effort"}, "4": {"Date": " Feb 7, 2017", "Summary": "\"Gross\"", "Pros": "The environment promoted team work", "Cons": "Management was not helpful in resolving disputes"}, "5": {"Date": " Jan 18, 2017", "Summary": "\"Okay\"", "Pros": "Good entry level, Flexible hours", "Cons": "Pay, Advancement, That's about it."}, "6": {"Date": " Jan 2, 2017", "Summary": "\"crew member\"", "Pros": "the customers were so rude", "Cons": "they have great service"}, "7": {"Date": " Jan 3, 2017", "Summary": "\"Shift Manager\"", "Pros": "-All of my staff is friendly, and they don't argue with me when I ask them to do something-My pay is pretty decent and the benefits under my current owner are pretty decent (we're a franchise), but this does vary from owner to owner. I will say if you work at a franchise McDonald's, you should go for owners who have multiple McDonald's they will have more revenue to work with thus giving you a decent.", "Cons": "The list is endless but I'll keep it to 4:1. Customers are a-holes2. There is ALWAYS something wrong with a piece of equipment, unless they're on top of it constantly.3. When you are down (they call out) a few people it really sucks. You get slammed and can't get side work done without stopping in the middle of a huge rush. Then you get yelled at by your higher-up, which is always so fun.4. Maintaining high quality of food is hard at some points, especially when your trying to avoid wasting too much food. I personally close every night and at my location it tends to be super slow at night so we don't make a lot of food. It usually always expires with a lot of it let in the cabinets."}, "8": {"Date": " Jan 16, 2017", "Summary": "\"Crew\"", "Pros": "40 hours a weekeasy duties", "Cons": "Was not flexible with schoolWork with breaks"}, "9": {"Date": " Jan 16, 2017", "Summary": "\"Crew\"", "Pros": "Food tastes good and stay busy", "Cons": "Not much rate of pay"}}