{"0": {"Date": " Nov 4, 2016", "Summary": "\"Mcdonalds\"", "Pros": "It was a great first job experience", "Cons": "Mcdonalds has a low wage"}, "1": {"Date": " Nov 4, 2016", "Summary": "\"general manager\"", "Pros": "Easy to move up in the company", "Cons": "You make more money if your a male"}, "2": {"Date": " Nov 4, 2016", "Summary": "\"Manager\"", "Pros": "Good discounts nothing else", "Cons": "Corrupt low pay mean bosses better benefits"}, "3": {"Date": " Oct 17, 2016", "Summary": "\"Shift Manager\"", "Pros": "Flexible hours, friendly co-workers. Raise's every 6 months and a good starting wage.", "Cons": "High turnover meant everyone gets stretched thin trying to make up for lack of staff. Not staffing enough people for open/close shifts. GM was unwilling to take over in the middle of my shift one night even though I was vomiting and none of the other shift managers were available."}, "4": {"Date": " Oct 19, 2016", "Summary": "\"Employee\"", "Pros": "Fast pace environment, lots of interaction with customers and the organization itself. Opportunity to move positions.", "Cons": "Sometimes long hours, intense, speedy. Sometimes there is a high turnover rate so there are many new people learning positions."}, "5": {"Date": " Nov 3, 2016", "Summary": "\"McCrew Member\"", "Pros": "Higher salary, works with schedule", "Cons": "Workers come and go and treated poorly by a lot of customers."}, "6": {"Date": " Nov 3, 2016", "Summary": "\"Awesome!\"", "Pros": "Great Pay! Awesome employment benefits and amazing coworkers !", "Cons": "There are no cons to the job!"}, "7": {"Date": " Nov 3, 2016", "Summary": "\"Crew trainer\"", "Pros": "Worked with lots of good ppl.", "Cons": "Manager didn't know how to run the place employees ran it."}, "8": {"Date": " Oct 19, 2016", "Summary": "\"Orientation Manager\"", "Pros": "Flexible work schedule, meeting new people", "Cons": "Communication between Supervisor and Management needs to be better"}, "9": {"Date": " Oct 19, 2016", "Summary": "\"Swing Managers\"", "Pros": "There are flexible hours available.", "Cons": "The pay for Swing Managers is not much more than minimum wage."}}