{"0": {"Date": " Apr 9, 2017", "Summary": "\"McDonald's Crew Member\"", "Pros": "Flexible schedule, easy job, chances to advance easily", "Cons": "No consistency between management, unfriendly co-workers,"}, "1": {"Date": " Apr 9, 2017", "Summary": "\"Satisfactory work environment\"", "Pros": "The brand name is what you get from here", "Cons": "Salary is a little low"}, "2": {"Date": " Apr 9, 2017", "Summary": "\"Decent first job\"", "Pros": "Coworkers are fun which makes time go by faster and you get discounted food.", "Cons": "When it gets busy, It get's stressful when customers get crabby at you for no reason."}, "3": {"Date": " Mar 26, 2017", "Summary": "\"I liked it\"", "Pros": "People you work with are the realest people you will ever meet", "Cons": "The discount is addictive"}, "4": {"Date": " Apr 30, 2017", "Summary": "\"sucks\"", "Pros": "half price food that is a good benefit, can't even get free food for the cheap stuff they give", "Cons": "don't work here, it is very bad, some of the managers treat you really bad and you will find it unpleasant at times."}, "5": {"Date": " Mar 25, 2017", "Summary": "\"Good and the bad\"", "Pros": "Easy job to start while in school to make extra money", "Cons": "Open door policy suck"}, "6": {"Date": " Mar 26, 2017", "Summary": "\"Good expeirance\"", "Pros": "A good entry level job", "Cons": "Fast paced but not too hard"}, "7": {"Date": " Mar 26, 2017", "Summary": "\"It is a great option for a first time job, you learn many things that will help you in the future.\"", "Pros": "You gain experience in customer service as well as in the food industry that will help you gain a job when you are ready to leave, if you desire to.", "Cons": "Sometimes you are short staffed which will make everything go slower most often with mistakes. This causes customers, managers, and employees to get upset."}, "8": {"Date": " Mar 26, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Good first job, they don't care about much, good If you have friends who work there too. Very easy.", "Cons": "The smell, greasy floors, dirty cooking station"}, "9": {"Date": " Apr 8, 2017", "Summary": "\"Unappreciated employee's\"", "Pros": "Very busy never gonna be board.", "Cons": "They think everyone is replaceable so they dont care to much about their employees."}}