{"0": {"Date": " Jan 17, 2017", "Summary": "\"Mc\"", "Pros": "Good food nice people great", "Cons": "Hated the people nasty food no benefits rude employers"}, "1": {"Date": " Feb 7, 2017", "Summary": "\"No room for growth\"", "Pros": "Consistent hours with flexible scheduling", "Cons": "poor management with shady business practices"}, "2": {"Date": " Jan 1, 2017", "Summary": "\"Cashier\"", "Pros": "Flexible scheduling, great co-workers+managers, opportunity to advance. This is a good job for students.", "Cons": "Minimum wage. There were managers that had been there for 10+ years that hadn't got a raise for years. I always did the best I could, but I was under-appreciated. I never got a raise. 30 min breaks, and we could only pick 3 items from the dollar menu. The exact combination was a parfait, or fry, a burger, and small drink. You were not allowed to pick any other combinations even if it was from the dollar menu."}, "3": {"Date": " Jan 15, 2017", "Summary": "\"Okay place to work\"", "Pros": "Good first job for young adult. You get some good benefits. Great on a college application. Nice extra money in my pocket.", "Cons": "The pay is terrible considering all the work that you do. You smell like grease even if you wash your uniform. Mean costumers"}, "4": {"Date": " Jan 15, 2017", "Summary": "\"Cashier\"", "Pros": "It is easy and the people are fun. They have scholarship opprtunities and room fit advancement. A good experience to be a part of!", "Cons": "The starting pay is bad. They ask you to wear many hats and be good at all aspects of the job. You could be making burgers one minute and cleaning the bathroom the next."}, "5": {"Date": " Jan 15, 2017", "Summary": "\"Good for earning experience\"", "Pros": "Usually very easy to get a job at Mcds. If you work hard you will learn most things you need to to within a month or two", "Cons": "Poor training, low wages, poor management in some cases"}, "6": {"Date": " Jan 15, 2017", "Summary": "\"Register worker\"", "Pros": "You get to talk to people and have the opportunity to brighten there day. Some people really value and appreciate you.", "Cons": "Work is mundane and repetitive. Coworkers are not always motivated. This becomes tiring and does not help to make you feel like your job is being performed as well as it could be."}, "7": {"Date": " Jan 15, 2017", "Summary": "\"Top Management Not What it Used to Be\"", "Pros": "Overall benefit package is shrinking, but is still one of the best overall compensation packages of any company", "Cons": "As sales and profit have diminished management is cutting people and creating poor morale and constant fear that jobs may be eliminated, regardless of performance"}, "8": {"Date": " Feb 6, 2017", "Summary": "\"You can do better\"", "Pros": "Co-workers were great people and the location was really close to my home.", "Cons": "The managers sometimes did not follow regulations and you could get into unnecessary trouble. Some customers were rude."}, "9": {"Date": " Jan 16, 2017", "Summary": "\"Not Great\"", "Pros": "Fairly easy to get a job. Training was easy for the most part.", "Cons": "Corporate was rude and did not respect employees at all. Management is a joke."}}