{"0": {"Date": " Feb 3, 2018", "Summary": "\"Good\"", "Pros": "flexibility, salary, schedule, location, team", "Cons": "no cons that I can think of"}, "1": {"Date": " Mar 12, 2018", "Summary": "\"Crew\"", "Pros": "Flexible Schedule, able to accommodate my school fairly easily.", "Cons": "Over workedUnder paidSupervisors were unprofessional and very rude.Expect too much for such little pay"}, "2": {"Date": " Feb 3, 2018", "Summary": "\"They were pretty good to me\"", "Pros": "Co-workers are pretty fun to work with, bosses were okay, conditions ok, job you had to do to clean up were pretty okay, and other.", "Cons": "terrible/rude/obnoxious customers, some of the bosses, and other."}, "3": {"Date": " Feb 17, 2018", "Summary": "\"It was good\"", "Pros": "It can help you in your future by teaching you hardworking fundamentals. I had a good time working at McDonald’s", "Cons": "Dealing with dumb and impatient customers occasionally but you learn to get used to it because they have nothing better to do with their lives"}, "4": {"Date": " Feb 17, 2018", "Summary": "\"hello\"", "Pros": "i like it its ok it pays", "Cons": "it stinks, greasy food irritating customers"}, "5": {"Date": " Feb 18, 2018", "Summary": "\"Cashier\"", "Pros": "Good pay, good team work", "Cons": "Not giving the hours you are expected to have."}, "6": {"Date": " Feb 3, 2018", "Summary": "\"Work\"", "Pros": "Great place to work at. Friendly atmosphere", "Cons": "Can sometimes become overwhelmed if your not paying attention"}, "7": {"Date": " Feb 16, 2018", "Summary": "\"Good first job but you get burnt out fast (at least depending on management)\"", "Pros": "Can be flexible with work scheduleEasy first jobYou will meet lots of new peopleBuilding relationships with the regularsIf you work hard they will probably promote you to managementDepending on management.. You can have awesome leaders who really do care about you and the team", "Cons": "Fast pacedStressful at times.. Especially if in management..Although they can be flexible with your schedule they will want you to work all the time when your freeThere are definitely favorites but I feel that goes with most jobs"}, "8": {"Date": " Feb 16, 2018", "Summary": "\"Cook\"", "Pros": "The pros of working at Micky Ds include flexible hours.", "Cons": "The worst part about working atMcdonalds is dealing with dumb customers."}, "9": {"Date": " Feb 1, 2018", "Summary": "\"crew member\"", "Pros": "many job promotion and opportunity", "Cons": "stressful and faster place to work"}}