{"0": {"Date": " Apr 21, 2017", "Summary": "\"Shift Manager\"", "Pros": "easy, flexible hours, good job to start", "Cons": "since it's a job high schoolers work at it can be a really gossipy work environmentkinda gross and most of the management team took their frustrations out on the crew"}, "1": {"Date": " Apr 21, 2017", "Summary": "\"It is mcdonalds\"", "Pros": "part timegood first jobmake friends", "Cons": "didnt work with anybody very much on what hours they are available"}, "2": {"Date": " Apr 21, 2017", "Summary": "\"McDonalds\"", "Pros": "Very Flexible schedule. Starting above minimum wage about $8.50 an hour.", "Cons": "Very little room for growth and low raises. Raises happen every six months and usually amount to about 10 or 15 cents at the most. After working for appx. two years I was only making a little over $9 an hour"}, "3": {"Date": " Apr 22, 2017", "Summary": "\"Cook\"", "Pros": "Starter job, food discount, fun work environment", "Cons": "Hours all over, family time, bad pay"}, "4": {"Date": " Apr 6, 2017", "Summary": "\"--\"", "Pros": "- Nice atmosphere- Good food", "Cons": "- Salty- Sugary- Too much- Guts"}, "5": {"Date": " Apr 6, 2017", "Summary": "\"Happy meal expert\"", "Pros": "Food was good and it was fun", "Cons": "Pay was low and hard to pay the bills"}, "6": {"Date": " Apr 6, 2017", "Summary": "\"Crew Trainer/Cashier\"", "Pros": "Nice & Friendly Environment. Easy and Cooperative management to work with.", "Cons": "Compensation is not competitive."}, "7": {"Date": " Apr 6, 2017", "Summary": "\"Overall I've had a good experience. It does not pay much but it's great because they work with your schedule.\"", "Pros": "Flexible scheduling. Everyone has an opportunity to be promoted if they work hard enough. Pay is based on employee performance.", "Cons": "Staffing is always a problem. Many of the employees have a limited availability so it's difficult to staff a store everyday."}, "8": {"Date": " Apr 7, 2017", "Summary": "\"Good starter job\"", "Pros": "Allowed me to enter the workforce at a young age.", "Cons": "Customers are not always nice."}, "9": {"Date": " Apr 20, 2017", "Summary": "\"Shift Manager\"", "Pros": "You meet some awesome people! You also get to interact with our \"regulars\" and some of them are super nice!", "Cons": "You get people who use this job as a joke and then they make your shift more complicated. Also the shift manager I have talks to you like you are dumb and gives you attitude all the time which is annoying."}}