{"0": {"Date": " Mar 28, 2017", "Summary": "\"Team Leader\"", "Pros": "Lots of learning and education offered, loads of items to know and love. People were amazing!", "Cons": "I was there a short time, they worked as a team to see what I was capable of and I had the full support of all management, NO Cons to report"}, "1": {"Date": " Mar 27, 2017", "Summary": "\"Crew Trainer\"", "Pros": "The employees are fun to be around and the hours are very flexible.", "Cons": "This store has a hard time of keeping GM's, they only last about 6 months."}, "2": {"Date": " Apr 11, 2017", "Summary": "\"Stepping stone.\"", "Pros": "They payed.Not a hard job.", "Cons": "Depends store to store.Customers can be terrible."}, "3": {"Date": " Apr 11, 2017", "Summary": "\"McDonald's\"", "Pros": "Meet new people and receive discounts", "Cons": "Hot,long hours, low pay, and people get mean."}, "4": {"Date": " May 1, 2017", "Summary": "\"work you to death\"", "Pros": "free/ discounted food and flexible shifts", "Cons": "the McDonalds i worked at was always understaffed so they would call you in on your off days. Managers will talk to you disrespectfully and will threaten to fire you if you respond or don't do what they want you to do. Favoritism is extremely high. every unenjoyable play to work at. they try to make it seem like the workers are happy but 99% of the smiles are forced and you will be sent home if you dont smile."}, "5": {"Date": " May 1, 2017", "Summary": "\"Horrible place to work\"", "Pros": "The year I was employed I could receive free food", "Cons": "You work hard for little to nothing pay."}, "6": {"Date": " May 2, 2017", "Summary": "\"sucked\"", "Pros": "none because I hated working there", "Cons": "EVERYTHING because it all sucked"}, "7": {"Date": " Mar 26, 2017", "Summary": "\"patience with people required\"", "Pros": "Great management training and guidance", "Cons": "customers can be pretentious"}, "8": {"Date": " Mar 26, 2017", "Summary": "\"Good place to work\"", "Pros": "As a manager, received excellent bonuses and benefits, many management classes (as well as trip to Chicago to Hamburger University) where I received several college credits. And speaking of college credits, McDonald's has teamed up with Colorado Technical University so that they pay 43% of your tuition. I learned many things through this company and have few regrets.", "Cons": "As a GM, you are never really off. It is 24/7, 365 days a year (364 if closed on Christmas. Forget your weekends."}, "9": {"Date": " Mar 27, 2017", "Summary": "\"Good for teenager\"", "Pros": "Lots of hours. Other fast food places wont give you as many hours since there is so much business(dependent on location).", "Cons": "Easy to get fat of the food."}}