{"0": {"Date": " Jun 1, 2016", "Summary": "\"fry guy\"", "Pros": "get free fries, get to meet Ronald Mcdonald", "Cons": "Hot, smells like fry's"}, "1": {"Date": " May 17, 2016", "Summary": "\"McDonald's Employment\"", "Pros": "Management was good. Liked working 2nd shift. Liked serving customers.", "Cons": "Didn't like working1st shift. The reason why is because I'm not a morning person so it took me a little while to get motivated"}, "2": {"Date": " Jun 23, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Eating the food, usually you get long hours", "Cons": "You hate everything and everyone."}, "3": {"Date": " Jun 1, 2016", "Summary": "\"There are better jobs than this.\"", "Pros": "+Get to talk to new people everyday", "Cons": "-Disgusting store-Bad management-Overall bad experience"}, "4": {"Date": " Jun 2, 2016", "Summary": "\"never again\"", "Pros": "Flexible hours. A decent work/life balance. Not hard to move up to management. Had 3 friends move up and they are not exact;y what one would call the sharpest glass of a broken window.", "Cons": "Somewhat stressful for minimum wage. If your coworkers are a pain, the entire ride is going to suck (like mines). 5 different people telling you 7 different ways to do one thing (aka lack of communication)."}, "5": {"Date": " May 30, 2016", "Summary": "\"McDonald's is an easy job\"", "Pros": "There are several different stations one could work within the company at base pay. Drive thru cashier, cook, dish washer, front cashier, fryer, runner (bags food). Everyone helps to clean and stock (bags, sauces, toys etc.) wherever necessary.", "Cons": "Dealing with difficult customers from time to time. You do learn how to best deal with different personality types and situations. It can be a bother but you get used to it."}, "6": {"Date": " May 31, 2016", "Summary": "\"Pretty good job oportunity\"", "Pros": "Good pay for minors, and great experience.", "Cons": "Either over work you or don't work you enough"}, "7": {"Date": " May 31, 2016", "Summary": "\"It's alright.\"", "Pros": "Nice CoworkersMost Managers are NiceA Few Scholarship opportunities.", "Cons": "Too much cross- trainingCustomers are sometimes rude (But that's to be expected)If you need help with something, you get the runaround"}, "8": {"Date": " May 31, 2016", "Summary": "\"pretty good first job\"", "Pros": "You do what you need to do", "Cons": "some of the machines break and beep all day long"}, "9": {"Date": " May 31, 2016", "Summary": "\"Great\"", "Pros": "I got paid to get through college, and it was honestly well worth it.", "Cons": "rude people, and bad working conditions made it hard to enjoy my job"}}