{"0": {"Date": " Apr 23, 2017", "Summary": "\"Cert crew trainer\"", "Pros": "A pay check. And hours", "Cons": "Over worked and under paid no team work"}, "1": {"Date": " Apr 2, 2017", "Summary": "\"First Job, what can you expect?\"", "Pros": "Free Food, Meet People of Similar Age", "Cons": "Just about every other facet"}, "2": {"Date": " Apr 1, 2017", "Summary": "\"Fry Cook\"", "Pros": "No experience needed, Gain experience dealing with difficult customers.", "Cons": "Repetitive work, obviously low pay."}, "3": {"Date": " Apr 2, 2017", "Summary": "\"Store manager\"", "Pros": "Great work experience, family friendly environment Definitely works with your schedule if you have school, or do sports.", "Cons": "Depending on your location you can really enjoy your job or dread it, however it's not a bad company to get involved with."}, "4": {"Date": " Apr 2, 2017", "Summary": "\"Hours\"", "Pros": "The hours I worked were very flexible. A great first job to gain customer service experience for you to add on your resume", "Cons": "There are only two things I can think of. The isn't the best and you go home smelling like fast food"}, "5": {"Date": " Apr 22, 2017", "Summary": "\"Terrible & Unprofessional Environment\"", "Pros": "-a team-like atmosphere as in that's how it should be to be the most efficient and customer - pleasing, but unfortunately I ended up doing a good portion of the work myself", "Cons": "-Unprofessional boss-dramatic, unprofessional, immature employees-terrible conditions for food prep (roaches, during cricket season crickets fell in the grease and upon my inquiry as to whether or not we could change the grease, I was told the hot temperature would sanitize it from the cricket germs) that I'm sure customers would be appalled to find out-not paid according to the workload you take on--basically, when you do all the work to at least try and make the customers happy, you get taken advantage of to work more hours than your schedule allows-your schedule and needs as an employee are not taken into account-some managers are rude to employees so much that customers call the main office and complain about treatment of employees-immature employees walk out of work, leaving the few good employees to handle the fast-paced busy environment extremely short-handed-schedule/shift is made extremely short-handed to meet labor and this makes customers unhappy with the slow service and indecent food-higher-ups in the company ask you to change your hours as a floor supervisor or you'll be demoted (a floor supervisor is a position with limited availability)-basically no interview, application isn't even viewed which means consistently bad hires and no prior knowledge of the good hires-made to clean for days before a health inspection instead of just keeping clean operation at all times-anyone is promoted, meaning incompetent, immature, careless management for the most part"}, "6": {"Date": " Mar 17, 2017", "Summary": "\"Not a bad place to start\"", "Pros": "Free meal a day, (consisting of an entrée a side and a drink or dessert), half off food in your off time, McDonald's discount program with partnering companies, very flexible hours", "Cons": "You have to be good at multitasking, and good with people, not expect too many hours and have an open mind, you deal with many people from many different backgrounds"}, "7": {"Date": " Mar 17, 2017", "Summary": "\"Decent\"", "Pros": "Free Food, and it was really good", "Cons": "People were mean working there mostly"}, "8": {"Date": " Mar 17, 2017", "Summary": "\"Great job\"", "Pros": "Work with nice peopleFast pace never boredGiod pay", "Cons": "Long hoursCustomers can be a hassleNot a lot of time to yourself"}, "9": {"Date": " Mar 17, 2017", "Summary": "\"Great First Job\"", "Pros": "Flexibility in schedulesGreat environmentEasy tasks", "Cons": "High-intensity work with very little pay."}}