{"0": {"Date": " Apr 16, 2016", "Summary": "\"Good Starting Job\"", "Pros": "Great restaurant. Intro to the fast food industry.", "Cons": "Don't get paid super high but it's expected. Not a top job by any means."}, "1": {"Date": " Apr 29, 2016", "Summary": "\"Pretty Okay\"", "Pros": "Not really much to say here, typical fast food job. The main pro is that these jobs are easy to get.", "Cons": "Service industry is not fun. Sometimes the hours can be a bit unflexible. You may also get unlucky and have a bad shift."}, "2": {"Date": " Apr 29, 2016", "Summary": "\"Ehh\"", "Pros": "Free uniforms fun place to good customers", "Cons": "Long hours no understanding to family"}, "3": {"Date": " Apr 29, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Meet interesting people, gain cash handling skills", "Cons": "Having to clean the fry vats, I burnt myself multiple times. So much grease and waste."}, "4": {"Date": " Apr 30, 2016", "Summary": "\"Cashier\"", "Pros": "It is a great place for advancement in a company. The people you work with and the customers are great.", "Cons": "Some of the down sides are when there aren't enough staff on duty during rush hour times. Or they aren't trained properly."}, "5": {"Date": " Apr 30, 2016", "Summary": "\"OK\"", "Pros": "flexible schedule and can be fun to work", "Cons": "managers can be mean, not very fun"}, "6": {"Date": " Apr 29, 2016", "Summary": "\"Manager\"", "Pros": "Fast Friday. Free food. Exciting customers", "Cons": "Low pay for hard work. Unappreciative people."}, "7": {"Date": " Apr 30, 2016", "Summary": "\"Crew Leader\"", "Pros": "The job was dumbed down tremendously. The drink machine made all the drinks and the fry machine was easy to do. If you have a brain you can work here.", "Cons": "The coworkers I had were not very good. Some of my coworkers were very hard workers, but some workers were there just to stand around and be rude to customers."}, "8": {"Date": " Apr 14, 2016", "Summary": "\"Crew\"", "Pros": "Love the people and also a fast paced environment that teaches how to work in any situation.", "Cons": "Stressful after long periods and heavy foot traffic"}, "9": {"Date": " Apr 14, 2016", "Summary": "\"nlkfbl\"", "Pros": "good food nice hours friendly", "Cons": "i hate people and working here"}}