{"0": {"Date": " Jul 12, 2017", "Summary": "\"decent job\"", "Pros": "it's great working for mcdonalds!", "Cons": "the hours are very long"}, "1": {"Date": " Jul 12, 2017", "Summary": "\"Smile!\"", "Pros": "It was cool, very cool.", "Cons": "Incentives sometimes backfire, I think."}, "2": {"Date": " Jul 26, 2017", "Summary": "\"crew member\"", "Pros": "if it's your first job it will be the best experience!", "Cons": "have to be prepared for a lot moving around! it's not a bad thing! but make sure you're always on your toes!"}, "3": {"Date": " Jul 26, 2017", "Summary": "\"Advice\"", "Pros": "The team you work with really determines the business of the store. I've had the pleasure of working with amazing people trying to grow", "Cons": "Although they claim to have flexible schedules and benefits it's not what it seems at all. If you aren't available to work when they want you to you won't get hours."}, "4": {"Date": " Jul 26, 2017", "Summary": "\"Bad Management\"", "Pros": "Good for school and home life", "Cons": "Boring work and you will eat more McDonald's"}, "5": {"Date": " Jul 26, 2017", "Summary": "\"Woodland McDonald's\"", "Pros": "This location has a large group of employee's ranging from 16 - 69, which really gives you a taste of different worlds. The environment is usually friendly, and the crew is fun.", "Cons": "Customers are incredibly rude. The GM, and owners kids are not in it for the people or the McDonald's mission. They only care about the money, and the ways that they will benefit."}, "6": {"Date": " Jul 11, 2017", "Summary": "\"Okay\"", "Pros": "There are none but if you do you job you will get your hours.", "Cons": "Busy, minimum wage,people don't come in on time."}, "7": {"Date": " Jul 11, 2017", "Summary": "\"Cook\"", "Pros": "Great Team of people that will work with you.", "Cons": "none just keep doing what y'all is doing"}, "8": {"Date": " Jul 11, 2017", "Summary": "\"Amazing time\"", "Pros": "So GOod time had such will do more to again", "Cons": "Not good cons to mention for this me to say"}, "9": {"Date": " Jul 12, 2017", "Summary": "\"Corporate McDonalds\"", "Pros": "Career advancement opportunities, pays more than competitors", "Cons": "Monotonous, lack of communication and appreciation not shown often enough"}}