{"0": {"Date": " Mar 23, 2017", "Summary": "\"Great place to work\"", "Pros": "Great people to work with", "Cons": "The opportunity to move up isn't that great"}, "1": {"Date": " Mar 23, 2017", "Summary": "\"McDonald's is very flexible and understanding of situations regarding scheduling.\"", "Pros": "Make friends, learn new skills, great starting job as a teenager. Easy to work way up if you give your best.", "Cons": "The pressure can be hard sometimes, costumers get mad at you for no reason, without communication there is no good service"}, "2": {"Date": " Apr 27, 2017", "Summary": "\"ugh\"", "Pros": "free food while you work. various kinds of people work there.", "Cons": "everything else, management, environment, compensation, unorganized management. They'll literally hire anyone, even if they're terrible."}, "3": {"Date": " Apr 6, 2017", "Summary": "\"McDonalds Review\"", "Pros": "- Good people- Fast paced environment", "Cons": "- Smelled like grease constantly"}, "4": {"Date": " Apr 6, 2017", "Summary": "\"Average not long term job\"", "Pros": "Flexible hours if you want to", "Cons": "Management is horrible . They expect things you can't control"}, "5": {"Date": " Mar 22, 2017", "Summary": "\"Great!\"", "Pros": "Wonderful Staff and good benefits", "Cons": "Work/Life balance and location of shop"}, "6": {"Date": " Apr 5, 2017", "Summary": "\"Great first job\"", "Pros": "Will hire with no previous experienceAble to quickly climb into managementGreat cross-trainingCan become valuable to an individual store very quicklySchedule works well with being a full time student", "Cons": "Low payConstantly on feetAbility to succeed depends entirely upon management personally liking youCustomers aren't always reasonable"}, "7": {"Date": " Apr 6, 2017", "Summary": "\"Department Manager\"", "Pros": "Opportunity for bonuses, insurance is available for managers. Scholarships available for students", "Cons": "Stressful at times, upper-management could be biggest downfall or greatest strength depending on the company."}, "8": {"Date": " Mar 22, 2017", "Summary": "\"Customer support\"", "Pros": "Good food great benefits great fun great music great fun great atmosphere great people great management I don't have much else", "Cons": "No cons it's a great place to work I have absolutely no complaints I love this place I don't have"}, "9": {"Date": " Apr 26, 2017", "Summary": "\"Bad\"", "Pros": "People there are nice sometimes.", "Cons": "Pretty much everything you can think of."}}