{"0": {"Date": " May 16, 2016", "Summary": "\"Good Job For Beginners\"", "Pros": "Great Working Environment for teens. Great organization and job placement.", "Cons": "Gets very busy during the breakfast hours. Awful organization in the morning. It gets way too busy for the amount of people assigned to work."}, "1": {"Date": " May 16, 2016", "Summary": "\"McDonalds\"", "Pros": "Team EnvironmentFast PacedBuilds Experience", "Cons": "Dealing overly exaggerated peopleSome days can be the longest days of your life"}, "2": {"Date": " May 17, 2016", "Summary": "\"I'm lovin it\"", "Pros": "Convenient, flexible, good pay, good experience", "Cons": "Tiring, repetetive, not healthy, but good coworkers"}, "3": {"Date": " Apr 29, 2016", "Summary": "\"Fun Times\"", "Pros": "McDonalds was a great starter job. It afforded me the opportunity to work while in high school and develop an introductory skill set. I would recommend it to almost anyone looking for a part time job.", "Cons": "It might not be what you are looking for if you need a long term steady employment opportunity that will develop skills beyond what most would consider introductory. the pay is minimal but its representative of the work and required skill or aptitude."}, "4": {"Date": " May 1, 2016", "Summary": "\"Quentin hargraves\"", "Pros": "This would be a great position for a 15 year old looking for work and is still in high school good for someone looking for extra money", "Cons": "It could mess with your school work and hours of community service"}, "5": {"Date": " May 1, 2016", "Summary": "\"cashier\"", "Pros": "nice people that are easy to work with. time off when you need it.", "Cons": "too many weekend hours."}, "6": {"Date": " May 2, 2016", "Summary": "\"Different\"", "Pros": "Good paying and easy going and steady income and great hours and very nice managers and very nice coworkers", "Cons": "Very rude people some coworkers sucked and food is very fating"}, "7": {"Date": " Jun 6, 2016", "Summary": "\"Everything sucks\"", "Pros": "there's literally not one good part of this job, and no matter what you do or how you do it, they will still hate you.", "Cons": "Everything about it in every way"}, "8": {"Date": " Apr 24, 2016", "Summary": "\"Operations Manager\"", "Pros": "Fast paced and has flexible schedule", "Cons": "Everyday has a different sort of chaos"}, "9": {"Date": " May 16, 2016", "Summary": "\"Only for High school kids, not working parents\"", "Pros": "Make friends with most co-workers, work is easy, pay isn't bad.", "Cons": "Managers and most co-workers are idiots. Managers think they are better than everyone and only way to move up is to kiss managements rear. Don't like making non-management full time."}}