{"0": {"Date": " May 29, 2016", "Summary": "\"I'm lovin' it\"", "Pros": "McDonald's was freaking rad, man. I loved working for this company, and I'm not kidding in the slightest. It was actually a great opportunity that I'm glad I was able to take. Friendly people, hard work ethic, lots of humbling experiences.", "Cons": "Didn't get to eat as many fries as you'd expect. Sometimes people are rude and you don't want to deal with it, but same old same."}, "1": {"Date": " Jul 4, 2016", "Summary": "\"Bad employee care\"", "Pros": "Learning atmosphere and meeting new people working with all different age groups", "Cons": "Poor pay bad upper management and review or reward system"}, "2": {"Date": " Jul 5, 2016", "Summary": "\"Good for a first job\"", "Pros": "Great experienceGood to learn the basics of a work ethic", "Cons": "Most of the time dealing with difficult customers"}, "3": {"Date": " Jun 13, 2016", "Summary": "\"Worked for a year so far.\"", "Pros": "They can sometimes work around your schedule. Get free food every time you work. Sometimes managers are nice, depends who your manager is.", "Cons": "Everything else, really. Not nice treatment to workers by the manager's or customers no matter how polite you are to them."}, "4": {"Date": " Jun 14, 2016", "Summary": "\"Manager\"", "Pros": "Awesome being able to serve people", "Cons": "Required shifts, not enough help at night"}, "5": {"Date": " May 29, 2016", "Summary": "\"Working at McDonald's\"", "Pros": "Good first job, fun workers, flexible scheduling", "Cons": "Customers can get angry, doing the same task over and over"}, "6": {"Date": " May 30, 2016", "Summary": "\"Not bad\"", "Pros": "For any teen, its a simple way to make cash. Great management.", "Cons": "Only con I can think of is minimum wage :)"}, "7": {"Date": " Jun 13, 2016", "Summary": "\"Employment at McDonald's\"", "Pros": "Employee meal discount and also able to take a vacation with pay.", "Cons": "No advancement opportunities or pay raises."}, "8": {"Date": " May 29, 2016", "Summary": "\"Horrible\"", "Pros": "Free foodNothing else I can think of", "Cons": "Don't get paid enough for working as hard."}, "9": {"Date": " Jul 3, 2016", "Summary": "\"sucked\"", "Pros": "No one trained me. Very bad manage ment. Everyone that I worked with was rude. I had to learn everything on my own.", "Cons": "No one trained meNot enough people workingManagers were rude and disrespectfulShirts ran too big for me and wouldn't give me new ones"}}