{"0": {"Date": " Jan 7, 2016", "Summary": "\"Honest Mc'Donalds Review\"", "Pros": "Good for short-term employment, good to learn experience and possible job advanced placement with the right restaurant. Very flexible when it comes to personal life at least for me I never had a problem with needing time off if it is deserved.", "Cons": "Poor management, training intake was very poor not thorough or what you would expect to learn each job."}, "1": {"Date": " Dec 2, 2015", "Summary": "\"Chef\"", "Pros": "Great food. Love being surrounded by delicious food. People are great. Food is great. Environment is great. Place is clean.", "Cons": "Pay is not a lot. Customers are not the most pleasant to deal with. Kitchen is hot."}, "2": {"Date": " Jan 6, 2016", "Summary": "\"Team Member\"", "Pros": "None that I can think of.", "Cons": "It's a basic job to begin with as a teen. Nothing special."}, "3": {"Date": " Jan 6, 2016", "Summary": "\"Hated it.\"", "Pros": "Good place to work if it's your first job", "Cons": "If you don't have patience I wouldn't recommend. Makes you stay extra hours.. Even if you have school in the morning"}, "4": {"Date": " Dec 16, 2015", "Summary": "\"Cook/Cashier\"", "Pros": "I worked every night closing.", "Cons": "if you ask for a day off they will only give you two days on the schedule."}, "5": {"Date": " Dec 16, 2015", "Summary": "\"Good for eating not for working\"", "Pros": "If you really need a job really really bad, like really really really bad and you don't mind gaining 10 pounds a week and getting yelled at 24/7 then get in line.", "Cons": "Our lunch wasn't even free it came out of my paycheck. Every employee had their own way of doing things and as a new worker they all wanted me to do things their way, which is very confusing when you have 5 different people telling you how to cook fries. I swear what one person said was right another person would say it was wrong. Surprisingly I rarely had any complaints with the customers it was mostly my coworkers."}, "6": {"Date": " Dec 1, 2015", "Summary": "\"Assistant manager\"", "Pros": "Some of the best work experience. Amazing co managers, sv has an awesome crew. Lots of perks for managers.", "Cons": "Like any fast food, the hours are flexed and random. Gms do there best though, to try to keep people happy."}, "7": {"Date": " Dec 1, 2015", "Summary": "\"very good company\"", "Pros": "awesome coworkers, great customers, really good food and drinks. really clean store.", "Cons": "the managers sometimes favor some of the employees, making it unfair to some of the other employees working there. some times there is not enough employees for everybody to get a break."}, "8": {"Date": " Dec 15, 2015", "Summary": "\"Not good\"", "Pros": "Free hamburgers fries cakes pies everything is free if you get hungry. Of course you may end up getting fat", "Cons": "The food isn't good. Sometimes people aren't very nice. If you eat the food you'll get yelled at by your boss."}, "9": {"Date": " Dec 15, 2015", "Summary": "\"McDonald's\"", "Pros": "Work with great people. Bonuses.", "Cons": "It gets over whelming sometime. Not enough pay."}}