{"0": {"Date": " Oct 2, 2016", "Summary": "\"mcdonalds employeer\"", "Pros": "Great coworkers and great area to work", "Cons": "management didn't really care about school"}, "1": {"Date": " Oct 15, 2016", "Summary": "\"Crew Trainer\"", "Pros": "I get to meet a lot of people. I also get a discount on my meals while on break.", "Cons": "There is no retirement and no vacation pay unless you are allowed to work a certain number of hours, which they dictate how many hours your allowed to work and if your under, you get no paid vacation. Plus when they have a system that's working and everyone's happy. They go and change it on you."}, "2": {"Date": " Sep 30, 2016", "Summary": "\"chasier\"", "Pros": "get to make many new friends and make the customers day better with just a smile. also its a fun fast paste job", "Cons": "sometimes the rudeness of the customer but you always still have to keep a smile on your face."}, "3": {"Date": " Sep 30, 2016", "Summary": "\"Working at Mcdonalds was fun for a summer job\"", "Pros": "Good pay for area, benefits for FT", "Cons": "Stressful during lunch rush, physically demanding"}, "4": {"Date": " Nov 5, 2016", "Summary": "\"sucky\"", "Pros": "the crew was probably the only good thing at the job", "Cons": "bad pay, rude customers, worked like a slave"}, "5": {"Date": " Nov 6, 2016", "Summary": "\"Stress caused by aggressive management style where reasonable adjustments could have been considered,but instead harassm\"", "Pros": "Pay was good, for fast food work. Scheduling was flexible.", "Cons": "All managers gossip about everyone, so you cannot confide any problem.agressive management in the morning shift.unreasonable. Unpleasant."}, "6": {"Date": " Oct 14, 2016", "Summary": "\"It's ok\"", "Pros": "can make some lasting relationships", "Cons": "not much room for growth"}, "7": {"Date": " Oct 14, 2016", "Summary": "\"Ok. Pays the bills\"", "Pros": "You can put in Overtime. Unlike other jobs if youre paid hourly. Bonus is good if you make your monthly goals. If taken seriously this job can provide a good income. Advancement opportunities. Benefits. Free meals.", "Cons": "As a general manager its stressful. Mcdonalds is always changing procedures."}, "8": {"Date": " Oct 14, 2016", "Summary": "\"great place to work\"", "Pros": "cooked french fries with chicken nuggets, it was awesome", "Cons": "hot oil gets everywhere. its coarse and hot. I hate it"}, "9": {"Date": " Oct 14, 2016", "Summary": "\"It's what you think it would be like\"", "Pros": "good way to start out as a first job", "Cons": "bad management, customers, co workers, environment"}}