{"0": {"Date": " Jun 26, 2017", "Summary": "\"wonderful\"", "Pros": "great environment and work", "Cons": "not many cons but customers can be unfair"}, "1": {"Date": " Jun 26, 2017", "Summary": "\"It Can be stressful\"", "Pros": "Easy to move upflexible with schedulesa lot of hours", "Cons": "turnoverdramawork doesn't equal pay for management"}, "2": {"Date": " Jun 26, 2017", "Summary": "\"McDs\"", "Pros": "great hours, flexible, great place to get custumer service skills.", "Cons": "under skilled managers, sometimes cashier can do a better job."}, "3": {"Date": " Jun 27, 2017", "Summary": "\"Overnights\"", "Pros": "I have worked in a few other fast food environments and I can say that McDonald's has the best layout. Everything is organized and ,when done correctly, the making of food on backline is streamline.", "Cons": "The pay is not the best"}, "4": {"Date": " Jun 27, 2017", "Summary": "\"First job\"", "Pros": "The crew was super nice and all real people.50% off discounts", "Cons": "Some customers where rude and angry and unreasonable."}, "5": {"Date": " Jun 11, 2017", "Summary": "\"Great\"", "Pros": "Stress free and very easy", "Cons": "No cons at all to give"}, "6": {"Date": " Jun 11, 2017", "Summary": "\"Shift Manager\"", "Pros": "I enjoy the varying shifts I work, I appreciate all my coworkers, and I like hearing about the customers. I also like the fast-paced environment as well.", "Cons": "The only thing I really dislike is when employees are unhappy, or the occasional burn from a fry basket"}, "7": {"Date": " Jul 17, 2017", "Summary": "\"0% PROFESSIONALISM W/ THIS EMPLOYER.\"", "Pros": "My Customers were my only Positive Experience('s) I had the entire time is been employed at the Garfield, Tx/ Cedar Creek, Tx location.", "Cons": "HORRIBLE Management.Refusal to properly train New Employers, IF there was any training at all.All Together, this Employer was THE Most Unprofessional Establishment I'd ever worked at. . . !!"}, "8": {"Date": " Jul 18, 2017", "Summary": "\"They suck\"", "Pros": "There are none. Worst place iv ever worked", "Cons": "There are none. I hated working here"}, "9": {"Date": " Jun 26, 2017", "Summary": "\"Mcdonals\"", "Pros": "A fast past ,and good pay", "Cons": "mangers need not to show favoritism to workers"}}