{"0": {"Date": " Dec 12, 2016", "Summary": "\"Grill Cook\"", "Pros": "Great co-workers. Friendly managers. Pretty flexible. Nice regular customers. Family environment.", "Cons": "Stuff broke down alot but they fixed most of it eventually."}, "1": {"Date": " Dec 25, 2016", "Summary": "\"A lot of pros, and a lot of cons\"", "Pros": "Flexible schedule for the most part. Vastly improved social skills. Leadership skills are developed. Learn to be a team player. Increased problem solving skills.", "Cons": "A lot of things are \"learn as you go\" not a whole lot of hands on training. Not everyone is treated equally due to skills at the workplace. Unless you are a manager (i've been a manager since july) you do not have a voice."}, "2": {"Date": " Jan 15, 2017", "Summary": "\"poor\"", "Pros": "half off on lunch meals during break", "Cons": "not enough hours nor pay"}, "3": {"Date": " Jan 15, 2017", "Summary": "\"Not for everyone\"", "Pros": "Free meals, flexible hours and an interesting team.", "Cons": "There are too many cons to list."}, "4": {"Date": " Dec 26, 2016", "Summary": "\"Terrible, don't work here\"", "Pros": "They had a flexible schedule.", "Cons": "Everything else was terrible. I can't list anything else good."}, "5": {"Date": " Dec 9, 2016", "Summary": "\"Crew Member\"", "Pros": "Very good and hard worker", "Cons": "Not enough pay to pay the bills and gas"}, "6": {"Date": " Dec 9, 2016", "Summary": "\"Crew Member\"", "Pros": "Amazing staff, Very Flexible, Great Oppurtunity. Different everyday.", "Cons": "Could be tough at times. Could be interesting."}, "7": {"Date": " Jan 14, 2017", "Summary": "\"Unprofessional, unfair store manager\"", "Pros": "Crew was the best, they made hard days easier to handle. Most of the other managers were great. I opened, which I loved doing.", "Cons": "Store manager has no people skills and was very unprofessional. If she wanted you to fail, you did! Rude customers were tough to deal with. Who likes to be cussed at?"}, "8": {"Date": " Dec 23, 2016", "Summary": "\"Only if your really desperate for a job\"", "Pros": "Free food, nice people, ok management.", "Cons": "When there is a lack of employees during 3rd shift, the work load of the remaining workers gets distributed unevenly. I had to do backwall, grill, the dishes, and mop the entire restaurant while others only did their assigned job."}, "9": {"Date": " Dec 6, 2016", "Summary": "\"Friendly but communication is often lacking\"", "Pros": "Free meal per shift and very friendly atmosphere. Managers work with your schedule and if you have a disability or injury but still want to or need to work, they do what they can.", "Cons": "working for much less than competing companies in the local area and schedules are not often posted in appropriate time. Communication on new events, items, or policies are word of mouth and there is no sit down to tell us about it. The computer system is outdated and you often see items that havent been sold in years still as options on the order taking screen"}}