{"0": {"Date": " Feb 25, 2017", "Summary": "\"Better then no job at all\"", "Pros": "Get the hours you want if you work your hardest", "Cons": "Crap pay and work with a bunch of teenager that don't listen or care about the job"}, "1": {"Date": " Feb 9, 2017", "Summary": "\"Cheesy Cheese burgers for free!\"", "Pros": "Free Cheeseburgers! Free tenders! Free Fries! Free Soda!", "Cons": "Smell like food after work."}, "2": {"Date": " Feb 9, 2017", "Summary": "\"Chef\"", "Pros": "Free Hambergers are always welcome.", "Cons": "Working with clowns gets old."}, "3": {"Date": " Mar 17, 2017", "Summary": "\"Somewhat good place to work\"", "Pros": "Tuition assistance, challenging work environment, great first job, friendly coworkers, good management, flexible schedule", "Cons": "not competitive pay, owner does not care about workers, no communication between owner and crew members"}, "4": {"Date": " Mar 17, 2017", "Summary": "\"Worst job\"", "Pros": "Free food and lunches and drinks", "Cons": "Customers are so rude and the hours suck and theirs no legal thing that the do it's all about those who have the power to control ppl"}, "5": {"Date": " Feb 24, 2017", "Summary": "\"Workplace is more biopolar than kansas weather\"", "Pros": "SOME of the employees are nice", "Cons": "most managers befriend their employees outside of work causing drama in the workplace. Majority of the customers have bad attitudes and expect you to be perfect and will literally yell at you for the littlest thing. low pay, very high stressed job. Literally the only reason people work here is for the pay which isn't very much"}, "6": {"Date": " Feb 9, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Cool people to work with", "Cons": "hours are not the best"}, "7": {"Date": " Feb 9, 2017", "Summary": "\"Happy but not happy.\"", "Pros": "Flexible hours and scheduling, friendly coworkers, understanding management, advancement from within.", "Cons": "Nonunderstanding management, little encouragement, extremely difficult to advance position, often left unappreciated."}, "8": {"Date": " Feb 23, 2017", "Summary": "\"Crew member\"", "Pros": "Always something to do, stayso fairly busy.", "Cons": "Grouchy customers, coworkers pawn a lot on you."}, "9": {"Date": " Feb 23, 2017", "Summary": "\"Ehh\"", "Pros": "Being able to afford to survive", "Cons": "Working at McDonalds overall."}}