{"0": {"Date": " Sep 21, 2017", "Summary": "\"Crew Member\"", "Pros": "They gave me decent amount of hours. I was able to call in if I needed to. They worked around my school and sports schedule as well.", "Cons": "Some of the managers were rude, they would exploit my work ethic sometimes due to lack of workers. I never complained and also the the pay per hour should be raised."}, "1": {"Date": " Sep 5, 2017", "Summary": "\"Great job\"", "Pros": "Great enviornment and great team", "Cons": "Wanted me to work too many hours"}, "2": {"Date": " Sep 6, 2017", "Summary": "\"I loved it\"", "Pros": "Real room for growth and advancement.", "Cons": "The QS industry can be very demanding ."}, "3": {"Date": " Oct 11, 2017", "Summary": "\"I would rather work with septic tanks than work here.\"", "Pros": "It’s a job? There are really no pros in working at McDonald’s, my time there included my boss assaulting me and a manager would watch porn in the break room", "Cons": "Horrible managersHorrible payNo benefits or at least not good onesDisrespectful bossInappropriate behaviorBarely any pay raises"}, "4": {"Date": " Sep 20, 2017", "Summary": "\"Please, save yourself the time, and skip McDonalds.\"", "Pros": "You get half off of everything on the menu, and get 2 free items per shift.", "Cons": "Scheduling is a NIGHTMARE. They don't care if you work, so if you want hours, beg a plead. I hate it here, and i've been working for a month and a half. Not fun."}, "5": {"Date": " Sep 21, 2017", "Summary": "\"Bad\"", "Pros": "The weekly and good pay .", "Cons": "Management does not cooperate with each other ."}, "6": {"Date": " Sep 19, 2017", "Summary": "\"Fry Cook\"", "Pros": "Manager was flexible with hours", "Cons": "Not really into the whole cooking thing"}, "7": {"Date": " Sep 20, 2017", "Summary": "\"Fair environment, food is great\"", "Pros": "Time flies the job was fast pace and easy.", "Cons": "The cleaning after closing, and dealing was jerks every now and then."}, "8": {"Date": " Sep 4, 2017", "Summary": "\"Cashier\"", "Pros": "Fast paced, fun sometimes, enjoyable", "Cons": "Over work you,won't give u many promotion opportunities"}, "9": {"Date": " Sep 5, 2017", "Summary": "\"Cashier\"", "Pros": "i learn good people skills", "Cons": "not enough hours to work with"}}