{"0": {"Date": " May 26, 2016", "Summary": "\"GM-corporate\"", "Pros": "Great benefits, development opportunities, education assistance, amount of vacations, company car program, developing others, coaching, and teamwork.", "Cons": "Constantly on call when you are running the show. Not being able to rely on others to be team players. Paperwork!!!!"}, "1": {"Date": " May 30, 2016", "Summary": "\"Department manager\"", "Pros": "They have raised pay for management", "Cons": "You have to put up with a lot of stuff that worth the increase of pay"}, "2": {"Date": " May 31, 2016", "Summary": "\"Working at McD's\"", "Pros": "McDonald's is great to work for if you are just starting out. A lot of exit opportunities while getting a solid foundation for business.", "Cons": "The pay is a little lower than other places. The work-life balance is sometimes a little sketchy. Sometimes hard work is not rewarded."}, "3": {"Date": " Jun 13, 2016", "Summary": "\"Descent\"", "Pros": "I learned how to make my own money", "Cons": "Manager can not be understanding"}, "4": {"Date": " Jun 13, 2016", "Summary": "\"Good Company\"", "Pros": "When I was employed, it was a great company to work for. Flexible, great work life balance. However this will depend on your direct manager. Mine was great.", "Cons": "Hard to move up as there are many layers and should have good network. They are currently going through a big re-org."}, "5": {"Date": " Jun 13, 2016", "Summary": "\"Good job, but at a high cost\"", "Pros": "Generally a very well organized company with extensive training for managers, scheduling accommodations for everyone, bonuses and benefits (vary by owner/corporate)", "Cons": "Stressful management jobs, swing shifts can turn you into a zombie..."}, "6": {"Date": " Jun 13, 2016", "Summary": "\"Management\"", "Pros": "Meet different people which is fun!", "Cons": "Even though people are above 18 yrs of age they act like babies & the ghetto customers don't make it easy either"}, "7": {"Date": " Jun 13, 2016", "Summary": "\"Cashier\"", "Pros": "Daytime hours which are good if you have children .", "Cons": "Management is disrespectful towards employees, people don't show up for work and you have to take up the slack and get yelled at in the process, low hourly pay, no benefits, hours constantly getting cut."}, "8": {"Date": " Jun 13, 2016", "Summary": "\"Crew Member\"", "Pros": "1. Movement in management2. Discounts", "Cons": "1. Not really flexible with your time2. Employees not really heard"}, "9": {"Date": " May 29, 2016", "Summary": "\"Good First Job\"", "Pros": "Easy, Laid Back, Flexible, and Understanding", "Cons": "Complaining Customers, Bipolar Managers re ye je oe"}}