{"0": {"Date": " Mar 8, 2017", "Summary": "\"Great job and lunch benefits!\"", "Pros": "You get to eat burgers!", "Cons": "You have to clean up burgers."}, "1": {"Date": " Mar 8, 2017", "Summary": "\"I Love my job\"", "Pros": "Good training and the managers are very good and helpful", "Cons": "I don't have any complaints I liked it"}, "2": {"Date": " Mar 9, 2017", "Summary": "\"Good.\"", "Pros": "Good first job. Lots of learning and basic skills if you're willing to work. Steady, full-time income. Not much else to say.", "Cons": "Too many chiefs, not enough Indians. Power trips, etc. lots of small man syndrome in lower management. Lazy, unskilled, young coworkers."}, "3": {"Date": " Apr 13, 2017", "Summary": "\"Short-tempered managers\"", "Pros": "free food, time goes by faster when it's busy, pay is decent. regular customers can be friendly", "Cons": "they don't pay attention to schedule I gave them, managers get mad easily when one is not as quick as they would like, location is far from home and they did not let me transfer to a closer one. Expects you to know how to do a task even if it's your first time"}, "4": {"Date": " Mar 23, 2017", "Summary": "\"being a maintenance person at mcdonalds\"", "Pros": "the people are actually really great, I work from 7 to 3, so I know both morning and day shift, the people are very nice as long as you do your job", "Cons": "the issue I had was with management... I have worked there 4 weeks, it took me 2 weeks to even get trained, so I had to wing it for the first 2 weeks. then I got trained and was told that I needed a third form of ID, so I got it and brought it to them, then they lost all my paper work including the copies of my birth certificate and social security card after I re gave them everything and worked for another week until I had a foot injury, I went to the doctor got an xray doctors note and all that, brought it to them on a Monday and it said no work until sunday. I got a call Thursday asking why I wasn't at work, when I told the morning manager I brought in paper work and doctors note that I couldn't work for a week she said she saw nothing and accused me of lying until I called he other manager and brought in a copy of the paperwork I gave them and at this point I have not got a uniform that fits, I have 1 shirt that is 3 sizes too big 1 hat and no pants, I'm supposed to have 3 full uniforms. now the biggest issue, the morning manager, during the first 2 weeks I had no schedule and was told by a manager what time to be there at the end of each day, the morning manager accused me of being late twice. all I wanted was to show up do my job and get paid but that never happened..."}, "5": {"Date": " Mar 8, 2017", "Summary": "\"First Job\"", "Pros": "great hours and great people", "Cons": "customers can be very rude sometimes"}, "6": {"Date": " Mar 8, 2017", "Summary": "\"Fun but stressful\"", "Pros": "- fast paced and motivated work environment- there are always goals to be set to try to achieve, it can make the job fun- advancement opportunities", "Cons": "- understaffed days can be heavily draining and frustrating- managers have to deal with a lot of conflict from both staff and customers daily and attempt to diffuse the situation- high accountability if it is your shift (if something goes wrong its automatically your fault)- sometimes can be difficult to keep team members motivated"}, "7": {"Date": " Mar 9, 2017", "Summary": "\"Shift manager\"", "Pros": "Great benefits including 401k, great learning experiences,promotion within company is fast", "Cons": "Fast food, need open availability"}, "8": {"Date": " Mar 22, 2017", "Summary": "\"McDonald's\"", "Pros": "Good starting job. Learned the basics of working a job.", "Cons": "Pay was low and work got boring."}, "9": {"Date": " Mar 22, 2017", "Summary": "\"Decent for student but can't sustain a family with pay\"", "Pros": "The schedule is pretty flexible and thats great when your life requires that. Employees also got a discount on meals.", "Cons": "Some coworkers are not as responsible as they should be and that caused others to have to pick up there slack."}}