{"0": {"Date": " Jan 20, 2017", "Summary": "\"mcdonalds\"", "Pros": "free food great people to work witj", "Cons": "long hours little pay and open 24 hrs"}, "1": {"Date": " Jan 20, 2017", "Summary": "\"Definitely temporary\"", "Pros": "Great at working around schedules.", "Cons": "Management was sloppy and unorganized. Toxic environment with no remedy in sight for improvement."}, "2": {"Date": " Jan 4, 2017", "Summary": "\"General Manager\"", "Pros": "Good people to work for and with, flexibility, training, exciting, opportunity, challenging, they care about you.", "Cons": "Frustrations, like any job I guess, customers, lots of changes"}, "3": {"Date": " Jan 4, 2017", "Summary": "\"Fast paced, fun employees\"", "Pros": "Worked with my hours as I went to school, taught how to do my job well.", "Cons": "Not much bad to say I had nice managers and employees."}, "4": {"Date": " Feb 9, 2017", "Summary": "\"Worst place to work!!\"", "Pros": "It pays the wage that was stated. This was the only good thing that came from this job.", "Cons": "Sexual harrasment from management. Those with higher pay grade put their work load on you. Not given your break time(illegal). Given tasks that are unreasonable and not for the company. Noone correctly does their job."}, "5": {"Date": " Jan 20, 2017", "Summary": "\"Department Manager\"", "Pros": "If you are at a corporate store you can get great benefits as a manager. Work week is 45 hours so you make some overtime.", "Cons": "Corporate Mcdonalds has plans to sell most of their store to franchise owners. It's up to the individual owners what benefits they offer you if any."}, "6": {"Date": " Jan 19, 2017", "Summary": "\"Hamburger maker at McDonald's full time\"", "Pros": "Free fries and milk shakes", "Cons": "Long hours. Not enough money"}, "7": {"Date": " Jan 19, 2017", "Summary": "\"Crew member\"", "Pros": "I liked my hours and job duties", "Cons": "Some workers were very messy and rude"}, "8": {"Date": " Jan 3, 2017", "Summary": "\"Working for McDonald's\"", "Pros": "Love working for McDonald's it's so much fun", "Cons": "Customers can be rude but you just gotta have self control"}, "9": {"Date": " Jan 3, 2017", "Summary": "\"I lived it!\"", "Pros": "I very much enjoyed working at McDonalds it was an amazing experience that I will never forget I learned how to make sandwiches and talk with people and watch things and use headphones and touch screens and mops and I would recommend it to anyone.", "Cons": "The only thing I didn't like about working for McDonald's was the management smelled funny and didn't seem two age thank you."}}