{"0": {"Date": " Nov 15, 2016", "Summary": "\"Mcdonalds Kitchen Manager\"", "Pros": "Great benefits and leadership opportunities", "Cons": "You don't get to do as much as you used to do"}, "1": {"Date": " Nov 15, 2016", "Summary": "\"crew\"", "Pros": "good and good benefits hours", "Cons": "customers are bad all day"}, "2": {"Date": " Nov 15, 2016", "Summary": "\"review title\"", "Pros": "overall good company solied overall", "Cons": "not really many cons with this company"}, "3": {"Date": " Nov 15, 2016", "Summary": "\"Service\"", "Pros": "Working together as a team", "Cons": "Negative energy leads to more negative energy"}, "4": {"Date": " Nov 30, 2016", "Summary": "\"Lame\"", "Pros": "I liked working here when I got to do different things", "Cons": "Most of the time they had me on counter and would always be stern with me for no reason"}, "5": {"Date": " Nov 15, 2016", "Summary": "\"Pretty Alrighty\"", "Pros": "Days are quick, work is easy, good job for young adults.", "Cons": "People are idiots, customers are rude and always seems agitated."}, "6": {"Date": " Nov 16, 2016", "Summary": "\"Great Job\"", "Pros": "The pay here was fairly good in today's market.", "Cons": "None that I can think of"}, "7": {"Date": " Nov 29, 2016", "Summary": "\"Cashier\"", "Pros": "The staff was very friendly and there was not much gossip or bullying. We had the chance to work with everyone so we all were able to get along.", "Cons": "It is a customer service job and that can be tiring and stressful. People were always unsatisfied even though it was just fast food. You have to be able to keep a happy face at all times. Not the best job for someone who does not want to deal with the general public."}, "8": {"Date": " Nov 15, 2016", "Summary": "\"Great first job\"", "Pros": "I loved McDonalds as my first job. Whether you're in the service department or the kitchen department, the actual job is easy. As long as you work hard, it's easy to advance in the company. I made a lot of good friends here through the years. There's also a lot of events to be apart of since the company is so popular. The starting pay is decent. Especially since the corporate raise. Good benefits if you stick with the company for awhile.", "Cons": "Starting pay is good for fast food ($9) if you just need quick cash, but the pay for promotions doesn't really do much to motivate. Trainers make 50 cents more and managers make a dollar more.You deal with different types of people... Some low classed and disrespectful."}, "9": {"Date": " Dec 20, 2016", "Summary": "\"Not Exactly Loving It At All\"", "Pros": "Got some hours for gas money, and a good first job. But not the the best job once you complete college.", "Cons": "Everything about the Job, for cleaning the grills to cooking the food. You will not love this, do not do it."}}