{"0": {"Date": " Feb 15, 2016", "Summary": "\"Ok\"", "Pros": "The customers are nice sometimes and my coworkers are fun to be around , we have a lot of fun working together", "Cons": "It's not what I would want to do in life and the McDonald's I work at is very old and needs remodeling"}, "1": {"Date": " Feb 15, 2016", "Summary": "\"Crew Perso\"", "Pros": "Enjoy working with people of different cultures.", "Cons": "McDonald's does not have any downside for me."}, "2": {"Date": " Feb 15, 2016", "Summary": "\"Crew Member\"", "Pros": "Nothing, zip, nada, zero, uno", "Cons": "Bad pay, bad managers, everyone is disgruntled, terrible off work smell"}, "3": {"Date": " Jan 31, 2016", "Summary": "\"It's work\"", "Pros": "You'll learn to do everyting", "Cons": "You won't get payed extra for covering other people, No overtime"}, "4": {"Date": " Feb 1, 2016", "Summary": "\"New worker\"", "Pros": "I can make money now.", "Cons": "Its my first job so its something I have to get used to"}, "5": {"Date": " Feb 14, 2016", "Summary": "\"McDonalds\"", "Pros": "Teaches you how to work a job if its your first one. Gives employees the opportunity to work together in a fast paced environment with varying levels of responsibility.", "Cons": "Its an entry level job, not a lot of room for advancement. Managers can vary from being helpful to being rude and unappreciative."}, "6": {"Date": " Feb 15, 2016", "Summary": "\"Manager\"", "Pros": "You get to meet new and interesting people every day. It's a great place to learn and grow. The company has classes to teach you everything you need to learn in order to move up. It doesn't even feel like a job so I was like you're just one big family. Caspers company takes care of its employees. They also encourage you to further your education and they even help you.", "Cons": "It can be very stressful at times. You have to be a but I have patience and a sense of humor."}, "7": {"Date": " Jan 30, 2016", "Summary": "\"Decent Job\"", "Pros": "Room for growth, fast paced working environment, and great way to develop people skills", "Cons": "Can be high stress, long hours"}, "8": {"Date": " Jan 30, 2016", "Summary": "\"Pretty Great\"", "Pros": "Really flexible hours! I'm a student so my availability changes every semester and there's never any issues with this. Everyone is great at my store, we get along and call ourselves our 'mcdonalds family.' They really care about you and want to see you succeed- they get excited for your good grades or personal achievements.", "Cons": "Managers don't always have your back when it comes to difficult customers, and the pay is pretty low."}, "9": {"Date": " Feb 14, 2016", "Summary": "\"long\"", "Pros": "hard honest work. sometimes it works out; sometimes it doesn't. maybe you want to make it big, maybe you don't.", "Cons": "tough work. this is a job for everyone and for no one. not all of us can do this, but all of us can try"}}