{"0": {"Date": " May 6, 2016", "Summary": "\"Former Employee\"", "Pros": "You have to be a very persistent person to get ahead in the company. You get what you put in. If you are going to be lazy, then do not expect much in terms of promotion.", "Cons": "If you are part-time, it is hard to move up the company. A lot of unnecessary drama that needs to be left at home and not brought to work."}, "1": {"Date": " Apr 21, 2016", "Summary": "\"Good, but depends on management\"", "Pros": "- Work with some really fun people- Free meal every shift worked- 50% off products off your shift- Some amount of growth opportunities", "Cons": "- Management slow to follow-up with development of crew when they really want it- Shifts in store management leads to shifts in store operations- High turnover- High absenteeism- Lack of people on the floor- High rate of customer concerns"}, "2": {"Date": " Apr 21, 2016", "Summary": "\"Exerienced Crew member\"", "Pros": "Great work environment and co-workers.", "Cons": "The pay rate system is drawn out."}, "3": {"Date": " May 5, 2016", "Summary": "\"Good company\"", "Pros": "Work hard and pretty aggressive, can learn a lot of stuff", "Cons": "I don't have Cons for this company, they are nice"}, "4": {"Date": " May 5, 2016", "Summary": "\"Crew\"", "Pros": "The coworkers are awesome and I get to let myself go with the McDonald's Menu. It's a good job to learn the basics of working hard. You may or may not learn how to manage your stress. It's rewarding, intrinsically, by way of personal growth if you have worked there long enough.", "Cons": "Everyone's outlook in life does not align with one another. There will be clashes of stress, frustration and negative energy often. Some days you subconsciously self-reflect on the reason as to why you are working there."}, "5": {"Date": " May 6, 2016", "Summary": "\"Not Bad\"", "Pros": "Breaks when you need em", "Cons": "Mindless work, low pay, but deserved"}, "6": {"Date": " Apr 20, 2016", "Summary": "\"Analyst\"", "Pros": "Great teaching staff to help understand", "Cons": "Hated the food quality over there"}, "7": {"Date": " Apr 20, 2016", "Summary": "\"lots of oppertunity\"", "Pros": "very good positive experience. had a lot of room to move up. manager's were very interested in what you have to say", "Cons": "overly worked for each shift. not enough workers to cover."}, "8": {"Date": " May 26, 2016", "Summary": "\"Sucks\"", "Pros": "There are no pros this place ... Besides the fries lol this place sucks to work don't work here .", "Cons": "Sucks this place really sucks u are over worked and under paid ."}, "9": {"Date": " May 27, 2016", "Summary": "\"Team Lead\"", "Pros": "Free lunch, nice uniform, good parking", "Cons": "hard work, not flexible schedule"}}