{"0": {"Date": " Feb 17, 2016", "Summary": "\"So So\"", "Pros": "Easy work and flexible hours.", "Cons": "You'll never want to eat there"}, "1": {"Date": " Feb 18, 2016", "Summary": "\"Grill\"", "Pros": "Easy work and nice coworkers", "Cons": "Repetitive work, you will work past your schedule time to get almost every work day"}, "2": {"Date": " Feb 2, 2016", "Summary": "\"Great flexibility\"", "Pros": "Scheduling is very flexible. Great overall management. Fun atmosphere to work in. Free meals while working. Good customer service experience.", "Cons": "Slow increase in pay. I've been working for about a year and I am still at base pay. Low starting wage. Only 10% discount while not working."}, "3": {"Date": " Feb 3, 2016", "Summary": "\"good\"", "Pros": "flexible hours and steady pay", "Cons": "very demanding and low pay for the amount of work"}, "4": {"Date": " Feb 3, 2016", "Summary": "\"Solid Work\"", "Pros": "Pay raise twice a year and after each class completed. Training classes are available and they pay for certification. Free meals for management as well. Granteed hours.", "Cons": "Turnover rate is high for crew members. If you relocate, you would have to re apply to the next store. Its a lot of class work to get done and if you're at a busy store, you could go over you're hours and depending on management team that could be a problem."}, "5": {"Date": " Feb 3, 2016", "Summary": "\"Easy job bad management\"", "Pros": "Easy job. Great customers if you get their orders right and fast. This is a great job if you like moving a lot i.e. ADHD\\ADD\\OCD", "Cons": "Every manager is different. Some follows some policies others make their own. They tell you different \"right\" ways to do things"}, "6": {"Date": " Feb 16, 2016", "Summary": "\"manager\"", "Pros": "the schedule was some time easy to change", "Cons": "it was not organized"}, "7": {"Date": " Feb 16, 2016", "Summary": "\"Management\"", "Pros": "great first job to have for anyone", "Cons": "no work life balance at this place"}, "8": {"Date": " Feb 16, 2016", "Summary": "\"Crew Member\"", "Pros": "Great Hours, fast paced, friendly co-workers", "Cons": "poor call in ratio's, working over nights,"}, "9": {"Date": " Feb 1, 2016", "Summary": "\"cashier\"", "Pros": "Wanna try something different, and challenged myself to other opportunities.", "Cons": "Love working with my hands, why not get paid for it."}}