{"0": {"Date": " Aug 29, 2016", "Summary": "\"Cashier\"", "Pros": "Easiest Job, Easy Money , Not hard work", "Cons": "Stupid Bosses, Mean crew members"}, "1": {"Date": " Aug 8, 2016", "Summary": "\"Never Again\"", "Pros": "The hours were nice, I worked during the day and no weekends. It was close to home and I was able to go home for lunch.", "Cons": "I never really did finish some of the things I was suppose to do and got blamed for some things that I didn't do."}, "2": {"Date": " Aug 8, 2016", "Summary": "\"Worst Job Ever\"", "Pros": "- Relatively easy tasks- Always hiring and usually accept all applicants- Easy money", "Cons": "- No one cares about training new hires, 75% of staff weren't even properly trained.- Management didn't bat an eyelash when I was physically assaulted on the McDonald's property on shift, they said \"Oh that happens sometimes.\"- Most employees didn't handle food safely.- Full of high schoolers and high school drama- Management cussed at employees- EXTREMELY RUDE CUSTOMERS (probably because McDonalds' customer service is about as good as an uncooked potato)"}, "3": {"Date": " Jul 24, 2016", "Summary": "\"Its good, but...\"", "Pros": "There are flexible hours, they pay well hourly, and its a nice working environment. And they also give courtesies(Using the restroom) whenever you need it.", "Cons": "I had to take a medical leave, and they didn't let me back on the schedule, even though I put on there that I could work certain hours and certain days."}, "4": {"Date": " Jul 24, 2016", "Summary": "\"Okay I guess\"", "Pros": "It is fun at times. Can be a little bit challenging at times.Training is okay. Time flies if you are busy.", "Cons": "Pay and hours can suck. Better to be a manager. No benefits and it can be stressful at times."}, "5": {"Date": " Aug 8, 2016", "Summary": "\"Crew Member\"", "Pros": "It was what you would expect it to be. Nothing out of the ordinary. That is about all I can say about it.", "Cons": "No no no no no no no no no no no no no no no no no no no no no no no no no no no"}, "6": {"Date": " Aug 8, 2016", "Summary": "\"Still a good company\"", "Pros": "Work hard and play hard organization. Family friendly with good benefits. Reasonably good career mobility.", "Cons": "Extremely political. Culture has changed much from McDonald's glory days."}, "7": {"Date": " Jul 24, 2016", "Summary": "\"Swing manager\"", "Pros": "Good pay with flexible schedules. You eat free and get free uniforms. A paid 15 minute break.", "Cons": "I hate when we are shirt staffed or have a staff full of new people. It drives me insane."}, "8": {"Date": " Jul 23, 2016", "Summary": "\"Crew Worker\"", "Pros": "Fantastic people that made the day interesting", "Cons": "Repetitive work in a fast food restaurant"}, "9": {"Date": " Jul 24, 2016", "Summary": "\"Pretty good\"", "Pros": "Wicked easy job, everyone I work with is really nice and we're all friends.", "Cons": "Some of the customers can be really rude and entitled. Also it can be high pressure during a rush but don't let it discourage you!!!"}}