{"0": {"Date": " Feb 3, 2016", "Summary": "\"!\"", "Pros": "Fast paste, coworkers are very easy to get along with and help ful.", "Cons": "Not enough hours, thats really it just not enought hours"}, "1": {"Date": " Jan 18, 2016", "Summary": "\"Review\"", "Pros": "Great opportunities for advancementGreat employees", "Cons": "Long hours sometimesrude customers sometimes"}, "2": {"Date": " Feb 23, 2016", "Summary": "\"Its bad\"", "Pros": "I really do not like it.", "Cons": "This place stinks and the floor sticks"}, "3": {"Date": " Feb 23, 2016", "Summary": "\"Shift manager\"", "Pros": "To gain experience and work ethic.", "Cons": "Not a good work environment."}, "4": {"Date": " Jan 18, 2016", "Summary": "\"Very friendly.. The workplace is phenomenol i love the people and its a fun place.\"", "Pros": "Meet new people get socializing and teaches to be outgoing.", "Cons": "Waking up and being on time is a problem for me that's all."}, "5": {"Date": " Jan 18, 2016", "Summary": "\"Part time\"", "Pros": "Flexible, fast paced environment, great people", "Cons": "Busy, a lot of pressure"}, "6": {"Date": " Feb 1, 2016", "Summary": "\"Cashier\"", "Pros": "Most staff are pretty friendly. Depending on which location you're at, the pay can actually be decent. You'll also get one free meal every day, and the managers are generally very flexible when it comes to scheduling. There's also a fair bit of room for growth.", "Cons": "Managers go on power trips sometimes and hold you to ridiculous standards. Customers are super rude. Generally a very high stress environment."}, "7": {"Date": " Feb 1, 2016", "Summary": "\"cashier\"", "Pros": "easy money, the job is not too difficult itself and it has many opportunities in terms of job mobility. my coworkers are easy to work with as well", "Cons": "the hours are too long. 12 hour shifts for non managers. often keep you for overtime, not worth it in my opinion"}, "8": {"Date": " Feb 1, 2016", "Summary": "\"Welcome Home America!\"", "Pros": "Working at McDonalds you get to interact with all different kinds of people (except Vegans!). All nationalities. Eat salads to maintain your good physique. Be careful of the meat industry.", "Cons": "Once I became vegan I couldn't look at a hamburger without wanting to cry. I laid awake at night with terrors of the suffering inherent in the system that I was a part of. I couldn't come to work, and have since adopted cows to live in my backyard."}, "9": {"Date": " Jan 17, 2016", "Summary": "\"cashier at mcdonalds\"", "Pros": "Good hours, excellent team work.", "Cons": "Rude customers, over time, late nights."}}