{"0": {"Date": " Jan 6, 2018", "Summary": "\"I Started With No Experience\"", "Pros": "McDonald's can be a fun work environment for a first time employee if the staff is willing to work with you. They worked with my school hours and let me have the chance to show my potential when I was ready to.", "Cons": "Because McDonald's is such a large company and they are not big on spending money when they don't think they need to, there were many times were things were not fixed, such as the ice cream machine, for an extended period of time."}, "1": {"Date": " Dec 22, 2017", "Summary": "\"An awesome job\"", "Pros": "Managers are flexible to work with single moms and pay is fair along w a positive work environment", "Cons": "Your always created with a smile"}, "2": {"Date": " Dec 21, 2017", "Summary": "\"Good first Time\"", "Pros": "No experience neededBuild customer service techniquesEasy to learn basics", "Cons": "A lot of work for very little pay"}, "3": {"Date": " Dec 21, 2017", "Summary": "\"great frist job\"", "Pros": "mostly friendly teamlots of teamwork and leadership skill-building opportunitieseasy to rise up in commandabove minimum wage mostly", "Cons": "fast-pacedloses a lot of labor in the winter timestressfulalways being stuck in the same spotunreliability from new teammates (I've seen 7 no-call no-shows in 1 month alone from newly-hired employees)"}, "4": {"Date": " Dec 21, 2017", "Summary": "\"Great!\"", "Pros": "Good people and great management", "Cons": "Difficult customers and repetitive work"}, "5": {"Date": " Jan 4, 2018", "Summary": "\"McDonald's\"", "Pros": "You havd a Flexible schedule", "Cons": "Its very hard to get good Wages"}, "6": {"Date": " Jan 5, 2018", "Summary": "\"Cashier\"", "Pros": "The customers and coworkers they always brought excitement .", "Cons": "The management was very poor and disrespectful ."}, "7": {"Date": " Jan 5, 2018", "Summary": "\"Team Member\"", "Pros": "It had great pay and great envoirnment.", "Cons": "To be honest it wasnt really no Cons at mcdonalds"}, "8": {"Date": " Dec 20, 2017", "Summary": "\"Great job for students\"", "Pros": "Flexible scheduleTuition reimbursement", "Cons": "Customers can be hard to deal with"}, "9": {"Date": " Jan 25, 2018", "Summary": "\"Not For Everyone\"", "Pros": "The only pros I can think of for this job were employee discounts on meals.", "Cons": "Signed on expecting room for job growth, and there wasn't. I was also promised my hours could be adjusted in balancing out home-life and work-life. I have four small children, and had requested part-time night shift. Instead, I consistently was stuck on day shifts (had to find a baby sitter and pay the baby sitter more than I made working), the night shifts I received were full-time shifts, and management was unwilling to help me fix my schedule. They told me to coordinate switching shifts with other employees on my own. There was also A LOT of sexual harassment committed by male employees, towards most often, high-school aged female employees."}}