{"0": {"Date": " Jul 27, 2017", "Summary": "\"McDonalds\"", "Pros": "I Love being involved with people. Great customer service action", "Cons": "I do not like the way I am talked to as an employee. My manager seems to not know how to communicate or express they way she wants the store to run without screaming and being rude in front of customers."}, "1": {"Date": " Jul 6, 2017", "Summary": "\"No appreciation of employees\"", "Pros": "bonus program for all levels of store management", "Cons": "Owner is completely out of touch with the business. Only interested in bottom line"}, "2": {"Date": " Jul 6, 2017", "Summary": "\"Do Not Reccommend\"", "Pros": "Had some enjoyable co-workersHours were not terrible", "Cons": "Poor, rigid and unsupportive management"}, "3": {"Date": " Jun 21, 2017", "Summary": "\"Manager\"", "Pros": "Great place to work, good team structure", "Cons": "Bad reputation in the world of health"}, "4": {"Date": " Jul 5, 2017", "Summary": "\"nice\"", "Pros": "I mean the french fries were good", "Cons": "I got paid basically nothing"}, "5": {"Date": " Jul 6, 2017", "Summary": "\"crew member\"", "Pros": "Fun coworkersEasy schedulingVery people oriented", "Cons": "Management inconsistentPoor pay"}, "6": {"Date": " Jul 6, 2017", "Summary": "\"Sr Director\"", "Pros": "Great Business Model. Financially sound. Good dedicated employees.", "Cons": "Demands outpace reasonable number of hours available to work."}, "7": {"Date": " Jun 20, 2017", "Summary": "\"i'm lovin' it\"", "Pros": "free food every single day", "Cons": "customers are the absolute worst."}, "8": {"Date": " Jun 21, 2017", "Summary": "\"Horrible\"", "Pros": "Free food, good food, fast food, a lot of options to choose from with what you want to eat that day", "Cons": "Boring, rude managers, strict managers, not allowed to have fun or even talk, some workers are very rude to work with"}, "9": {"Date": " Jul 27, 2017", "Summary": "\"Worst experience of my life\"", "Pros": "Hours were goodIt's a paycheckLike I said it was a paycheckThat's all I gotYep", "Cons": "Crappy employees and Managers with bad attitudesLet other employees have a breaks first even though you've been on shift longerBad attuideOh and bad attuides"}}