{"0": {"Date": " May 24, 2016", "Summary": "\"Ridiculous\"", "Pros": "Good first job experience, shows who is willing to work and who won't make it.", "Cons": "Long hours with managers who complain about doing all the work but actually just sit on their butts. Even me being pregnant right now I still do more work than them."}, "1": {"Date": " May 2, 2016", "Summary": "\"Worn Out Student\"", "Pros": "I LOVE that McDonald's is willing to work with my schedule while I am still in school, there are not many companies that want to be bothered by all the scheduling inconveniences and extra work that comes with building a schedule with many students. I am able to work when I can and also pick up any hours I need on the side. The managers are always willing to help me get what I need in order to devote most of my time to my studies.", "Cons": "People are always getting hired and then just quitting through no call no shows. We work extremely hard day to day and it never seems to be appreciated in the least bit. There is always only criticism and a list of things that we need to work on. We only get thirty minute meal breaks which fly by when you're working a nine sometimes ten hour shift and can't make it to the restroom as you would like to. We are human too and have to be subjected to some extremely harsh circumstances all while expected to smile, be warm and have everything perfect. All to get paid bi-weekly and barely make it to the next pay period. I don't know anyone at my job that can honestly say that they are surviving off of the money they make at McDonald's which is why we have to break our backs just to pay the bills. I have worked at McDonald's for 3 years and my heart breaks for my co-workers and myself, we deserve better."}, "2": {"Date": " May 3, 2016", "Summary": "\"About What You Expect\"", "Pros": "Flexible SchedulesTasks are SimpleEasy to Get A Job", "Cons": "Pay Raises Are Non-ExistentNo Appreciation"}, "3": {"Date": " May 3, 2016", "Summary": "\"Summer job\"", "Pros": "flexible hours. double shifts were not allowed. Schedule was posted well in advance & management allowed you to switch as long as your shift was covered.", "Cons": "low pay. No uniform allowance. Rude customers at times."}, "4": {"Date": " Apr 17, 2016", "Summary": "\"Annoying at times, though constantly eye-opening and enlightening.\"", "Pros": "The best thing about working at McDonald's is the people. You meet all different kinds of people here. I'm lucky because all of my coworkers and almost all of my managers are nice and easygoing. When people ask me about customers, I always tell them that for every mean customer, there's 100 nice customers, and a few extraordinary ones. I've had a customer give me an intricate drawing on a napkin, one gave me book of poems he had written on looseleaf paper and stapled (they were beautiful) and a few have done impressions over the speaker when I take orders, I especially loved the impression of Shaggy from Scooby Doo I got once. There are many lovely people who I meet each shift I work; they are blessings in my work day.", "Cons": "The managers are occasionally over-expectant, sometimes you do not receive enough guidance. Some customers give you an attitude, some treat you like dirt, some treat you like you aren't a person. With each person I meet like this, I just learn more about humanity."}, "5": {"Date": " Apr 17, 2016", "Summary": "\"Crew Member\"", "Pros": "Friendly, helpful, understanding, willing to work with you", "Cons": "Low pay, ask a lot of you for such a low pay"}, "6": {"Date": " Apr 18, 2016", "Summary": "\"General Manager\"", "Pros": "Great company to be at long term", "Cons": "Not many opportunities to advance after GM"}, "7": {"Date": " Apr 18, 2016", "Summary": "\"Good work culture\"", "Pros": "Good work culture. Friendly people.", "Cons": "nothing much, not much flexible with the technology."}, "8": {"Date": " May 1, 2016", "Summary": "\"Just okay\"", "Pros": "You know what you need to do for your shift. You get it done. Nobody will bother you if you keep your head down. Free food sometimes.", "Cons": "I think the cons are obvious. You're working in fast food and doing manual labor. Don't expect much. Very little mobility. Uniforms don't look good."}, "9": {"Date": " May 22, 2016", "Summary": "\"Horrible\"", "Pros": "Can quit without a notice probably your best bet with this place cause you'll hate it.", "Cons": "Food is horrible , one time someone dropped the food and we still served it. Management treats you like your nothing."}}