{"0": {"Date": " Oct 6, 2016", "Summary": "\"Ok job\"", "Pros": "Can be a decent crew, plenty of chances for advancement, basic duties are easy, good training, and if you go for management: college credits towards business degree", "Cons": "Management can be both great and terrible. Can be rushed due to the nature of the business. Control over every aspect of employment, including breathing (yes, its in their McDonald's \"bible\", but hopefully management won't ever grill you on it)"}, "1": {"Date": " Oct 6, 2016", "Summary": "\"It could have been better\"", "Pros": "The people were fun to work with", "Cons": "Upper management showed no respect"}, "2": {"Date": " Oct 6, 2016", "Summary": "\"Never what's promised\"", "Pros": "Flexible, Short drive, discounted or free food", "Cons": "Customers, bad management, slacker coworkers"}, "3": {"Date": " Oct 26, 2016", "Summary": "\"its alright\"", "Pros": "employee discount is a plus", "Cons": "there are no benefits here"}, "4": {"Date": " Sep 20, 2016", "Summary": "\"What do you expect?\"", "Pros": "made money, served hamburgers. some crazy people. you know how it goes its okay though", "Cons": "crazy people. smelt like grease all the time. bad hours its okay though"}, "5": {"Date": " Sep 21, 2016", "Summary": "\"Good\"", "Pros": "Mcdonalds is a good place to start working because it gives you experience with customers and helps you get a feel for how things are going to work in a work place.", "Cons": "A con of working here is sometimes you have rude people who are always complaining and it can be a pretty stressful job."}, "6": {"Date": " Oct 4, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Great for teenagers looking for a first job to make a little spending money.", "Cons": "Not for an adult looking for a job to support a family."}, "7": {"Date": " Oct 4, 2016", "Summary": "\"Crew\"", "Pros": "Learn to hone various physical skills while learning a great deal about working with other people. This can be the most important skill for one's future.", "Cons": "Learning to work despite constant criticism from management, fault finding, and people snapping/chastising the hard working people."}, "8": {"Date": " Oct 4, 2016", "Summary": "\"Review\"", "Pros": "There were always happy and great people to be around.", "Cons": "They don't get orders correct all the time. They have very slow workers."}, "9": {"Date": " Oct 4, 2016", "Summary": "\"Not Favorable\"", "Pros": "Great job for high school kids.", "Cons": "Horrible overall Job for adults!"}}