{"0": {"Date": " Jan 23, 2018", "Summary": "\"It is fun to work their the people are very kind but not all of them are and I want one with a higher paying job\"", "Pros": "Very flexible schedule very understandable with situations", "Cons": "Doesn't pay much hours are not very consistent I want something I know will last and provide me enough money"}, "1": {"Date": " Jan 23, 2018", "Summary": "\"Fun and nice place to work at if you have a lot of patience\"", "Pros": "Very easy to learn and can be used as a stepping stone to other better jobs to improve customer service and social skills. McDonald's is a good place for very young teens to get out there and talk to customers", "Cons": "Customers can sometimes be tough to deal with and some manager are either a hit or miss. You might have an awesome manager who knows what they are doing, and then some who have no clue and lazy."}, "2": {"Date": " Jan 23, 2018", "Summary": "\"Good time\"", "Pros": "Good hours good managers good pay", "Cons": "long hours competitive climbing good"}, "3": {"Date": " Feb 6, 2018", "Summary": "\"Ehh, job.\"", "Pros": "Lots of benefits available upon request.", "Cons": "Lots of work for little pay."}, "4": {"Date": " Feb 6, 2018", "Summary": "\"Work here\"", "Pros": "Good environment to work at", "Cons": "Low compensation rate for employees"}, "5": {"Date": " Feb 7, 2018", "Summary": "\"It's a job\"", "Pros": "pay was okay, could be more", "Cons": "not great hours, smells gross"}, "6": {"Date": " Jan 22, 2018", "Summary": "\"mcdonalds\"", "Pros": "starting pay, and hours for starting employees", "Cons": "lots of work for the pay, and raises should be at least 0.25 each 6 months not 0.10 cents every 6 months."}, "7": {"Date": " Feb 27, 2018", "Summary": "\"Bad Place\"", "Pros": "free food, goof around with coworkers", "Cons": "Bad hours, rude management, rude customers"}, "8": {"Date": " Feb 6, 2018", "Summary": "\"Not the best\"", "Pros": "start from the bottom, the ability is given in order to climb to the top.", "Cons": "Pay is not very good, health insurance is expensive, no dental or vision even offered at all"}, "9": {"Date": " Feb 6, 2018", "Summary": "\"It Helped Me Survive\"", "Pros": "Flexible scheduleRequested days off grantedHelped me pay bills while inI worked at 2 different McDonald's from November 2012 to May 2016. Working at McDonald's helped me get through college. It gave me a great work ethic and taught me when to take the lead.", "Cons": "Unprofessional managementUnmotivated employeesRude customersEven with the pros, these cons outweighed them. At my first McDonald's, every store owner we had (we had 3 in 3 years) only cared about themselves and didn't have true concern for employees. There was a lot of favoritism as well amongst upper management and shift managers when it came to employees."}}