{"0": {"Date": " Sep 25, 2017", "Summary": "\"We would like better salaries\"", "Pros": "People likes to eat this food", "Cons": "It's better go some where else"}, "1": {"Date": " Sep 25, 2017", "Summary": "\"McDonalds\"", "Pros": "People are great to work with. Managers and crew are different and friendly.", "Cons": "The customers are expecting 5 star restaurant service and food, they can come off as very rude. Its not a great job but puts you in social situations and gives you experience."}, "2": {"Date": " Sep 25, 2017", "Summary": "\"Manager\"", "Pros": "Team is great and the atmosphere was a fun team building experience.", "Cons": "People complain and give you dirty looks."}, "3": {"Date": " Sep 10, 2017", "Summary": "\"Loved\"", "Pros": "This job has paved me into being the hard-working young women i am today, thank you for the oppurtunity you have given me to grow and become exceptional.", "Cons": "Didn't really experience any cons working here at Mcdonalds, would absolutely love to work here again, and experience what i once did and enjoyed"}, "4": {"Date": " Sep 10, 2017", "Summary": "\"tiny daisy\"", "Pros": "it is very rewarding, and professionals", "Cons": "waiting area could improve a bit with waiting staff."}, "5": {"Date": " Sep 10, 2017", "Summary": "\"Job\"", "Pros": "free food after hours. okay", "Cons": "its a mcdonalds thats the con"}, "6": {"Date": " Oct 16, 2017", "Summary": "\"Don't work here\"", "Pros": "Free meal when your shift is over", "Cons": "Micromanaging their employees, managers are lazy and expect you to do their work,"}, "7": {"Date": " Oct 16, 2017", "Summary": "\"A job and not much more\"", "Pros": "The people are generally pretty easy to work with, and you can change your availability whenever you want given a couple weeks notice.", "Cons": "The work is boring and tedious, you're micromanaged constantly, and requesting time off is horrible. Time off is \"a request,\" and you generally won't know more than a week in advance if you got the day off or not. You're lucky to get a couple days notice. Pay is also bad."}, "8": {"Date": " Sep 26, 2017", "Summary": "\"Customer Service Representative\"", "Pros": "Oppurtunity is available at some locations", "Cons": "Pay Rate is not that great"}, "9": {"Date": " Sep 26, 2017", "Summary": "\"Slave Work\"", "Pros": "Flexible hours, room for advancement", "Cons": "Paid like a slave for strenuous work in a hostile environment.A lot of drama.Far too busy most days.Don't get paid enough to deal with rude managers.Called in on your days off so you might as well be scheduled 7 days a week,No benefits other than a really bad scholarship for students in high school."}}