{"0": {"Date": " Jan 14, 2017", "Summary": "\"Good\"", "Pros": "My schedule is flexible and when you move up to management McDonald's will pay for your school.", "Cons": "Some of the managers are unprofessional and some of the co workers aren't good people to work with."}, "1": {"Date": " Jan 14, 2017", "Summary": "\"cook\\cashier\"", "Pros": "I enjoyed pleasing my customers because the consumer is right majority of the time and the duties of the job were not dreadful.", "Cons": "My co workers were rude to customers as well as other employees including myself . I found out working in a restaurant wasn't for someone as advanced as me."}, "2": {"Date": " Jan 15, 2017", "Summary": "\"Love my job!\"", "Pros": "My Mcdonnalds has some amazing people to work with. And it's easy work.", "Cons": "some people don't want to work so you pick up the slack. They call off or don't compete their job."}, "3": {"Date": " Jan 29, 2017", "Summary": "\"Assistant Manager\"", "Pros": "It shows you the value of time.", "Cons": "Repetitive and can become very depressing at times"}, "4": {"Date": " Jan 30, 2017", "Summary": "\"the cat in the bag\"", "Pros": "the free food for lunch", "Cons": "always rushing and low pay"}, "5": {"Date": " Jan 14, 2017", "Summary": "\"Great First Job\"", "Pros": "Great:Flexible HoursBenefitsLearning opportunitiesCompany treats employees with respect", "Cons": "Some of the customers can be rudeVery Fast paced"}, "6": {"Date": " Jan 14, 2017", "Summary": "\"Good part time job for high school\"", "Pros": "You get a better understanding of job responsibilities and it's not as bad as some people say, just be sure to get out before you get too old though!", "Cons": "Not a con for the company but I didn't get along with one of my coworkers, but thankfully we didn't share too many shifts."}, "7": {"Date": " Jan 14, 2017", "Summary": "\"Good\"", "Pros": "Nice coworkers, worked as team", "Cons": "Salary left some to be desired"}, "8": {"Date": " Jan 26, 2017", "Summary": "\"Good work\"", "Pros": "Good pay and also good food for lunch", "Cons": "It's McDonalds is there more I have to say"}, "9": {"Date": " Feb 18, 2017", "Summary": "\"Bad management\"", "Pros": "Seeing regulars brightens your day", "Cons": "HORRIBLE MANAGEMENT, unorganized , bad service"}}