{"0": {"Date": " Jun 12, 2016", "Summary": "\"Food Crew\"", "Pros": "Free or discounted food during breakRelationship you build with coworkersYou get to meet new people every daySteady job", "Cons": "Pay is minimum wage, customers or annoying wouldn't recommend. Unless this is your first job we have to start some where."}, "1": {"Date": " May 28, 2016", "Summary": "\"Great managers!\"", "Pros": "I loved the Mcdonalds I worked at! My coworkers were awesome and we all got along and same with most of the managers. We always got great ratings on customer service and the store owners would reward employees every month that really stood out. Overall it was a really positive place to work and you could tell the customers felt it too. The managers were usually really good about helping out when it got too busy and they would always call people in. There was always a great balance between having fun while working which always made it less stressful. Overall it was one of my favorite places working!", "Cons": "Theres only a couple downsides. Working at night and being the only person running the drive-thru was always stressful because we would hit big rushes and so people ended up having to wait longer for their food. And its a minimum wage job until you move up."}, "2": {"Date": " Jun 11, 2016", "Summary": "\"Fun\"", "Pros": "Fun to learn basics of management.", "Cons": "Difficult to keep employees."}, "3": {"Date": " Jun 11, 2016", "Summary": "\"mcdonlds\"", "Pros": "loved working with people and owner", "Cons": "some of the new managment team"}, "4": {"Date": " Jun 12, 2016", "Summary": "\"eeh\"", "Pros": "the pros is that you get to eat all of the left overs at the end of the day and stuff", "Cons": "the cons are that there is a lot of old angry people that will try to cause problems on purpose"}, "5": {"Date": " Jun 12, 2016", "Summary": "\"Good for students\"", "Pros": "the best is the flexible work hours and good staff more than likely they will give you time off if you ask unless they are booked", "Cons": "the people can be very fustuating to deal with many people can be uneducated or ignorant and makes it a hard job to keep a smile on"}, "6": {"Date": " May 27, 2016", "Summary": "\"Awesome part time job\"", "Pros": "Flexible schedule, great pay, great managers", "Cons": "The hat, people show up late to relieve you."}, "7": {"Date": " May 27, 2016", "Summary": "\"Doing cashier and doing orders and taking out meals to windows\"", "Pros": "I was enjoying making friends and getting to enjoy being in a crew", "Cons": "Its was taking orders in a cashier machine and it was kind of hard but was getting practice done"}, "8": {"Date": " Jul 2, 2016", "Summary": "\"Crew\"", "Pros": "The food half off some the worker are nice", "Cons": "So they take look at u and tell if they like you I got fired BC I call in 3 hour to my shift and told them I be late bc of babysister got fired BC of that b4 I they treated me disrespect told me I couldn't take trash out bc am a girl then they worked me 12 hour without a break everyone else did"}, "9": {"Date": " Jun 11, 2016", "Summary": "\"Good but Bad\"", "Pros": "Good work environment, nice people to work with, had a good time while working there", "Cons": "Bosses pick favorites and if you aren't a managers favorite then you a basically a nobody."}}