{"0": {"Date": " Oct 27, 2017", "Summary": "\"NEEDS BETTER TRAINERS\"", "Pros": "always hiring and great way to get into customer service.", "Cons": "Should give better opportunities to move up the ranks."}, "1": {"Date": " Oct 12, 2017", "Summary": "\"I have 4 years of experience\"", "Pros": "I love working at fast food restaurants. I’m a peoples person with great communication skills and a friendly great smile to make my customers happy", "Cons": "Sometimes with these type of jobs they get angry rude customers that come in but I know how to deal with"}, "2": {"Date": " Oct 12, 2017", "Summary": "\"it's great\"", "Pros": "great workers and friendly people , great food. never disappointed. i love the smoothies . . . . . . .", "Cons": "rude customers. . . . . . . . . . . . . . . ......  .... . . . .."}, "3": {"Date": " Oct 27, 2017", "Summary": "\"My first job\"", "Pros": "First job so I learned about managing work with school and also how to interact with superiors", "Cons": "It is a minimum wage level job so in most cases managers do not care much about you"}, "4": {"Date": " Oct 12, 2017", "Summary": "\"manager\"", "Pros": "great managers to work fo", "Cons": "hours are long and unable to get my days off"}, "5": {"Date": " Oct 12, 2017", "Summary": "\"Good but simotimes there is s bad coworker\"", "Pros": "Good hoursFlexible with hoursSome good managersGood pay if u work obernight gheyvstarted me at 9.50.", "Cons": "There is always that one person that u be the enemyIf u work overnight better be prepare to get busy all night long"}, "6": {"Date": " Oct 26, 2017", "Summary": "\"to the point\"", "Pros": "good place to cut your teeth in a fast pace environment.", "Cons": "some employees deem fast food below them, and put little thought or care into service and quality assurance. an environmental hazard"}, "7": {"Date": " Oct 26, 2017", "Summary": "\"First Job\"", "Pros": "Great place to learn responsible as well as make friends.", "Cons": "Work are for no money."}, "8": {"Date": " Oct 26, 2017", "Summary": "\"ok to wrk\"", "Pros": "ok to work for when u need a job", "Cons": "not a great place to wrk in the heat"}, "9": {"Date": " Oct 27, 2017", "Summary": "\"Cashier\"", "Pros": "Meeting new people, medical insurance opportunities", "Cons": "Unprofessional enviroment, Different Customers with different Attitudes"}}