{"0": {"Date": " Apr 2, 2018", "Summary": "\"Manager\"", "Pros": "Good Atmosphere, People were respectful to me and other employees", "Cons": "Bad Food, Dirty kitchen sometimes"}, "1": {"Date": " Apr 1, 2018", "Summary": "\"You Get Out What You Put In\"", "Pros": "A great entry level position, flexible scheduling is a huge perk.", "Cons": "Can be rough to advance, but if you put your head down and work hard it happens."}, "2": {"Date": " Apr 1, 2018", "Summary": "\"Part Time Cashier\"", "Pros": "Decent starting pay and hours", "Cons": "Not much room for advancement"}, "3": {"Date": " Mar 31, 2018", "Summary": "\"Good Job\"", "Pros": "Good schedule flexibility and managers are well informed.", "Cons": "You have to do a lot of standing, which is tiring."}, "4": {"Date": " Mar 31, 2018", "Summary": "\"Crew member\"", "Pros": "You Get To Meet New People Experience New Things Learn New Things And Build Your Learning And speed Skills .", "Cons": "Sometimes the customers are grumpy and You Have To Deal With It"}, "5": {"Date": " Mar 30, 2018", "Summary": "\"A good job for students\"", "Pros": "They were usually flexible with the schedule and are quick to promote you if your a good worker. Also you get half off the food before, after, or during your shift and most coworkers were friendly.", "Cons": "Rude customers, having to work until 1 or 2 am towards the end of my experience working there because they were short staffed ( this was why I quit)."}, "6": {"Date": " Mar 30, 2018", "Summary": "\"Crew Trainer\"", "Pros": "Staff is great and managers can be really nice and extremely helpful.", "Cons": "Upper management can be very unresponsive to requests for availability changes in regards to school."}, "7": {"Date": " Mar 29, 2018", "Summary": "\"looking for a job in computers\"", "Pros": "fixing computers and downloading software on the computers", "Cons": "not finding a job"}, "8": {"Date": " Mar 29, 2018", "Summary": "\"Great place to work\"", "Pros": "Free food, customer service, salary", "Cons": "Customers that are idiots and picky"}, "9": {"Date": " Mar 29, 2018", "Summary": "\"Life working at McDonald's\"", "Pros": "Will work with you on a balance schedule and help through scholarships for school.", "Cons": "Need to communicate and work together as a team."}}