{"0": {"Date": " Feb 18, 2016", "Summary": "\"horrible\"", "Pros": "Stay away from this place", "Cons": "Poor wages and long hours"}, "1": {"Date": " Jan 12, 2016", "Summary": "\"Good place to work if it's your first job\"", "Pros": "The good thing about McDonald's as a first job is its real easy to handle and grasp in a short time.", "Cons": "The bad thing I'd have to say is the pay and admittedly the sometimes loony customers that walk through the door."}, "2": {"Date": " Jan 12, 2016", "Summary": "\"Management\"", "Pros": "Flexible scheduling and great benefits.", "Cons": "Overworked and over looked. Constant change."}, "3": {"Date": " Jan 12, 2016", "Summary": "\"Love It\"", "Pros": "Lots of fun; very flexible", "Cons": "Discount is horrible; Some customers can be rude"}, "4": {"Date": " Jan 13, 2016", "Summary": "\"Great\"", "Pros": "It was very awesome and nice", "Cons": "None it was great and nice"}, "5": {"Date": " Jan 13, 2016", "Summary": "\"Shift Leader\"", "Pros": "Flexible scheduleGreat management teamGood training", "Cons": "There are really no downside to working at McDonald's unless you have a negative attitude."}, "6": {"Date": " Jan 13, 2016", "Summary": "\"Seems great\"", "Pros": "Have great people here and the pay the food is great. I love the look of the store its clean and professional. Can't wait to actually start working there officially.", "Cons": "That it is fast food. But I do say I love my fast food. Another con is that I would be eating extra fast food which isn't good too much either."}, "7": {"Date": " Jan 26, 2016", "Summary": "\"Temporary at best.\"", "Pros": "It's busy enough to keep your mind off the clock most of the time, and casual enough that you don't usually have to worry about them trying to get you to stay when you decide to leave.", "Cons": "Most fast food is generally someplace you want to keep yourself in for as little time as possible, but this place took it to a whole new level. If it weren't for a couple managers whom I became friends with, there's no way I'd have stayed there as long as I did. As it is, I still lasted longer than most people who came through there."}, "8": {"Date": " Jan 26, 2016", "Summary": "\"Working at McDonalds\"", "Pros": "good pay and overall decent work place", "Cons": "hours of just pressing picture and being constantly rushed to throw food in a bag. Alot of angry customers and managers."}, "9": {"Date": " Jan 26, 2016", "Summary": "\"Love the people hate the manager\"", "Pros": "The people are almost always very nice and most customers are cool. The job itself is easy.", "Cons": "The managers are horrible. They have no respect for their employees and expect them to do more than is physically possible."}}