{"0": {"Date": " Jun 23, 2017", "Summary": "\"Eh\"", "Pros": "They gave me a lot of hours.", "Cons": "Not really flexible in scheduling like they say, crew start back at square one in pay when they leave but managers kept the pay they had when they left."}, "1": {"Date": " Jun 23, 2017", "Summary": "\"What you'd expect\"", "Pros": "Relaxed workplace, easy stress free job", "Cons": "Dealing with consumers, management, working around kitchen"}, "2": {"Date": " Jun 7, 2017", "Summary": "\"Team member\"", "Pros": "Working with the employees and some customers was as well. Some even gave tips", "Cons": "Working with the employees was great!!"}, "3": {"Date": " Jun 7, 2017", "Summary": "\"Very good for entry level\"", "Pros": "Good beginner experience with communication & learning job environment", "Cons": "Very casual at times, could pay more to managers"}, "4": {"Date": " Jun 8, 2017", "Summary": "\"Loved it\"", "Pros": "Free food and fries and drinks", "Cons": "Not a good pay or career"}, "5": {"Date": " Jun 22, 2017", "Summary": "\"Management\"", "Pros": "Working in most cases as a team is satisfying. Good pay and benefits", "Cons": "Long hours, ever changing procedural and operational standards."}, "6": {"Date": " Jun 23, 2017", "Summary": "\"One of the worst experiences of my life\"", "Pros": "I worked at this company for five years, and I learned different kitchen and customer service skills. I also learned different ways to handle problems with customers. I felt that this strengthened my potential to be a valuable employee. The free soft drinks were nice, too!", "Cons": "Expect to be treated like trash (especially if you're new). Managers were rude and disrespectful to the employees they were training. They also tolerated an uncomfortable work environment by encouraging other employees to talk bad about other employees in a different language and laugh and scoff at their performance. They also give you really short, lame hours, which doesn't give the new employee a chance to adapt to or learn anything. Managers are sneaky and manipulative if they don't like you. This was a stressful environment which I felt was very unproductive. Employees did not always follow rules and procedures when they were rushed. Often, there was only one person making the sandwiches/assembling the food when there is supposed to be two. You literally have to be best friends with all the employees in order to survive at this job. There is no sense of real teamwork here otherwise."}, "7": {"Date": " Jun 7, 2017", "Summary": "\"Overall Review Of McDonalds\"", "Pros": "Great Work Environment, Fellow Co-Workers Make You Feel At Home And Like Your Part Of A Family", "Cons": "Not Many Hours During The Winter Time"}, "8": {"Date": " Jun 7, 2017", "Summary": "\"Coworkers\"", "Pros": "One main reason to work here is the team is nice and treats you like family", "Cons": "They work you to the bone and only give you a 15 minute break"}, "9": {"Date": " Jun 21, 2017", "Summary": "\"Nice work setting to start with\"", "Pros": "Flexible hours and nice workers", "Cons": "Long shifts and shorthanded on staff"}}