{"0": {"Date": " Aug 20, 2017", "Summary": "\"Job\"", "Pros": "Easy job and flexible schedule and free food", "Cons": "Everything about the company"}, "1": {"Date": " Jul 15, 2017", "Summary": "\"Helps pay for college, if you're there over a year.\"", "Pros": "Great Benefits if you're going to school, or wanting to go back to school. Flexible hours.", "Cons": "The give raises every 6 months, but they're tiny."}, "2": {"Date": " Jul 28, 2017", "Summary": "\"cook\"", "Pros": "Good company, luv gettin free food when i work cause im broke", "Cons": "smelling like hamburgers when you leave work"}, "3": {"Date": " Jul 28, 2017", "Summary": "\"cashier\"", "Pros": "free food good people and fun", "Cons": "always have to keep you the people happy"}, "4": {"Date": " Jul 29, 2017", "Summary": "\"Wasnt Bad\"", "Pros": "Hours are goodPay is decentManagers can be nice", "Cons": "Jobs only fun if you are working with good peopleits McDonalds so you know"}, "5": {"Date": " Jul 13, 2017", "Summary": "\"Great\"", "Pros": "You learn a lot if are a humble person", "Cons": "You don't make a lot but that's expected."}, "6": {"Date": " Jul 13, 2017", "Summary": "\"CA\"", "Pros": "I was just hired and I begin working tomorrow, everyone seems nice so far. The environments pace depends on the time of day.", "Cons": "You gotta get a food handlers card which takes like one to two hours and they could communicate a little clearer to avoid confusions."}, "7": {"Date": " Jul 28, 2017", "Summary": "\"It is what it is\"", "Pros": "Fair compensation for mindless work.", "Cons": "Mindless work that doesn't add much career value."}, "8": {"Date": " Jul 28, 2017", "Summary": "\"Confusing\"", "Pros": "You would have a good discountQuick and easy payOver time", "Cons": "The customers was horribleThe employers was rudeThey try to get over on you"}, "9": {"Date": " Jul 13, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Decent payGood hoursGood peopleEasily manageable workload", "Cons": "Very busy at timesDifficult to Progress"}}