{"0": {"Date": " Sep 20, 2016", "Summary": "\"Cook\"", "Pros": "Receiving a discounted meal everyday is pretty coolJob doesn't require a lot of training.Flexible schedules are great if you're a student.", "Cons": "Working on holidays.Sometimes managers can create a super stressful environment.Co-workers sometimes slack off too much, and take extended breaks."}, "1": {"Date": " Sep 20, 2016", "Summary": "\"good\"", "Pros": "She gives a very flexible schedule", "Cons": "she does not value her employees"}, "2": {"Date": " Oct 12, 2016", "Summary": "\"Underpaid\"", "Pros": "Somewhat flexible hours for employees.", "Cons": "paid barley over min wage as a manager. worked from 4am-noon due to what they thought would benefit my life. DRAMA. The managers even had a lot of drama. It was like high school all day long, only from people who are 20 years older than high schoolers."}, "3": {"Date": " Sep 20, 2016", "Summary": "\"Cliques and Coffee\"", "Pros": "Working with the public and being able to teach kids. Cold drinks and coffee.", "Cons": "Not family friendly when it comes to your own well being. Unable to make/schedule appointments because you are never off at time scheduled, sometimes you may be there over an hour past the scheduled time. No human resource to rely on, and when someone doesn't do something correctly they are yelled at in front of crew/public it doesn't matter. Incentives may be a free meal here and there, otherwise you get one 1/2 price meal during your work day no matter if you put in 24 hours! Lots of management turnover. Very poor training for new hires. Rules seem to change from one person to the next. If you fix or clean something that is very noticeable, good luck on receiving any star, pat on the back or thank you! Customer service is few and far between! Management and employees bad mouth others quite a bit. If you are depressed I would highly not recommend working here! Lots of cliques....."}, "4": {"Date": " Sep 20, 2016", "Summary": "\"Terrible\"", "Pros": "Great for high school studentsExcellent fast food job experience/preparationEasy to learn", "Cons": "Very fast paced (almost overwhelming)Very tough on employeesJob pays too low for too much work"}, "5": {"Date": " Sep 5, 2016", "Summary": "\"Mc Donalds\"", "Pros": "I really like the employees I work with. The mangement isnt the best!", "Cons": "The management isnt up to par. We get treated like where only used for the work they dont want to do"}, "6": {"Date": " Sep 6, 2016", "Summary": "\"Excellent Company\"", "Pros": "It was not a hard experience overall and was a nice first job. The pay was competitive however I didn't stay long enough.", "Cons": "Does have it's busy times and can be very stressful in those times. You will never get paid very much."}, "7": {"Date": " Sep 19, 2016", "Summary": "\"Okay\"", "Pros": "Flexible, they really will work with you on your schedule", "Cons": "Horrible pay. But I mean it's mcdonalds"}, "8": {"Date": " Sep 19, 2016", "Summary": "\"It was an off and on relationship.\"", "Pros": "The people who worked there were friendlyAll hard workers", "Cons": "Not the best food quality"}, "9": {"Date": " Sep 19, 2016", "Summary": "\"Pay was bad\"", "Pros": "Flexible hours fun fast easy", "Cons": "Pay supervisor managers disloyal money hungry"}}