{"0": {"Date": " Dec 8, 2017", "Summary": "\"Fry Cook\"", "Pros": "Great People to work with", "Cons": "Often forgot requested time off even when it was written down"}, "1": {"Date": " Dec 8, 2017", "Summary": "\"cashier\"", "Pros": "This is a great place to work!", "Cons": "There are no cons at the moment."}, "2": {"Date": " Dec 9, 2017", "Summary": "\"Crew\"", "Pros": "Fun coworkers, easy job once you get the hang of it, flexible hours/ schedule, fast environment", "Cons": "Sometimes drama, stressful at times, fast environment,"}, "3": {"Date": " Dec 9, 2017", "Summary": "\"McDonald's Was A Great Pathway Job!\"", "Pros": "Was a good transition from The MilitaryEasy workFun workBusy environmentFun People with great stories", "Cons": "A little TOO greasy lolVery loud environmentStressful when busy"}, "4": {"Date": " Dec 22, 2017", "Summary": "\"Customer Service\"", "Pros": "Friendly customers, quick paced and clean.", "Cons": "Rude customers, rude management and no organization."}, "5": {"Date": " Dec 8, 2017", "Summary": "\"Shift Manager\"", "Pros": "Flexible scheduling especially for students.", "Cons": "Really stressful when not enough crew are hired."}, "6": {"Date": " Dec 8, 2017", "Summary": "\"Crew\"", "Pros": "Great people to work with, flexible with schedules, fast pace", "Cons": "rude customers, most the managers have favorites"}, "7": {"Date": " Dec 21, 2017", "Summary": "\"great\"", "Pros": "they provide stable hours year around", "Cons": "fast environment, high pressure, you can't seat any time even if it is slow"}, "8": {"Date": " Dec 21, 2017", "Summary": "\"I got the opportunity to learn the virtue of communication, cleanliness, and keeping customers happy\"", "Pros": "It was overall just a huge learning opportunity. It showed me that not all customers are nice and there are many ways to keep someone happy", "Cons": "It can, at times, be incredibly stressful, sometimes for actually little to no reason at all. Also, some people dont seem to be energized enough to work"}, "9": {"Date": " Jan 11, 2018", "Summary": "\"Barely worth it\"", "Pros": "Work effort, cash while in high school", "Cons": "Illegal work hours, food that'll make you sick, almost no breaks"}}