{"0": {"Date": " Jun 2, 2017", "Summary": "\"Sucks\"", "Pros": "Free food, kinda fun if you're an assembly person or the drive thru window guy.", "Cons": "Smell of grease infects your skin and clothes, and its super hot in the kitchen."}, "1": {"Date": " Jun 2, 2017", "Summary": "\"Eh.\"", "Pros": "At the very least, it pays", "Cons": "Not a big fan of fast food"}, "2": {"Date": " May 17, 2017", "Summary": "\"Burger flipper\"", "Pros": "Food, experience, and understanding of the industry", "Cons": "Long hours and heavy work load"}, "3": {"Date": " Jun 2, 2017", "Summary": "\"Employee\"", "Pros": "Close to home, great shift leaders", "Cons": "Not enough hours, not enough employees"}, "4": {"Date": " Jun 22, 2017", "Summary": "\"Managers are not the best\"", "Pros": "The people you got to meet.", "Cons": "The managers talk bad about you in Spanish, make fun of you and then when they really need you, they act two-faced."}, "5": {"Date": " May 17, 2017", "Summary": "\"Cashier\"", "Pros": "It was fun for work.", "Cons": "It smelled like fries sometimes."}, "6": {"Date": " May 30, 2017", "Summary": "\"This job is OK, they are really flexible with your hours, and understand that school is most important.\"", "Pros": "It pays a little over minimum wageHours are really flexibleThey understand that schools is most important", "Cons": "I have en working there for a year and eight months as of 5/30/17, and not have had a review or a raise."}, "7": {"Date": " May 16, 2017", "Summary": "\"General Review\"", "Pros": "The company as a whole offers flexible scheduling which is great for students, room for advancement in management, paid training, benefits included", "Cons": "Some of the downsides to working there are the dissatisfied guests which happens on occassion or employees that are either non-compliant or calling in all the time"}, "8": {"Date": " May 16, 2017", "Summary": "\"This job provides many opportunities towards growth and education.\"", "Pros": "The people whether customers or co-workers are what really make the job enjoyable. Without them it would be just another job.", "Cons": "It can be stressful at times due to the large workload. The biggest con is the negative view people have on those who work in the fast food industry"}, "9": {"Date": " Jun 1, 2017", "Summary": "\"Cashier review\"", "Pros": "Getting payed weekly was the best pro", "Cons": "Customers were incredibly rude, i could not handle it"}}