{"0": {"Date": " Feb 18, 2016", "Summary": "\"awesome\"", "Pros": "Great work environment and atmosphere", "Cons": "not enough committed employees. Lots of dead time and you can only clean so much then rush hours there's not enough help"}, "1": {"Date": " Mar 24, 2016", "Summary": "\"I'm hating it\"", "Pros": "Food discountEasy workGood coworkersEasy menu to learn", "Cons": "ManagementPoor trainingLittle to no feedback for job performanceAsked to train new hires without being fully trained myself"}, "2": {"Date": " Mar 24, 2016", "Summary": "\"I just need a really new job asap\"", "Pros": "Good customers & nice people", "Cons": "Not enough pay , disrespect , not getting the days and hours I deserve and that I work hard for."}, "3": {"Date": " Mar 25, 2016", "Summary": "\"Drive Thru Specialist\"", "Pros": "Great peopleOpportunity to move up", "Cons": "Managers look down at overnight employeesManagers expect night shift to do the work of 10+ people"}, "4": {"Date": " Mar 3, 2016", "Summary": "\"order\"", "Pros": "It was fine but a little stressful especially during rush hours like early morning, lunch. and evenings. I like that I used to get meal discounts when I used to go on breaks. The time used to go by fast because I used to be so busy. I like that I used to get my food made fresh because I used to work there.", "Cons": "The scheduling was horrible. I felt very constricted and couldn't get any off days unless for school/classes."}, "5": {"Date": " Mar 4, 2016", "Summary": "\"Crew member\"", "Pros": "Make new friends and discover new food", "Cons": "Too much grease, sometimes gets very stressful. might get burned around the grill area"}, "6": {"Date": " Mar 4, 2016", "Summary": "\"Decent\"", "Pros": "Easiest job I have ever had", "Cons": "I was bored a lot"}, "7": {"Date": " Mar 4, 2016", "Summary": "\"Cook\"", "Pros": "You get free food at lunch, which is something at the very least. The work is easy, but it's tiresome.", "Cons": "You don't get paid much, you work irregular hours, and you can sometimes have a hard time trying to schedule days off."}, "8": {"Date": " Feb 17, 2016", "Summary": "\"Flexible\"", "Pros": "The hours are very flexible, which works great as I'm in college studying to be an engineer. Very relaxed place to work, not a high-stress job.", "Cons": "Constantly picking up after employees, people always calling out, complaining that this job is too hard, and lack of communication."}, "9": {"Date": " Feb 17, 2016", "Summary": "\"Good temporary place to work.\"", "Pros": "Depends on which one you work at.", "Cons": "Can get a little hectic"}}