{"0": {"Date": " Aug 11, 2016", "Summary": "\"Crew member\"", "Pros": "Fast paced, fun environment, good co-workers.", "Cons": "Management was hard to get along with."}, "1": {"Date": " Aug 12, 2016", "Summary": "\"Good start\"", "Pros": "Overall well rounded job experience with customer service", "Cons": "Slef learning with little guidance but you just have to keep it cool"}, "2": {"Date": " Jul 27, 2016", "Summary": "\"mcdonalds\"", "Pros": "great experience and cool management", "Cons": "bad communication , never talks or try to work together"}, "3": {"Date": " Jul 28, 2016", "Summary": "\"griller\"", "Pros": "free food, help customers, and start good relations", "Cons": "its not bad at all. we have plenty of work. always smells like food"}, "4": {"Date": " Aug 12, 2016", "Summary": "\"Won't go back in that kind of business\"", "Pros": "It's was a every good job. Lots of fun working there it's was something new", "Cons": "That's more of summer job for teens cause the pay is bad"}, "5": {"Date": " Jul 27, 2016", "Summary": "\"cashier\"", "Pros": "I Loved my job friendly and well organized", "Cons": "only thing I had a problem with was accomdations for my disability and paratransit"}, "6": {"Date": " Jul 27, 2016", "Summary": "\"Great Place\"", "Pros": "Friendly people to work with.", "Cons": "End up eating to much."}, "7": {"Date": " Jul 27, 2016", "Summary": "\"Assistant Manager\"", "Pros": "Fast pace depending on location of business.", "Cons": "Be careful of location, it determines the job."}, "8": {"Date": " Jul 27, 2016", "Summary": "\"General Manager\"", "Pros": "Make your own schedule, excellent benefits with bonus opportunities.", "Cons": "Your never off work, even on vacation you will get calls and text messages about issues at your store."}, "9": {"Date": " Jul 28, 2016", "Summary": "\"Department Manager\"", "Pros": "Good pay for my area. Insurance, Bonus plan and vacation. Flexible hours and time of requests honored.", "Cons": "Nights, weekends and holidays. Stressful shifts sometimes and rude customers."}}