{"0": {"Date": " Jan 11, 2018", "Summary": "\"McDonald’s\"", "Pros": "The pay is good, everyone is nice to work with, most of the customers are nice, and it’s a good work environment.", "Cons": "The hours are all mixed up, sometimes we’re short staff and you have to stay longer cause of that."}, "1": {"Date": " Jan 11, 2018", "Summary": "\"Cashier\"", "Pros": "Very fast paced working environment that will help you out in the long run with top notch companies that have no room for mistakes.", "Cons": "Unfortunately managers seem not to care as much if you have multiple customers and leave you by yourself to take care of everything."}, "2": {"Date": " Dec 26, 2017", "Summary": "\"excellent benifits\"", "Pros": "meeting people, respecting the customers and co workers, paid vacations, room for growth, even pay for your college.", "Cons": "unhappy customers, employees that don't take customers are the reason we are here."}, "3": {"Date": " Dec 26, 2017", "Summary": "\"Customer service\"", "Pros": "The people I. Worked with were great", "Cons": "How you smell when you get off"}, "4": {"Date": " Dec 26, 2017", "Summary": "\"Amazing experience for anyone looking to do ANYTHING\"", "Pros": "I knew from the time I was in first grade I wanted to be a teacher. The lessons that I learned from working at McDonalds helps me in my teaching career! Flexible schedule", "Cons": "You smell when you are finished working."}, "5": {"Date": " Dec 26, 2017", "Summary": "\"It was rough. They do not have enough employees for the overnight shift, that manager desperately deserves more help.\"", "Pros": "The people I worked with couldn't have been any better of a team. As long as everyone is willing and works together it all works out.", "Cons": "The certain hours we call \"rushes\". For example lunch time is very hectic and the breakfast hours are also unimaginable."}, "6": {"Date": " Jan 31, 2018", "Summary": "\"Crew\"", "Pros": "Other crew and great cuztomers", "Cons": "Rules arenot applied faidly to crew and management."}, "7": {"Date": " Jan 10, 2018", "Summary": "\"cashier\"", "Pros": "It is not that bad it is just how the managers are.", "Cons": "managers are always taking things out on their workers"}, "8": {"Date": " Jan 10, 2018", "Summary": "\"Not worth the money\"", "Pros": "Nice People, Free Food, Easy to tailor your schedule, Easy to get days off,", "Cons": "Management, Free Food, Some employees don't do their job, lack of organization"}, "9": {"Date": " Dec 27, 2017", "Summary": "\"Great first time/part time/full time job.\"", "Pros": "Works with part time schedules.Free meal for working a shift.Job is easy to do with proper training.", "Cons": "Short staffed a lot.No benefit pack for part time employees."}}