{"0": {"Date": " Aug 10, 2016", "Summary": "\"It was an alright job\"", "Pros": "Good job for high school student consistent money", "Cons": "Not enough hours if you are graduated"}, "1": {"Date": " Jul 26, 2016", "Summary": "\"Manager\"", "Pros": "Great place to work and start career", "Cons": "really I can't think of none"}, "2": {"Date": " Jul 26, 2016", "Summary": "\"Good first job.\"", "Pros": "I enjoyed my time working for McDonald's as a kid. It helped me adapt and learn to work under someone. I believe the collection of individuals are of a different up bringings making for an experience.", "Cons": "The turn over rate was rather high. People would tend to do just enough to get by. It was remotely concerning for the time being."}, "3": {"Date": " Jul 26, 2016", "Summary": "\"Prep / Cashier\"", "Pros": "Depending on the owner operator they can be a great company to work for , but not with a racist manager like I had in Picayune Ms.", "Cons": "Have to work long shifts sometimes without a break because they are always short handed."}, "4": {"Date": " Jul 27, 2016", "Summary": "\"Fryer\"", "Pros": "Great Benefits are great woo", "Cons": "Poor Hours are bad booo"}, "5": {"Date": " Aug 9, 2016", "Summary": "\"title\"", "Pros": "it Was not hard to do it, paid okay and the hours were flexible to your schedule, whether you were busy or not", "Cons": "there were some days that were busy and it took a lot of time to get things done with no help"}, "6": {"Date": " Aug 9, 2016", "Summary": "\"1st assistant\"", "Pros": "Great customers and employees. Fun work environment. New faces", "Cons": "Always short staffed man agent is unreliable and two faced"}, "7": {"Date": " Aug 9, 2016", "Summary": "\"Okay as a starter job\"", "Pros": "Getting to know people.Learning the ways of fastfood.Getting a paycheck.", "Cons": "Management.Hours.Low pay.Rude and demanding customers.Sketchy crew members."}, "8": {"Date": " Aug 10, 2016", "Summary": "\"Part Time\"", "Pros": "Needed money over the summer and that is why I worked at McDonald. It is basic job which only requires you to move quickly.", "Cons": "You can get easily bored and you also have to deal with weird clients which is kind of stressing"}, "9": {"Date": " Jul 25, 2016", "Summary": "\"McDonald's\"", "Pros": "Free or discounted mealsPaid vacationsHealth insuranceStocksSick payCompetitive salaryFlexible schedule", "Cons": "Long hours on your feetConstant talkingDiscipline insubordinate crew membersRude guestsLimited choices in health insurance"}}