{"0": {"Date": " Nov 6, 2016", "Summary": "\"Not a good place to stay long\"", "Pros": "Flex schedule, sometimes I only work 1 day for schools", "Cons": "+ Making junk food for people will soon make you feel wrong with what you are doing+ No benefits: they dont give more money if u work night shift and holidays. Lunches are 50% off not 100% for part time workers.+ Managers are those who work there for a long time, not those who have managing skills+ It will soon get boring"}, "1": {"Date": " Nov 7, 2016", "Summary": "\"lousy employer\"", "Pros": "some of the mangers are nice", "Cons": "They do not communicate with there employees to wellIf they are letting you go they should not make you find out by not putting you on the weekly schedule"}, "2": {"Date": " Nov 7, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Sometimes it's easy, especially at night", "Cons": "They don't schedule enough people sometimes and one person has to do everything and it's stressfull"}, "3": {"Date": " Oct 22, 2016", "Summary": "\"Management\"", "Pros": "This company has lots of potential for overtime and lets you work within your schedule. I really enjoyed the work and people I met while working here.", "Cons": "low pay and lack of focus on training. Also petty customers sometimes."}, "4": {"Date": " Nov 6, 2016", "Summary": "\"Don't make it a career\"", "Pros": "If you are a student and would like to find some work , you should work here because the checks are a good start for someone who is a full-time student.", "Cons": "You can't always control your staff members, so when they mess up an order you tend to get the backlash of it."}, "5": {"Date": " Nov 6, 2016", "Summary": "\"A-Okay\"", "Pros": "You should work at McDonald's because who doesnt like a big Mac with fries and a Powerade. And you get to give people that", "Cons": "The floors are sticky and it makes my shoes squeaky and annoying. It be messing up my Jordan's FAM you know what I mean"}, "6": {"Date": " Oct 21, 2016", "Summary": "\"mcdonalds\"", "Pros": "great place to start your working career.", "Cons": "having to deal with lots of angry customers."}, "7": {"Date": " Nov 26, 2016", "Summary": "\"Crew member\"", "Pros": "It's a good start off job.", "Cons": "No flexibility with employees schedule and it's unorganized"}, "8": {"Date": " Oct 21, 2016", "Summary": "\"Perfect!\"", "Pros": "Great place location and people. It is close to my home and my Parents's house. I can visit them on my way home.", "Cons": "Customers can be mean but you have to take that with a grain of salt and have the right attitude to brush it off. Doing so will help make you a better employee."}, "9": {"Date": " Oct 21, 2016", "Summary": "\"MGR\"", "Pros": "They give you as many hours as you want since we are always short staffed. The day goes by fast. You learn skills that will be an asset when you it's time to change jobs.", "Cons": "Employees always late, no show, or never show up again. It's a lot of hard work and way too much stress. Need work life balance."}}