{"0": {"Date": " Dec 14, 2016", "Summary": "\"Flexible job for students\"", "Pros": "Flexible schedule, get used to the job quickly", "Cons": "Lack equipment maintenance, management pushy and slack-off at times, will see non-sense rules pop up once in a while"}, "1": {"Date": " Dec 28, 2016", "Summary": "\"cashier\"", "Pros": "Everyone was really nice to work with. Able to get as many hours as I wanted if I stayed under 40.", "Cons": "Did not like to give overtime."}, "2": {"Date": " Dec 28, 2016", "Summary": "\"Mcdonnalds\"", "Pros": "I had a good family of crew members at mcdonnalds and a good support system, I also developed relations with my managers, and co workers, and it helped me get threw the day. I also learned how to make various drinks and sandwhiches, as well as how to run a cashier, etc.", "Cons": "The customers were rude, alot of the crew was very lazy, smoked on the job, came in hung over, did not comply with company and health regulations, none of them performed their cleanliness tasks, they had messy work places, and alot of them had a lot of had personal issues with each other and they let it come out at work. Also they promoted people with less experience and knowledge of the job often, when there were others that deserved the job, but they had some attendance isues because of their health."}, "3": {"Date": " Jan 18, 2017", "Summary": "\"cashier\"", "Pros": "most of the customers were great; you always got food at the end of your shift or during your shift .", "Cons": "managers sucked , some of the customers were extremely rude and none of the employees really cleaned the lobby.."}, "4": {"Date": " Dec 13, 2016", "Summary": "\"McDonald's Crew Worker\"", "Pros": "Flexible hours for studentsFree food on breaks", "Cons": "Low pay; minors make under minimum wager"}, "5": {"Date": " Dec 13, 2016", "Summary": "\"AM Shift Worker\"", "Pros": "Fast paced, good pay, and free drinks at work.", "Cons": "Not every employee was reliable."}, "6": {"Date": " Dec 13, 2016", "Summary": "\"Cook\"", "Pros": "Very friendly. They are consistant", "Cons": "Not very attractive. Hard to understand sometimes."}, "7": {"Date": " Dec 13, 2016", "Summary": "\"shift manager\"", "Pros": "Great people great customers! Really friendly", "Cons": "Rude staff ! Poor management!"}, "8": {"Date": " Dec 13, 2016", "Summary": "\"General Manager\"", "Pros": "Good Training, Tuition Reimbursement Program", "Cons": "Long hours, High Stress, Adult Babysitter"}, "9": {"Date": " Dec 27, 2016", "Summary": "\"Decnet\"", "Pros": "was very flexible with my schedule", "Cons": "A lot of work sometimes"}}