{"0": {"Date": " May 7, 2016", "Summary": "\"manager was rude and food sucks\"", "Pros": "It was overall a great experience due to the fact that the staff was genuine and helpful. Always looked forward to work there.", "Cons": "The amount of hours worked was not right."}, "1": {"Date": " Apr 22, 2016", "Summary": "\"Crew Trainer Mcdonalds\"", "Pros": "It's very easy to get a job here with almost no experience and if you prove yourself to be a good worker you can move up quickly, got a promotion to crew trainer after working there for only about 6 months. If you're a hard worker and can keep a good attitude there's room for advancement and it doesn't require a very high skill level to move up in the ranks.", "Cons": "the pay isn't the best, the hours fluctuate a lot from week to week, they usually refuse to give you any more then 40 hours in a week due to overtime pay."}, "2": {"Date": " Apr 22, 2016", "Summary": "\"OK for first time job\"", "Pros": "I love chicken nuggets.My team members were always fun to work with.", "Cons": "I got fat really easily."}, "3": {"Date": " Apr 23, 2016", "Summary": "\"Sourcing Contract Manager\"", "Pros": "can learn a great deal about how a business operates, great benefits.", "Cons": "To large of an organization to navigate"}, "4": {"Date": " May 6, 2016", "Summary": "\"Ok i guess\"", "Pros": "The job was cool, i guess", "Cons": "The aggressive ppl was what i hated"}, "5": {"Date": " May 7, 2016", "Summary": "\"Okay Job For Being In School or Starting Out\"", "Pros": "Meal Benefits, Meet Interesting People, Gain Work Experience", "Cons": "Terrible Communication with Management, Equipment Generally Barely Works"}, "6": {"Date": " Apr 19, 2016", "Summary": "\"My Experience at the Golden Arches\"", "Pros": "Learned how to multi-task efficiently, improved my customer service skills, able to work under pressure for extended periods of time, coworkers looked to me for help, valued company by employers, and the daily customers who appreciate you.", "Cons": "High turnover rate, low wage for the stressful environment, people falling through on their word, low morale at some points, and people losing their temper."}, "7": {"Date": " Apr 21, 2016", "Summary": "\"Crew member\"", "Pros": "I Was able to learn the pace faster thing others also was trained in all fields of this company", "Cons": "Transportation issues, could have put more effort with personal issues 'family related'"}, "8": {"Date": " Apr 21, 2016", "Summary": "\"Head Fry Cook\"", "Pros": "All the fries you can eat. At the end of the night, they just throw them away.", "Cons": "I have to say the words 'would you like to Super Size that?'"}, "9": {"Date": " May 27, 2016", "Summary": "\"No Sponge Bob attitudes here\"", "Pros": "Its good to have a job in this poor economy. It was convenient to where I am living. Cnat think of anything else good.", "Cons": "Poor pay. Management does not give you enough hr. during the week. Most people dont show up for their assigned shifts so everybody else has to pick up the slack making a simple job stressful."}}