{"0": {"Date": " Sep 9, 2016", "Summary": "\"For Kids\"", "Pros": "They offer flexibility and that is about it. The one I worked at was in an airport and it was terrible. I was 17 on the grill getting popped by grease.", "Cons": "The store was always dirty on account of it being super busy. I always fell into fry vats because I had to wade through it."}, "1": {"Date": " Aug 25, 2016", "Summary": "\"swing manager\"", "Pros": "Good environment to work in, good people to work for", "Cons": "Very fast paced work place"}, "2": {"Date": " Aug 26, 2016", "Summary": "\"Great company to work for\"", "Pros": "Friendly coworkers, great management, free meals, perks, unlimited drinks, great place to grow", "Cons": "Unfriendly customers sometimes makes job miserable but that's part of the job. Be patient and learn."}, "3": {"Date": " Sep 30, 2016", "Summary": "\"Don't\"", "Pros": "None. There are no pros. There is not a single pro to working here.", "Cons": "The pay is TRASH. The management is awful/ The interview was painful. Don't do it."}, "4": {"Date": " Sep 9, 2016", "Summary": "\"2nd Assistant Manager\"", "Pros": "Paid VacationsFull-Time Salaried PositionEmployee MealsConsistent Chances to Improve & PromotionsContinually increasing staff and workers", "Cons": "People don't care about their jobs (a lot of first timers)Management is considerably lazyConstantly Overworked (when on a salaried job, you only get paid for the 50 hours)Crazy Schedules (you may work an overnight [say 8pm-6am], where you probably won't leave till 7am and you gotta come back at 5pm for another shift)Inconsiderate to personal or family problems and personal issues"}, "5": {"Date": " Aug 25, 2016", "Summary": "\"Cashier (years ago)\"", "Pros": "Fast-paced work environment; good first job", "Cons": "Difficult work; no down-time in role"}, "6": {"Date": " Aug 25, 2016", "Summary": "\"Cashier\"", "Pros": "Easy work. Good for a first job, not for a career.", "Cons": "Low pay. Working with some people proves to be difficult"}, "7": {"Date": " Aug 25, 2016", "Summary": "\"Good job for school kids\"", "Pros": "Flexible schedule, easy job, friendly coworkers and management", "Cons": "Awful customers, high expectations, and sometimes lazy coworkers."}, "8": {"Date": " Sep 8, 2016", "Summary": "\"it's not good enough\"", "Pros": "I learned a lot of stuff", "Cons": "the payment and the hours isn't good enough"}, "9": {"Date": " Sep 8, 2016", "Summary": "\"Was an okay job, but would have liked more opportunities\"", "Pros": "there was good food, pretty flexible hours, very limited requirements to get a job, decent salary and it was the only place who hired me", "Cons": "i thought i was going to get promoted to like a manager or something but i was not allowed to apply for a better job. they didnt like my tattoo and i wouldnt wear no hair net think thats why i didnt get a promotion."}}