{"0": {"Date": " Aug 13, 2016", "Summary": "\"Worst place to ever work\"", "Pros": "Some people were super fun to work with, the fast paced environment could be fun on days. The money was good for being a high school job.", "Cons": "My gm didn't care at all about any of her employees. You can get scheduled terribly outside your availability and will be told to \"cover it\""}, "1": {"Date": " Jul 29, 2016", "Summary": "\"Crew member\"", "Pros": "One of the best starting salaries in fast food", "Cons": "Very stressful when first starting"}, "2": {"Date": " Aug 12, 2016", "Summary": "\"Ehh ok.\"", "Pros": "Fun staff to work with and flexible schedule. The general manager really works with you to complete your tasks. Also really good about time off.", "Cons": "The job is repetitive and can be very stressful most of the time. Their is room for grow but if you are not in with the owner or higher ups you will struggle to ever be promoted. Work their for 3 years and are just now being told might be selected for a promotion."}, "3": {"Date": " Aug 12, 2016", "Summary": "\"Crew Trainer/ Manager\"", "Pros": "High pay, job experience, meet new people, try new things, fast paced, free food, good location", "Cons": "Difficult customers, fast pace, Busy, slow learning crew, long shifts"}, "4": {"Date": " Aug 13, 2016", "Summary": "\"General Manager\"", "Pros": "Very good training programs in place, very strategic planning is required to be successful in this position.", "Cons": "This company claims to be a people business and preach, however this is truly not the case. I have witnessed hypocrisy many times over during the 14 years I have worked with them."}, "5": {"Date": " Jul 28, 2016", "Summary": "\"Love my job\"", "Pros": "You learn alot and take alot of training", "Cons": "I can honestly say im required to work 50 hours and some weeks I average 60 hours"}, "6": {"Date": " Aug 12, 2016", "Summary": "\"Eh\"", "Pros": "I made some cash as a kid and quickly learned this could not be a long term commitment.", "Cons": "Could've spent more time learning and building skills, however this somewhat crummy experience may have lead to me doing exactly that in the future."}, "7": {"Date": " Aug 12, 2016", "Summary": "\"shift manager\"", "Pros": "free food on break! situation really depends on the owner/ operator and the general manager.", "Cons": "I worked in the Raleigh are for 3 different franchisees. neither of them paid well but expected their shift managers to do the work of 3 people. their standards are not what customers really expect from a mcd's. not fun place to work for the meager pay and long hours."}, "8": {"Date": " Jul 28, 2016", "Summary": "\"Cashier\"", "Pros": "Fun people, Free fries, Clean restrooms", "Cons": "Customers, Standing all day, no breaks"}, "9": {"Date": " Jul 29, 2016", "Summary": "\"Crew\"", "Pros": "Really fun because most people are friendly. Some managers you have are really cool.", "Cons": "Some gossip and some managers are not very nice. Some co workers can be difficult to work with."}}