{"0": {"Date": " Oct 11, 2017", "Summary": "\"Great First job\"", "Pros": "co workers were nice and friendly", "Cons": "fast-paced place with a lot of standing up"}, "1": {"Date": " Oct 11, 2017", "Summary": "\"coke refiller\"", "Pros": "making coke for customers was awesome", "Cons": "making coke for customers sucked"}, "2": {"Date": " Oct 26, 2017", "Summary": "\"Crew Member\"", "Pros": "Working with customers, meal discounts", "Cons": "Some staff members are not polite"}, "3": {"Date": " Oct 26, 2017", "Summary": "\"Cook\"", "Pros": "Fun, good atmosphere and can get promoted easily.", "Cons": "Low pay, late hours on weekends."}, "4": {"Date": " Oct 27, 2017", "Summary": "\"Horrible training, unrealistic expectations\"", "Pros": "You can eat what you want at lunch for free.", "Cons": "Long hours, sometimes you don't get a break. The training (at my location) was horrible. I didn't know it was supposed to be for a specific position they wanted me for, and after about 8 days of \"training\" they expected me to do the whole drive thru (both lines) alone. The staff is great, the managers are very nice and patient. But the training system (again, at my location) was terrible. I don't really know the inner working of a workplace and how they decide if its running right, but they need a serious business review. It's chaos, completely, and utterly.I won't blame the managers, they help a lot, but that \"training\" system at my location is close to non existent. I am former employee after today, I actually liked the job a lot is the sad part."}, "5": {"Date": " Oct 27, 2017", "Summary": "\"crew member\"", "Pros": "If you love fast paced and like working with the public then this is the place for you.", "Cons": "To many different people training you and telling you what to do."}, "6": {"Date": " Oct 11, 2017", "Summary": "\"Cook\"", "Pros": "Great Management and decent atmosphere", "Cons": "Dull at times. Gets hot"}, "7": {"Date": " Oct 11, 2017", "Summary": "\"Team member/cashier\"", "Pros": "EmployeesEasy workSome managers are very niceThe foodThe ability to know everything in storeAnd I love cleaning thereThe customers are amazing", "Cons": "Giving me hours that's not my avalibility, and are really long. I don't mind working out my schedule but they never asked me and got mad when I asked about it.The drive thru is the job nobody likes dojng including me because they put us back there all the time it's always busy and a rush but I can keep up with it, I like it being busy actually. And some managers are rude and treat employees like they don't work for them."}, "8": {"Date": " Oct 11, 2017", "Summary": "\"It was neither good nor bad\"", "Pros": "I had an awesome team and they cooperated with my school schedule.", "Cons": "The pay and rude customers"}, "9": {"Date": " Oct 12, 2017", "Summary": "\"Cashier\"", "Pros": "Gain customer service, gain patience", "Cons": "Managers treat you like crap no matter how hard you work"}}