{"0": {"Date": " Mar 17, 2016", "Summary": "\"cashier\"", "Pros": "i got to eat free food all day long and work as much as i wanted.", "Cons": "horrible rude customers, very disorganized and the basd management."}, "1": {"Date": " Feb 10, 2016", "Summary": "\"work\"", "Pros": "fMcDonald's is open late — and sometimes even 24 hours. Waychal says this is especially key in Europe, where cafes and restaurants shut down on the weekends.", "Cons": "busyGo through the McDonalds drive-thru and do NOT order. Go up to the first drive-thru window and tell the cashier that ..."}, "2": {"Date": " Feb 10, 2016", "Summary": "\"Department Manager\"", "Pros": "Our guest and the training program and the training I received, also some of the great employees I had the opportunity to work with.", "Cons": "The Owner Operator and His CEO always changing their decision one day from another."}, "3": {"Date": " Feb 10, 2016", "Summary": "\"McDonald's Crew Member\"", "Pros": "Very easy work, does not require much thought or effortCoworkers were friendly and helpfulUsually hours are very flexible and it is easy to schedule or arrange time off with their online portal", "Cons": "MonotonousPoor payA lot of standing around and you always come home smelling of greasy burgers and sweaty from the hot grills."}, "4": {"Date": " Feb 24, 2016", "Summary": "\"Not the worst thing.\"", "Pros": "It paid money on a regular basis.", "Cons": "It's McDonald's. What else can I say?"}, "5": {"Date": " Feb 24, 2016", "Summary": "\"work\"", "Pros": "it was pretty okay", "Cons": "rude customoers and need of help"}, "6": {"Date": " Feb 24, 2016", "Summary": "\"Nice\"", "Pros": "It was pretty good. I mean you can't expect a lot but I got free food which was nice.", "Cons": "It was hot, sweaty, and smelly. The customers are very condescending to you."}, "7": {"Date": " Feb 24, 2016", "Summary": "\"Work Fast\"", "Pros": "Your day will fly by. You will always be on the go and on the run.", "Cons": "No down time at all. You must always have something to do in order to keep up and to keep everything clean."}, "8": {"Date": " Feb 9, 2016", "Summary": "\"McDonald's\"", "Pros": "i like to work and i need a little money for when i go to college so i can depend on myself.", "Cons": "i don't like working with people that's loud or disrespectful."}, "9": {"Date": " Feb 9, 2016", "Summary": "\"Crew member\"", "Pros": "Everything was very good, I learned a lot", "Cons": "No complaints. They were very good with me"}}