{"0": {"Date": " Jan 6, 2017", "Summary": "\"McDonalds\"", "Pros": "nice management, good pay and benefits", "Cons": "i mean it is mcdonalds, you know"}, "1": {"Date": " Jan 19, 2017", "Summary": "\"I am hoping to be hired as a janitorial crew member. I am 53 years of age and can work as a prep of cook.\"", "Pros": "The locations of Romulus, 48174 is convenient area and the job is within my last job notice.", "Cons": "To work with people that can not except change has a lost of quality for everyone."}, "2": {"Date": " Jan 21, 2017", "Summary": "\"Not a professional place\"", "Pros": "Mcopco has great pay and pto benefits", "Cons": "You can never take that pto without it being a problem. Management or area supervisors for socal region suck. There are so many politics with mcopco"}, "3": {"Date": " Jan 21, 2017", "Summary": "\"Good Starter Job\"", "Pros": "They give you a chance with a minimal interview process. They were polite and inviting when I started my job there.", "Cons": "It is not very clean at all. The work area is so cramped and congested that I don't even see how all of the back area could even be cleaned."}, "4": {"Date": " Jan 5, 2017", "Summary": "\"Cashier\"", "Pros": "gives you a chance to communicate with different people from different cultures and backgrounds", "Cons": "rude customers and really busy times of the day"}, "5": {"Date": " Jan 5, 2017", "Summary": "\"Shift manager\"", "Pros": "Friendly environment to work in.", "Cons": "Too many young high school kids"}, "6": {"Date": " Jan 6, 2017", "Summary": "\"Good\"", "Pros": "Nice people, great benefits and meal plan", "Cons": "Gets slammed every day, don't apply if you're not hard working or energetic"}, "7": {"Date": " Jan 6, 2017", "Summary": "\"was a manager\"", "Pros": "I was a customer service person and I love to see different people and get to know a lot of people.", "Cons": "When customers would not listen to your apology"}, "8": {"Date": " Feb 10, 2017", "Summary": "\"Kitchen Crew\"", "Pros": "It was an okay job when I worked there in Atlanta GA because of the people. My coworkers made you forget how crappy it is of a job", "Cons": "When I moved to California, I realized how bad it is."}, "9": {"Date": " Jan 20, 2017", "Summary": "\"Horros of the world\"", "Pros": "Get free food at the end of the shift, room for career growth", "Cons": "I will never eat at a fast food again"}}