{"0": {"Date": " May 15, 2017", "Summary": "\"General Manager for franchisee\"", "Pros": "Decent pay, regular customers were friendly most of the time. Had good insurance for a fast food restaurant compared to others.", "Cons": "Owners were never around much, supervisors was the laziest person I've ever seen. We were always short handed and supervisor not owner cared at all, they just always wanted to come in and complain. No matter how hard you worked or how long it was never good enough they would look for the one thing that wasn't right."}, "1": {"Date": " Apr 24, 2017", "Summary": "\"McDonalds\"", "Pros": "Can work overtime or switch shift", "Cons": "Long hours on your feet"}, "2": {"Date": " Apr 24, 2017", "Summary": "\"Cashier\"", "Pros": "Flexible hours Free lunch Lenient management", "Cons": "OvertimeNight shiftOne size fits all position"}, "3": {"Date": " Apr 9, 2017", "Summary": "\"Fun and Friendly\"", "Pros": "Get to spend time with a crew staff.", "Cons": "No flexible hours and Review are nearly every week."}, "4": {"Date": " Apr 9, 2017", "Summary": "\"Customer Service\"", "Pros": "Schedule flexibility and hours of work", "Cons": "Low Pay and shift choices of hours"}, "5": {"Date": " Apr 9, 2017", "Summary": "\"Mickey D's\"", "Pros": "free lunch, good hours, nice managers, great co-workers", "Cons": "never really got to do anything but customer service"}, "6": {"Date": " Apr 10, 2017", "Summary": "\"Nice First Job\"", "Pros": "Good Co-workersFlexibility for hours", "Cons": "You might not always get the days you want off"}, "7": {"Date": " Apr 24, 2017", "Summary": "\"Cashier\"", "Pros": "Very easy to learn the ins-and-outs of the business.", "Cons": "Unflexible hours, benefits could be better too."}, "8": {"Date": " Apr 24, 2017", "Summary": "\"Good job for beginner\"", "Pros": "Flexible HoursGood first time jobEasy to pick upFree uniformScholarships", "Cons": "UnderstaffedRidiculous management policiesLittle to no advancement opportunities"}, "9": {"Date": " Apr 24, 2017", "Summary": "\"Cashier/ Cook\"", "Pros": "The company overall is very organized. It made it easy to get the hours that I need and request the hours off when I needed them. They were pretty consistent.", "Cons": "The work can be sometimes physically and mentally draining."}}