{"0": {"Date": " Mar 5, 2016", "Summary": "\"Crew\"", "Pros": "Steady hours great money nice friends", "Cons": "Negative attitudes, greasy foods, favoritism"}, "1": {"Date": " Feb 19, 2016", "Summary": "\"Run a multi million dollar store\"", "Pros": "Work is like a home away from home.", "Cons": "Stereotype. That some people view McDonalds workers"}, "2": {"Date": " Mar 26, 2016", "Summary": "\"lies\"", "Pros": "good to waste timeIt a good work to start with Onlyfairly easily jobfree cheeseburger/small fry/ small coke(depends on stores food cost)", "Cons": "no 50% discount on meal only free meal if you have worked 5 hrs or more (depends on your stores food cost).No extra pay working at night. not even holidaysdoing task that are dangerous for crews.very repetitive jobget paid the least you can get on your state"}, "3": {"Date": " Mar 5, 2016", "Summary": "\"General Staff\"", "Pros": "McDonald's required no experience prior to being hired, this was a plus for me as I was still a Senior in high school at the time.", "Cons": "McDonald's pays you minimum wage. When I was new they would give me the worst hours (6-8 AM on Saturday and Sunday mornings). I was also given a shockingly low amount of training."}, "4": {"Date": " Mar 6, 2016", "Summary": "\"mcd's\"", "Pros": "nothing at all is useful", "Cons": "Tons of bad things that happen here"}, "5": {"Date": " Feb 19, 2016", "Summary": "\"Just okay\"", "Pros": "You get to have a free meal during your break. Their French fries are pretty good. Management can be cool sometimes. Hours you work can be flexible.", "Cons": "While the pay is a little low, it can still be fun to work there. It can get stressful when understaffed during peak shifts and customers start complaining about their orders taking too long."}, "6": {"Date": " Mar 4, 2016", "Summary": "\"cook\"", "Pros": "There is no pros for working at this McDonald's", "Cons": "It would take more than20"}, "7": {"Date": " Mar 4, 2016", "Summary": "\"eh\"", "Pros": "It's not hard to be hired", "Cons": "It's stressful and all of the customers are rude"}, "8": {"Date": " Mar 4, 2016", "Summary": "\"Part Time Crew\"", "Pros": "Great Working Place & Flexible hours", "Cons": "Pay is low. No future working there."}, "9": {"Date": " Feb 29, 2016", "Summary": "\"Corporate (current soon to be former) employee\"", "Pros": "I got a lot of opportunities to move around, and have been fortunate to work with really great people. Good benefits. Free soda and coffee (for now)", "Cons": "Leadership is insulting to current employees, sometimes jobs are not posted, recognition is few and far between and very much about being selected by leadership (being a chosen one) rather than merit. It takes the meaning out of it, and in cases where they are trying to boost morale it has the exact opposite effect. I don't trust any of them.Cash compensation is not competitive at all. At some point, the company is going to finally realize it. It was especially bad the year there was no bonus paid. Even with bonus, the pay is below the market BASE pay.They are still laying people off, so be very careful if you go to McD's. They are only just getting started.This is from a young employee. I might be safe today, but ten years from now I could be on the chopping block like many others when things go sour. Loyalty to the company is not rewarded."}}