{"0": {"Date": " Jun 21, 2016", "Summary": "\"Friendly\"", "Pros": "The work crew all work together", "Cons": "The pay could be a little more"}, "1": {"Date": " Jun 21, 2016", "Summary": "\"an alright job\"", "Pros": "You meet some great life-long friends, easy work, and easy to learn. If just starting out its a great stepping stone job that you learn customer service and multi-tasking skills.", "Cons": "unstaffed work environments that are extremely stressful and could be solved with hiring more people; you smell bad after working and always feel gross"}, "2": {"Date": " Jun 21, 2016", "Summary": "\"Intern\"", "Pros": "Pretty decent internship, not too many overarching positive things. I would reevaluate the job description pretty critically before choosing to apply", "Cons": "Not a great working environment. The work assigned was pretty subpar and the internship program wasn't well established. I did, however, get paid for the work at least."}, "3": {"Date": " Jun 6, 2016", "Summary": "\"Great job for college students looking for flexibility!\"", "Pros": "Flexible hours to fit class schedules. Opportunity to practice customer service skills.", "Cons": "Taking orders in the drive-thru may be stressful on busy days if you are uncomfortable with multitasking."}, "4": {"Date": " Jun 7, 2016", "Summary": "\"What you expect\"", "Pros": "Easy jobGood managementGreat hours", "Cons": "Can get very busy and hectic"}, "5": {"Date": " Jul 12, 2016", "Summary": "\"Bad\"", "Pros": "Was close to place of residence. McDonalds address: 10350 Reseda BlvdNorthridge, CA 91326", "Cons": "Horrible to work there. Rude employee's. Worked there for a little while and only got a raise of $00.08. Manager promotes people who don't know how to speak English into managers. I was not promoted."}, "6": {"Date": " Jun 21, 2016", "Summary": "\"Not the greatest place to work, but it's a job\"", "Pros": "You get to know your coworkers well and the managers too. Get a discount on food, but only at your store.", "Cons": "almost constantly understaffed so that there were often long lines of people waiting for their order.pay is low compared to the national minimum wage. however the state minimum wage (MI) is lower than the national one"}, "7": {"Date": " Jun 21, 2016", "Summary": "\"It's a mehhh experience\"", "Pros": "You make money, and get to eat food for free once a day.", "Cons": "Literally nothing else about this place is really that nice. You have to do useless stuff all the time just to fulfill the many"}, "8": {"Date": " Jun 21, 2016", "Summary": "\"Part-time Job\"", "Pros": "non-stressful, easy job, easy to schedule work around my availabity", "Cons": "smelled like food after I left"}, "9": {"Date": " Jun 22, 2016", "Summary": "\"stepping stone\"", "Pros": "first job, so gained experience on being out there in the workforce", "Cons": "low paying job, mismanagement, lack of employees"}}