{"0": {"Date": " Dec 30, 2015", "Summary": "\"Not great place to work for adults\"", "Pros": "pay is good when you get into management", "Cons": "constant changes to the business model. as soon as you get crew trained they leave. very high turnover rate."}, "1": {"Date": " Dec 15, 2015", "Summary": "\"Crew Trainer\"", "Pros": "People there are nice, get to work with a variety of people. Flexible hours, and easy to excel and train in different areas", "Cons": "Drama with high schoolers, as a closer I should be getting paid more, but I do not, a lot of angry customers since all day breakfast started"}, "2": {"Date": " Dec 29, 2015", "Summary": "\"Crew member\"", "Pros": "its a fast paced learning environment", "Cons": "Working environment not so friendly"}, "3": {"Date": " Dec 30, 2015", "Summary": "\"My look back at McDonald's\"", "Pros": "Friendly staff team workers fun", "Cons": "Customers not nice at all very rude"}, "4": {"Date": " Dec 30, 2015", "Summary": "\"general mgr\"", "Pros": "flexible scheduling of my schedule", "Cons": "being available 24/7 at a drop"}, "5": {"Date": " Dec 30, 2015", "Summary": "\"mcdonalds\"", "Pros": "the co-workers makes the good fun", "Cons": "the amount of work you have to do but don't get paid enough"}, "6": {"Date": " Dec 30, 2015", "Summary": "\"Average\"", "Pros": "Mostly work alongside peers. (If you're still in high school/college) Decent entry level 1st job for students.", "Cons": "Very hectic. Not a lot of free time. Not the kind of job where you can take breaks every half hour or so like some other entry level jobs."}, "7": {"Date": " Dec 15, 2015", "Summary": "\"Idk\"", "Pros": "Money, Flexible, Fun, Clean, Nice", "Cons": "Discount, costumers, break, Nothing, Else"}, "8": {"Date": " Dec 15, 2015", "Summary": "\"Cook\"", "Pros": "Pay is great. Plenty of hours.", "Cons": "People come in all the time."}, "9": {"Date": " Jan 19, 2016", "Summary": "\"It gave me a new appreciation for fast food workers\"", "Pros": "It was a fun experience meeting new people and learning a new job", "Cons": "The management needs an attitude adjustment. I was only there 1 week, worked 6 days in a row and did everything they asked me to do and beyond, but was treated like an outcast, yelled at for trying to get a man fries he ordered with his meal that didn't show up on the monitor and instead of talking to me quietly, I was yelled at in front of other employees and customers. When I tried to ask another manager for help, she didn't even try to pretend she was listening and customer yelled at her as well, situation was finally resolved when yet a 3rd manager stepped in and told me to just get the man his fries, but the 3rd manager was the most helpful"}}