{"0": {"Date": " Sep 24, 2017", "Summary": "\"It's a job\"", "Pros": "It is a job where you get to meet interesting people.", "Cons": "If you are over 18 as a crew member you often get everything including a lot of the managers work placed on you while the kids stand around talking and playing on their phones."}, "1": {"Date": " Sep 8, 2017", "Summary": "\"mcdonolds\"", "Pros": "you get free meals and discounts", "Cons": "pay is okay and a lot of work"}, "2": {"Date": " Sep 8, 2017", "Summary": "\"Cashier\"", "Pros": "The coworkers all hard workers", "Cons": "The salary is way too low"}, "3": {"Date": " Sep 8, 2017", "Summary": "\"Accountant\"", "Pros": "Proficient in the individual preparation of tax returns and MS Office and possess intermediate to expert skills in MS Excel.", "Cons": "I've never worked for McDonald's in a corporate capacity"}, "4": {"Date": " Sep 8, 2017", "Summary": "\"crew member\"", "Pros": "decent pay. good mangers and employees to work with.", "Cons": "gets really busy at times and hectic."}, "5": {"Date": " Sep 9, 2017", "Summary": "\"Great job\"", "Pros": "Had some really kind managers, offered me a McDonalds resource hotline when I lost my place to stay and were really flexible about my schedule. Job itself wasn't too bad either, free meals on breaks. This job was the reason why I survived. Thank you.", "Cons": "Other than typical fast food job stuff like cleaning fries off the floor, which I didn't even have to do that often, there wasn't much I can complain about."}, "6": {"Date": " Oct 14, 2017", "Summary": "\"Management\"", "Pros": "The schedule was very flexible", "Cons": "the management was all over the place and everyone had a power trip"}, "7": {"Date": " Sep 23, 2017", "Summary": "\"ii\"", "Pros": "active environment, easy opportunity, and flexible schedule", "Cons": "not a comfortable place to be all the time."}, "8": {"Date": " Sep 8, 2017", "Summary": "\"Great high school employment\"", "Pros": "Great place to start employment", "Cons": "Not meant to be a career"}, "9": {"Date": " Sep 8, 2017", "Summary": "\"Love the job not the people\"", "Pros": "This is truly a great place to work. The job can be tiring especially if you work at one that is really busy like I do. You learn various skills like multi-tasking and customer service.", "Cons": "The management doesn't know how to treat people as well as they should."}}