{"0": {"Date": " Mar 10, 2018", "Summary": "\"It was a good time but the McDonald’s life is not for me\"", "Pros": "- Good For Experience-Helps People Skills-Helps with Problem Solving-Makes You Better at Handling Money-Free Food Every Break- Nice Co-Workers", "Cons": "- Having to Be Fast-Multitasking-Rude Customers-Working 15 hour shifts-Super Busy Days-Super Slow Days-Impatient Customers"}, "1": {"Date": " Mar 24, 2018", "Summary": "\"Cashier\"", "Pros": "flexible hours and easy interview process", "Cons": "customers are terrible, sometimes my manager didn't let me use my whole break time because the store was too busy"}, "2": {"Date": " Mar 10, 2018", "Summary": "\"Good place to work\"", "Pros": "Flexible hours it worked well for a high school student. Was able to have a social life and work while going to school", "Cons": "Very busy on some days. It could be stressful to keep up with the customers. I gained weight because all the good food"}, "3": {"Date": " Mar 24, 2018", "Summary": "\"Stressful work environment, always short staff\"", "Pros": "Working with good co productive workers", "Cons": "A poor management team that demonstrated favoritism towards certain employees"}, "4": {"Date": " Mar 10, 2018", "Summary": "\"Super\"", "Pros": "Flex hours, good benefits", "Cons": "Never ending issues, support from upper mgt"}, "5": {"Date": " Mar 23, 2018", "Summary": "\"Very Opportunistic Entry Level Job\"", "Pros": "Flexability in schedule, education advancement", "Cons": "Irregular employees poor management training"}, "6": {"Date": " Mar 23, 2018", "Summary": "\"counter\"", "Pros": "Hours were flexible and co workers were fun. It was close and easy to get to.", "Cons": "grease was everywhere and tended to be a layer on skin. Needed a bath after work."}, "7": {"Date": " Mar 23, 2018", "Summary": "\"Good for a teen\"", "Pros": "Bi-weekly pay... possible long term friendship, possibility of getting a raise every 6 months, and possibility of getting a promotion .", "Cons": "Horrible hours, no benefits because you don’t work over 40 hours a week, Over worked, horrible customers, horrible cleaning habits"}, "8": {"Date": " Mar 23, 2018", "Summary": "\"OK\"", "Pros": "Most of the repeat customers are super nice and friendlyEasy to switch shifts with coworkers (almost all of them are easy to get along with too)", "Cons": "Poor management – they made me leave early/cut my hours once I put in my 2 weeks noticeSome customers can be irritating afHigh turnover rate – keep hiring new people and cutting hoursHard to get a day off"}, "9": {"Date": " Mar 9, 2018", "Summary": "\"Crew\"", "Pros": "Fair pay. Excellent first job", "Cons": "Lack of training creates confusion"}}