{"0": {"Date": " Dec 25, 2015", "Summary": "\"Mcd's\"", "Pros": "A lot of resources at disposal. Flexible work schedules and pay is pretty good.", "Cons": "Sometimes work is repetitive and boss is a micro-manager. Very insistent on getting petty stuff done on time."}, "1": {"Date": " Dec 21, 2015", "Summary": "\"Cashier\"", "Pros": "I love working here. Nice people and staff. Great pay and hours.", "Cons": "Theresno cons. Everything was absolutely perfect. Gtrst people"}, "2": {"Date": " Jan 8, 2016", "Summary": "\"Crew Member\"", "Pros": "Crew Members are able to recieve flexible hours", "Cons": "The work environment is unorganized."}, "3": {"Date": " Jan 8, 2016", "Summary": "\"It was cool\"", "Pros": "-Free food-Flexible hours-Easy, not too much of a learning curve", "Cons": "-Lousy customers-Long hours-Mandane-Not much chance for growth"}, "4": {"Date": " Jan 9, 2016", "Summary": "\"Cashier\"", "Pros": "Stepping stone to get work experience", "Cons": "Management needs to be more proactive it seems a little frustratating when employees are absent from work when rush hour hits and the food at mcdonalds has gone downhill."}, "5": {"Date": " Jan 9, 2016", "Summary": "\"Fine\"", "Pros": "Good for teaching how to manage and how to interact with other workers! Management does not hire out side they hire from within which is really good.", "Cons": "It's an easy job so you don't get that much credit on your resume. People think you are lower than them for working at McDonald's"}, "6": {"Date": " Jan 9, 2016", "Summary": "\"burger flipper\"", "Pros": "free food is deliciously tasty", "Cons": "unhealthy food is terminally greaasy"}, "7": {"Date": " Dec 21, 2015", "Summary": "\"Burgers Burgers Burgers\"", "Pros": "Free burgers, Free use of bathroom, they didn't charge me for toilet paper", "Cons": "Had to pay for French Fries!!!"}, "8": {"Date": " Jan 7, 2016", "Summary": "\"alright in the first year then went downhill\"", "Pros": "Flexible hours, good people to work with, fast paced, easy to learn stations", "Cons": "Very high turnover rate because of bad management, rude customers, expected to carry a workload of four people, gave little hours when pay raise came in, was cut back in hours after calling in once for a family emergency"}, "9": {"Date": " Jan 7, 2016", "Summary": "\"went abroad for higher studies\"", "Pros": "work anything i am student in information technology very friendly", "Cons": "do not have work permit but willing to work as cash"}}