{"0": {"Date": " Mar 7, 2016", "Summary": "\"Great Place\"", "Pros": "Mcdonalds is very flexible with scheduling and notices hard work. If you work hard and do yur job correctly you will get promoted. The pay is a dollar above minimum wage as well.", "Cons": "you have to be on your feet for 8 hours and some times customers are rude. I Work for a MCOPCO store not a franchise, franchises are worse."}, "1": {"Date": " Mar 21, 2016", "Summary": "\"Bad experience\"", "Pros": "None good to say about it to be honest.", "Cons": "Everything was pretty crappy to me."}, "2": {"Date": " Mar 6, 2016", "Summary": "\"McDonalds\"", "Pros": "It's a job, and it's pretty alright for a student to earn some side money. But that's already it.", "Cons": "Since they paid me just minimum wage I couldn't earn a lot of money but everybody should decide for themselves."}, "3": {"Date": " Mar 6, 2016", "Summary": "\"Regional Marketing Manager\"", "Pros": "Great opportunities to grow not only in your discipline, but thanks to all of the quarterly meetings, you get to grow your network!", "Cons": "Very political and very demanding and stressful. Some regions are great and very people focused and others are very hierarchical"}, "4": {"Date": " Mar 7, 2016", "Summary": "\"linework cook\"", "Pros": "I have work with McDonalds years ago in the Boston area Do to illness I was no long able to work However I love working with people a team player and do not mind a hard days work", "Cons": "not having a crew who is not willing to work together to get the job done keeping the custom coming back I think should be the goal and treat everyone with respect we all have bad days but you can not bring that to work"}, "5": {"Date": " Mar 21, 2016", "Summary": "\"best fit for high schooler\"", "Pros": "easy to get into, environment can be fun too", "Cons": "sometimes non exsistent structure, so its hard to transfer locations using the same practices that you learned at your previous location"}, "6": {"Date": " Apr 10, 2016", "Summary": "\"Tiring\"", "Pros": "Coworkers are friendly and that is it", "Cons": "Management sucks, time consuming, no benefits"}, "7": {"Date": " Mar 20, 2016", "Summary": "\"employment\"", "Pros": "Good hours and great training in every position", "Cons": "rude managers and lazy staff"}, "8": {"Date": " Mar 21, 2016", "Summary": "\"Food server\"", "Pros": "Easy working environment. Friendly staff", "Cons": "Can be very stressfull when dealing with customers"}, "9": {"Date": " Mar 21, 2016", "Summary": "\"A Basic Job\"", "Pros": "It is a simple job, but the individual restaurants have 0 actual great leaders or people to train new members.", "Cons": "It does not pay well, people are rude and most of them do not even want to work."}}