{"0": {"Date": " Mar 31, 2017", "Summary": "\"Excellent Managment\"", "Pros": "Salary, Managment, employers, money", "Cons": "Customers,work, conditions, dogs, and fries"}, "1": {"Date": " Apr 15, 2017", "Summary": "\"Cook\"", "Pros": "Somewhat Decent PaySome decent staff", "Cons": "Bad ManagementNo one knows what to do"}, "2": {"Date": " Apr 15, 2017", "Summary": "\"Overworked and under appreciated\"", "Pros": "Salary and insurance that's about it. Well bonuses aren't bad either but you have to jump through serious hoops that keep getting smaller.", "Cons": "Staff, Hours, Equipment, corporate overreach. The managers and staff that are available at the pay rates we offer are useless and don't care whether they get fired or not because they can find another job tomorrow making the same money."}, "3": {"Date": " Mar 31, 2017", "Summary": "\"mcdonalds is a fun job\"", "Pros": "food is good and so is mcflurry", "Cons": "i dont like to wear my hat"}, "4": {"Date": " Apr 1, 2017", "Summary": "\"McDonalds\"", "Pros": "flexible hours, Student friendly, easy to do", "Cons": "dont really have anything bad to say, can get a little messy and the costumers can be mean"}, "5": {"Date": " Mar 30, 2017", "Summary": "\"Great Job and amazing perks\"", "Pros": "Ahhhh free hamburgers anyone?!! Enough said!", "Cons": "Long shifts can make your feet a bit sore, but comfy shoes help"}, "6": {"Date": " Mar 31, 2017", "Summary": "\"Good\"", "Pros": "Would work with school schedule", "Cons": "Not really the best when it comes to paying"}, "7": {"Date": " May 5, 2017", "Summary": "\"Its ok\"", "Pros": "work near school flexible hours", "Cons": "not the best pay could be better"}, "8": {"Date": " May 6, 2017", "Summary": "\"Not a good experience\"", "Pros": "They always need help which means hours were available", "Cons": "Lots of gossip and drama. I have worked at several locations and there was a male manager that was later a district supervisor that would make sexual comments to under age girls. I never reported it bc i was told by another manager that they were threatened by an owner for making these same accusations"}, "9": {"Date": " Apr 14, 2017", "Summary": "\"Crew member\"", "Pros": "Great staff and fun environment.", "Cons": "Overworked and could be very stressful at times when busy and there's not enough help"}}