{"0": {"Date": " Nov 13, 2016", "Summary": "\"hourly\"", "Pros": "good people, always busy o time flys", "Cons": "long hours, minimal advancement in shot term"}, "1": {"Date": " Nov 13, 2016", "Summary": "\"cashier\"", "Pros": "Food is made good at times and some employees are polite", "Cons": "Working attitude needs improvement alone with work flow accuracy."}, "2": {"Date": " Oct 29, 2016", "Summary": "\"working here\"", "Pros": "It's ok working here it a little fun.", "Cons": "customers can be mean.burned myself A lot."}, "3": {"Date": " Oct 30, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Great customers service for me the customer is always right I just want the customer to come in purchase what he has to buy and make sure he walks out the store satisfied", "Cons": "Minim is to low I am a service person which also knows how to do cooks service and everything else and still get payed for a regular employee"}, "4": {"Date": " Nov 13, 2016", "Summary": "\"Hard work, and needed in many other areas except assigned\"", "Pros": "The workers are friendly, for the most part and benefits are worth it.", "Cons": "Its not that safe of a environment to be around, so make sure you are careful especially if you are cooking."}, "5": {"Date": " Oct 29, 2016", "Summary": "\"Starter job\"", "Pros": "It's a good place to start working. Will provide supervisory experience if you stay at it.", "Cons": "It's McDonalds so I don't think I need to really elaborate on potential cons. It's a good beginner job or for someone looking to make some extra cash."}, "6": {"Date": " Dec 3, 2016", "Summary": "\"Shift manager\"", "Pros": "Love my crew. I work with some great people n I love my customers", "Cons": "Terrible management in store and upper"}, "7": {"Date": " Nov 12, 2016", "Summary": "\"Cashier\"", "Pros": "Flex hours. Management is cool. Pay is not so great. If it's good for a part time job if you just need extra cash.", "Cons": "Costumers suck. They talk to you like you're trash and worthless. Also on 2nd shift hire more ppl so everyone won't be working like a slave"}, "8": {"Date": " Nov 12, 2016", "Summary": "\"Don't do it\"", "Pros": "- Great people to work with- Extremely flexible hours- Easy advancement for position and pay- Multiple training opportunities for leadership and service", "Cons": "- Often under appreciated as an individual- Often over tasked and under staff- Disgusting work environment- Unmotivated coworkers (majority)- Horrible Pay (not worth it)"}, "9": {"Date": " Oct 28, 2016", "Summary": "\"Needs work, but isn't the worst workplace.\"", "Pros": "Great job for the pay (for a young adult in school). Benefits are also good.", "Cons": "Management would typically panic when a rush would hit, so they took that stress out on the crew."}}