{"0": {"Date": " Mar 30, 2016", "Summary": "\"Cahsier/dishwasher\"", "Pros": "im a people person so the customers", "Cons": "the schedule was absolutely unstable and unorganized, the workers were not professional, the manager did not know how to deal with the customers and slacked off way too much."}, "1": {"Date": " Mar 30, 2016", "Summary": "\"Not bad\"", "Pros": "Finding food is easy, coworkers were pretty good, overall a pretty good place to work", "Cons": "Definitely get a little sick of the food after a while, classic food service customer issues"}, "2": {"Date": " May 5, 2016", "Summary": "\"former empolyment\"", "Pros": "I liked working there all the costomers that seem me I always loved puyying a smile on there face.", "Cons": "they played a lot of favorite tisem to people there."}, "3": {"Date": " May 5, 2016", "Summary": "\"Ridiculous.\"", "Pros": "There were no positives apart from having a job.", "Cons": "Poor ethics, subpar sanitation, indecent pay, exploitation, sociopathic authorities, no discounts/benefits, paranoid delusional accusations, irresponsibility, neurotic avarice, dismal management."}, "4": {"Date": " Apr 14, 2016", "Summary": "\"Bad\"", "Pros": "You get work experience and learn a lot . You learn to work with money and customers and just helps to our experience on resume .", "Cons": "The managers and just the whole job sucks in general. I did not like the job at all. I was there for two years ."}, "5": {"Date": " Apr 14, 2016", "Summary": "\"Cook\"", "Pros": "If you work hard management will work with you on a schedule based on your needs outside of work. They are flexible because they need you and they want to to keep you especially if you have a good work ethic.", "Cons": "Not enough pay for all the hard work you do, but then again you are flipping burgers."}, "6": {"Date": " Mar 30, 2016", "Summary": "\"Fun job\"", "Pros": "The job had a great atmosphere bundled with great people. This would result in friendly relationships with every employee. Overall a good place to start if one is looking for a job.", "Cons": "During times of stress, certain employees would give attitude to one another. Another con would be the customers. Sometimes customers would give you attitude even though you are treating them with respect."}, "7": {"Date": " Mar 30, 2016", "Summary": "\"My experience\"", "Pros": "Great benefits, meet new ppl", "Cons": "Sometimes management don't care about if you have personal issues"}, "8": {"Date": " Mar 30, 2016", "Summary": "\"cashier /customer service\"", "Pros": "pros where the service ate McDonalds. We got a lot of ratings good and bad which only set the scale even higher to prove the staff could mange a workday smoothly.", "Cons": "cons are kind of personal. wasn't really happy with some crew members decisions. A lot of short staff issues constantly ,also calling off/out protocol was never a huge issue with the managers."}, "9": {"Date": " Apr 13, 2016", "Summary": "\"McD's review\"", "Pros": "Corporate culture was excellent and they really took care of their employees. Excellent perks and benefits.Generous personal and vacation policy.", "Cons": "Amazing that the company was able to grow to its present size as McDonald's seemed to be completely inflexible in terms of making any change to policies, even if these policies would have resulted in positive company growth. Like trying to turn a battleship around in a cul de sac."}}