{"0": {"Date": " Apr 20, 2016", "Summary": "\"I'm lovin it\"", "Pros": "McDonald's was a great place to work", "Cons": "Customer service is not fun"}, "1": {"Date": " Apr 20, 2016", "Summary": "\"Crew Member\"", "Pros": "flexible hours, discount on food, easy work", "Cons": "rude customers, constant cleaning, rushed work during peak hours"}, "2": {"Date": " May 4, 2016", "Summary": "\"Crew\"", "Pros": "Some great people to meet and work with. Made a lot of friends working here and would do it all over again.", "Cons": "Some bad people to meet and work with. Customers can be really rude, especially to new hires. Very fast past and chaotic at first."}, "3": {"Date": " May 4, 2016", "Summary": "\"awful\"", "Pros": "I hated working there, everyone is so mean and disrespectful. they treat you like nothing", "Cons": "everything there was a con"}, "4": {"Date": " May 4, 2016", "Summary": "\"MCD review\"", "Pros": "Everyone loves McDonald's restaurants and employees!", "Cons": "The pay could be better."}, "5": {"Date": " May 5, 2016", "Summary": "\"Management\"", "Pros": "Training is available for anyone who wants to move up at McDonalds I found that was a plus especially if you have no experience they give you the opportunity to grow with the company as long as you are willing to work hard for it.", "Cons": "As management you have to work many hours and that are past your scheduled time, this is great for someone with no kids. If you have to be some where at a certain time after your shift don't plan on it because you can not leave until your relieved."}, "6": {"Date": " Apr 19, 2016", "Summary": "\"West Chester, Ohio McDonalds (Tylersville)\"", "Pros": "I've heard a lot of horrible things about working at McDonalds. However, for a fast food job, it wasn't bad at all. If you're a hard worker and do what you're supposed to, the training is easy and you won't get yelled at. They were also flexible if I needed to schedule days off for travelling.", "Cons": "The pay, obviously. I worked night shift too. You get to see how the food is made (Honestly not that bad. I still eat there after having witnessed and performed their food preparation techniques.)"}, "7": {"Date": " May 25, 2016", "Summary": "\"Cashier\"", "Pros": "Had free break meals which saved money", "Cons": "Lack of hours, unsafe working enviroment"}, "8": {"Date": " May 25, 2016", "Summary": "\"What do you expect\"", "Pros": "Easy, they praised me for sweeping the floor once?", "Cons": "Gross, the entire back of the place smelled like rancid BO"}, "9": {"Date": " May 25, 2016", "Summary": "\"Don't\"", "Pros": "There are very few good reasons to work at this place. The best reason is that for the type of work they are one of the best for wages.", "Cons": "This place is poorly ran. Management don't know their butt from a hole in the ground. Everyone here works against each other instead of as a team"}}