{"0": {"Date": " Dec 31, 2016", "Summary": "\"the same\"", "Pros": "fun cfreative customer interaction loved the enviroment", "Cons": "slow work some times no hours"}, "1": {"Date": " Jan 14, 2017", "Summary": "\"Positive review\"", "Pros": "Weekly 2 days off and employees meal", "Cons": "No incentive program and promotion is slow"}, "2": {"Date": " Jan 14, 2017", "Summary": "\"Crew Member\"", "Pros": "Free meal, 30 minute break, usually you can advance.", "Cons": "It's only good if you have good managers that make sure they train new employees properly."}, "3": {"Date": " Dec 30, 2016", "Summary": "\"Cook\"", "Pros": "Team environment in a fast moving workplace", "Cons": "Pay is not that great"}, "4": {"Date": " Feb 4, 2017", "Summary": "\"McDonald's\"", "Pros": "Food and you have to be on top your game.", "Cons": "None just be very quick with things"}, "5": {"Date": " Jan 13, 2017", "Summary": "\"It's ok some managers are pretty cool then there's other managers that really shouldn't be working there.\"", "Pros": "They are very flexible with your schedule also when you go on break you'll get a free meal.", "Cons": "They are some manager that can treat you like crap. Also you might not get out at the time that you're suppose too."}, "6": {"Date": " Jan 13, 2017", "Summary": "\"You wont last.\"", "Pros": "nice co wrokers and hours", "Cons": "suckish customers and careless managers"}, "7": {"Date": " Jan 13, 2017", "Summary": "\"The people are good\"", "Pros": "Got paid for management training classes, free meals for working, other managers were great, always encouraged others to learn", "Cons": "The mixed shifts Ike working opens, close and days every week, feel like the pay was below starting wage of other places."}, "8": {"Date": " Jan 13, 2017", "Summary": "\"Good first job\"", "Pros": "It's good for a first job as you learn to work effectively and fast.", "Cons": "It's only good short term in all reality."}, "9": {"Date": " Jan 14, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Great food, great shakes I love chicken nuggets", "Cons": "I gained a lot of weight"}}