{"0": {"Date": " Nov 27, 2017", "Summary": "\"Crew member\"", "Pros": "Good workplace, good people, some of the managers were good.", "Cons": "As you get good at your job, you start to realize how much everyone else sucks at theirs."}, "1": {"Date": " Nov 11, 2017", "Summary": "\"Drive-thru team member\"", "Pros": "Organized, fast-paced, friendly co-workers, clean facility, good starting pay.", "Cons": "Disrespectful drive-thru customers, high turn over rate, stressful peak traffic times."}, "2": {"Date": " Dec 18, 2017", "Summary": "\"Cashier\"", "Pros": "Free meals that’s really all", "Cons": "They don’t care much for you but that’s every fast food Job"}, "3": {"Date": " Nov 11, 2017", "Summary": "\"McDonald’s\"", "Pros": "Customer service satisfaction, keeping the Brand Name at the top of its game. Training employees and managers", "Cons": "People calling off when they are supposed to be at work"}, "4": {"Date": " Nov 11, 2017", "Summary": "\"First Job\"", "Pros": "Was easily kept busy and got my breaks", "Cons": "No benefits part time and they weren't hiring much full time"}, "5": {"Date": " Nov 25, 2017", "Summary": "\"Crew Trainer\"", "Pros": "Easy Work, Nice people, keep busy, slow summers", "Cons": "Low Pay, Favoritism, Store Manager does not treat member right"}, "6": {"Date": " Nov 10, 2017", "Summary": "\"Cook\"", "Pros": "Great place to start-people who go into management can make decent moneyNote:worked there before 2013 but glassdoor only gave option to 2013", "Cons": "early morning hours if you have breakfast duty"}, "7": {"Date": " Nov 25, 2017", "Summary": "\"Mcdonalds is for high school\"", "Pros": "Easy money Food Uhh more food Customers Discounts", "Cons": "Minimum wage Annoying Unhealthy food Greasy Gross"}, "8": {"Date": " Nov 26, 2017", "Summary": "\"Not good\"", "Pros": "Good service good food still bad", "Cons": "No good management okay to much shows favorite to certain people"}, "9": {"Date": " Nov 24, 2017", "Summary": "\"Unbalanced work shoved on an over night employee\"", "Pros": "Learn to clean a flat top grill for 3 different managers individual liking that produced cold spots everywhere and only caused that much more fusturation in a non english speaking kitchen", "Cons": "Doing everything with people who cant speak english"}}