{"0": {"Date": " Jul 13, 2016", "Summary": "\"good\"", "Pros": "you can move up fast", "Cons": "only being part time.work with you"}, "1": {"Date": " Aug 17, 2016", "Summary": "\"Blah Job\"", "Pros": "Always hiring, easy to get employment, free meals", "Cons": "They start with low pay even if you have work experience, workers don't really interact with one another, management included. Is very boring and depressing"}, "2": {"Date": " Aug 18, 2016", "Summary": "\"Pocket change\"", "Pros": "Not sure there really is a pro to this job", "Cons": "management was immature, employee lunches were taken away due to heavy theft, petty arguments amongst the staff almost daily."}, "3": {"Date": " Jul 27, 2016", "Summary": "\"Privately Owned McDonald's\"", "Pros": "friendly coworkers - I got along with the majority of my coworkers; shift managers were greatcustomer service experience - I experienced the best and worst of experiences managing clients", "Cons": "horrible management - Owner was super cheap; there was never enough supplies brought in and machines always broke down. Supervising manager was difficult to communicate."}, "4": {"Date": " Jul 27, 2016", "Summary": "\"cook\"", "Pros": "hours pay free food easy good summer job not for adults", "Cons": "no benefits customers suck your just a number dead end job"}, "5": {"Date": " Jul 27, 2016", "Summary": "\"Mcdonalds\"", "Pros": "flexible with your school schedule", "Cons": "poor management and the building was dirty"}, "6": {"Date": " Jul 27, 2016", "Summary": "\"Not bad for part time\"", "Pros": "They pay you some money, at least enough to get by if you're still in high school", "Cons": "Bad working environment filled with sadness and bad vibes. Also, customer is always right, even when they're wrong"}, "7": {"Date": " Jul 12, 2016", "Summary": "\"Good for people looking for a first job.\"", "Pros": "50% discount on foodEasy jobPays a fairly good amountCan get up to a 45 min break", "Cons": "A little bit challenging during the lunch rush.Get $4.00 off if food items cost $10.00"}, "8": {"Date": " Jul 26, 2016", "Summary": "\"Staff\"", "Pros": "Love the fries and ice cream", "Cons": "Hate the hours and bathrooms"}, "9": {"Date": " Jul 26, 2016", "Summary": "\"OK\"", "Pros": "Good first job. Easy to learn. Provides with good first job experience- introducing young people to a work environment. Builds basic skills- customer service skills, money handling, reporting to managers, etc.", "Cons": "There is room for growth initially, but obviously that growth is limited. In this environment, it also tends to be very petty and immature. I.e. you may be passed for promotions because of work drama and personal preferences."}}