{"0": {"Date": " Jul 10, 2016", "Summary": "\"McDs\"", "Pros": "Variety of people, fast paced, learn customer service skills, learn to work as a team", "Cons": "Working with grease, dealing with the general public, hot in the summer"}, "1": {"Date": " Jul 10, 2016", "Summary": "\"Crew Member\"", "Pros": "Waiting on fantastic people, working with a lot of motivated people", "Cons": "Working with high school kids on their first job"}, "2": {"Date": " Jul 10, 2016", "Summary": "\"Little bit of everything\"", "Pros": "If you put your name on the want to work list you'll most likely get called in", "Cons": "It's McDonald's it's not going to be great"}, "3": {"Date": " Jul 11, 2016", "Summary": "\"Don't work there\"", "Pros": "meeting new peopleemployess usually are fun and easy to get along with", "Cons": "rude customersextremely sarcastic and rude managerslow pay"}, "4": {"Date": " Jun 25, 2016", "Summary": "\"Great\"", "Pros": "Free food, free food, long breaks, free food, Sweet tea", "Cons": "Minimum wage, lying to customers, smelling like food"}, "5": {"Date": " Aug 1, 2016", "Summary": "\"Worst experience\"", "Pros": "They offered health insurance.Numerous convinient locations.", "Cons": "Management treated employees very bad. Employees can't even pick one whole meal for lunch, only one thing of the menu. Customers are extremely rude."}, "6": {"Date": " Aug 1, 2016", "Summary": "\"DON'T WORK at the Claymont, DE McDonald's!!!\"", "Pros": "-If you're in the \"in-crowd\", then you can do anything you want without consequence.", "Cons": "-SLOWER than SLOW service at ALL times of the day-DISGUSTING FOOD-High turnover-Discrimination abounds-HR's \"in bed\" with store management!-Don't expect to get a break; even IF you work the required number of hours per NATIONAL Labor Law!-Expect your hours to be cut FOR NO REASON-The MANAGERS are the biggest GOSSIPS. They can't keep ANY HR-related information to themselves. They LOVE to talk about crew members AND one another (even on public media like FACEBOOK!)! Talk about \"HIGH SCHOOL GIRLS\"!"}, "7": {"Date": " Jul 10, 2016", "Summary": "\"fast food\"", "Pros": "Can make some funny friends", "Cons": "hours are too long for too little pay"}, "8": {"Date": " Jun 25, 2016", "Summary": "\"great\"", "Pros": "great place to be at", "Cons": "none while working at this location"}, "9": {"Date": " Jul 9, 2016", "Summary": "\"Cook\"", "Pros": "Free food and all th nuggets you want", "Cons": "Lousy food but tastes pretty good especially the nuggets."}}