{"0": {"Date": " Oct 18, 2016", "Summary": "\"Crew\"", "Pros": "Teaches you how to multi task and patience", "Cons": "Hard work low pay period"}, "1": {"Date": " Oct 4, 2016", "Summary": "\"Cashier review\"", "Pros": "Get a lot of hours, good cashier experience, management is kind", "Cons": "Hard work, difficult customers, extremely fast paced. Must persist despite difficult obstacles"}, "2": {"Date": " Oct 17, 2016", "Summary": "\"Simple first time job\"", "Pros": "easy. Paychecks are always on time.", "Cons": "Can get really busy. Drive thru is repetitive."}, "3": {"Date": " Oct 17, 2016", "Summary": "\"Fast food\"", "Pros": "fast quick convient reasonable prices. Makes for a good first job experience can be used a stepping stones before starting a career", "Cons": "Pay co-workers sometimes you have to deal with really rude customers and you only get paid twice a month. It is very repetitive work."}, "4": {"Date": " Oct 2, 2016", "Summary": "\"Shift Manager\"", "Pros": "Friendly atmosphere, really good employee discount, easy hiring process, good benefits, everything else was pretty good, overall I liked the job", "Cons": "Low pay, hectic environment, management was very lazy or inattentive, employees are poorly trained or not trained at all"}, "5": {"Date": " Oct 17, 2016", "Summary": "\"Last resort employment\"", "Pros": "I enjoyed the diverse work crew, and the hours were reasonably flexible. Other than that, I can't think of much.", "Cons": "They attempt to utterly erase the individual human in order to achieve uniformity and consistency. this results of course in a sterile, dehumanizing environment for both workers and patrons."}, "6": {"Date": " Oct 18, 2016", "Summary": "\"Terrible\"", "Pros": "You weren't unemployedYou have a half off lunchSome cash in your pockets.It dosent smell terrible.Its a decent start if its your first job.", "Cons": "Toxic work environment. Terrible customers, unsanitary equipment. They clean the stovewith the mop they use on the floor. I hated it. Worked there for 3 months."}, "7": {"Date": " Oct 18, 2016", "Summary": "\"Good for starting out or in High School\"", "Pros": "The work was pretty easy", "Cons": "The worst was terrible customers and Pay"}, "8": {"Date": " Oct 2, 2016", "Summary": "\"supreme customer service\"", "Pros": "There are several rewards to working at Mcdonalds.I really enjoyed meeting and greeting every customer early in the morning and seeing their faces light up as I smile and do everything possible as a cashier to make sure their order is correct and the visit to our restaurant was excellent and rememberable.", "Cons": "one down side was working with other staff that were lazy or negative or rude to the customer as well as each other."}, "9": {"Date": " Oct 2, 2016", "Summary": "\"Manager\"", "Pros": "Lots of flexability to cover shifts and my life balance as nescessary. Overall, not a bad experience and one gets to meet people of all walks of life.", "Cons": "Hiring employees to fill the entry level roles is quite the task as this obviously is a first time job versus a career path for most. Sometimes the stress of dealing with a young work force can be trying."}}