{"0": {"Date": " Sep 25, 2016", "Summary": "\"cashier\"", "Pros": "you get free foodflexible hours", "Cons": "people are annoyingcustomers are disrespectful some of them"}, "1": {"Date": " Sep 26, 2016", "Summary": "\"Suck\"", "Pros": "First job to work at , and my sister was working there already", "Cons": "They work to fast , the managers suck , they always want you to stay longer than what you suppose to"}, "2": {"Date": " Sep 25, 2016", "Summary": "\"trash\"", "Pros": "Free food when manager isnt there, lots of time to talk to friends when they come in the store since manager was never there", "Cons": "The store I was in was never clean, had a bad smell, employees never put in complete effort durring shifts"}, "3": {"Date": " Sep 11, 2016", "Summary": "\"What I know\"", "Pros": "Great hoursEasy to learnReasonable pay", "Cons": "People I worked with were rude and liked to gossip a lot."}, "4": {"Date": " Sep 24, 2016", "Summary": "\"Its Meh\"", "Pros": "-Cool people you meet- Free meals everyday you work-50% discount once a day on food", "Cons": "- Not staffed well so your working 2x as hard-breaks are hard to get out- Hard to get promoted"}, "5": {"Date": " Sep 25, 2016", "Summary": "\"I get along with most of the employees. Customers can be nice, but can be extremely rude.\"", "Pros": "Nice environment, nice establishment, great working hours, tips included, nice uniforms, nice employees, clean restaurant, overall a nice place for part time.", "Cons": "Rude customers, unorganized merchandise, if something breaks, you have to take a longer amount of time to do it, and customers get angry."}, "6": {"Date": " Sep 9, 2016", "Summary": "\"Cashier\"", "Pros": "Great environment I really enjoyed working there", "Cons": "I do not have any cons for this position"}, "7": {"Date": " Sep 9, 2016", "Summary": "\"Good\"", "Pros": "Great first jobFast pacedFun environmentYou get to meet a lot of people.Lots of skills learned", "Cons": "No salary benefitsUnless you become a manager, you can't move up in the company.You never get a raise unless the state raises the minimum wage."}, "8": {"Date": " Sep 9, 2016", "Summary": "\"Cool but not a forever job\"", "Pros": "sometimes you get free food , you get to know your coworkers", "Cons": "mean customers , hot work place , fast"}, "9": {"Date": " Sep 9, 2016", "Summary": "\"General Manager\"", "Pros": "Bonuses, experience, promote within, don't need a degree.", "Cons": "Can be stressful, owners/DO can be biased unfair/ have favorites"}}