{"0": {"Date": " Aug 7, 2017", "Summary": "\"Never again\"", "Pros": "weekly pay check. Uniforms were provided, never had to worry about what to wear to work.", "Cons": "schedule, changes every week. Can never make plans a head of time. Pay is horrible. You smell like grease and oil."}, "1": {"Date": " Jul 1, 2017", "Summary": "\"Not bad\"", "Pros": "Management was good at my franchise, good co workers", "Cons": "pay needs to be higher in the state of california"}, "2": {"Date": " Jul 2, 2017", "Summary": "\"Ant\"", "Pros": "I like the pace but don't really socialize with people there", "Cons": "Long hours,co workers, cleaning,stocking,washing"}, "3": {"Date": " Jul 15, 2017", "Summary": "\"mcdonalds\"", "Pros": "i got paid . had full time hours", "Cons": "its mcdonalds, you know its a diffcult job"}, "4": {"Date": " Jul 15, 2017", "Summary": "\"Review\"", "Pros": "Always room to move up, easy to learn", "Cons": "Management is horrible and doesn't get things done in regards to replacing outdated equipment. The store is ran by a bunch of teenagers."}, "5": {"Date": " Jul 15, 2017", "Summary": "\"It's Okay\"", "Pros": "Generally okay wages for low-skill work. If one is going to be working in fast food or in retail, this is a decent choice. Often better managed than competitors. Some room to move up.", "Cons": "Very low sense of community. Often feel expendable and unimportant. Work is difficult and underappreciated."}, "6": {"Date": " Jun 30, 2017", "Summary": "\"crew member\"", "Pros": "great management from the entire management staff", "Cons": "the grill area and some floor a"}, "7": {"Date": " Jun 30, 2017", "Summary": "\"Good First or Second Job\"", "Pros": "Time Flies, Never Hungry Can move up easy", "Cons": "Minimum Wage Co Workers could be a problem"}, "8": {"Date": " Jul 1, 2017", "Summary": "\"Takes a certain kind of person\"", "Pros": "Plenty of room for advancement and great people", "Cons": "Very fast paced and long hours. Something always need your attention"}, "9": {"Date": " Aug 5, 2017", "Summary": "\"Management\"", "Pros": "A great place to work if you dont have children and in highschool or part time job", "Cons": "Some higher management show favoritism and the pay sucks. You can be there for years and work hard... Still be in the same spot"}}