{"0": {"Date": " Dec 8, 2016", "Summary": "\"Great starter job\"", "Pros": "Work way up managementFlexible with students", "Cons": "Weak pay incentive for a lot of grunt work"}, "1": {"Date": " Dec 8, 2016", "Summary": "\"Ok\"", "Pros": "Time pass by fast and discount on food, drinks, desserts. Good team environment fun to work with.", "Cons": "Sometimes sent to clean toilets and manage grumpy customers"}, "2": {"Date": " Dec 8, 2016", "Summary": "\"Good beginner job\"", "Pros": "I really enjoyed working here. Everyone had a positive attitude and we all worked as a team. Worked with our schedule.", "Cons": "Nothing really. Enjoyed working."}, "3": {"Date": " Jan 12, 2017", "Summary": "\"Stores trainer\"", "Pros": "The pros were the free food and the environment everyday to get free stuff and the coworkers", "Cons": "The downside is the some people don't care about society and are rude just because you work at a fast food place"}, "4": {"Date": " Jan 12, 2017", "Summary": "\"Cashier\"", "Pros": "Free meal ok pay", "Cons": "Not enough hours or money"}, "5": {"Date": " Dec 7, 2016", "Summary": "\"manager\"", "Pros": "very enjoyable and interesting people", "Cons": "low pay and not many benifits"}, "6": {"Date": " Dec 8, 2016", "Summary": "\"Pretty good\"", "Pros": "they work with your schedule, management is friendly, rewarded for hard work.", "Cons": "decent amount of annoying customers, come home greasy at the end of the day"}, "7": {"Date": " Dec 22, 2016", "Summary": "\"Good but...\"", "Pros": "It is bitter sweet. You will make a lot of friends (employees and customers) however some customers will get on your nerves and you will have to just keep your mouth close even if they talk to you like your garbage. The boss is nice just call out if your not going to work the next day. If you don't you have three chances if you do that 3 times(it doesn't matter if it's in a row or not) she will fire you", "Cons": "Customers, something happening that you can not control"}, "8": {"Date": " Dec 5, 2016", "Summary": "\"Good\"", "Pros": "Friendly co workers and environment", "Cons": "Management can do a better job treating employees"}, "9": {"Date": " Jan 11, 2017", "Summary": "\"Worst First Job\"", "Pros": "Work with other people in the same position as you which means a lot of high school kids. you technically got money out of the deal", "Cons": "Bi- Weekly pay, Bad managers, inexperienced managers, rude customers, no benefits even after they have been advertised to you"}}