{"0": {"Date": " May 30, 2017", "Summary": "\"Fry cook and Cashier\"", "Pros": "I loved that I was able to gain experience working in the fast food industry.", "Cons": "If you don't have good managers, when rush hour comes, things will get very hectic and unbearable."}, "1": {"Date": " May 30, 2017", "Summary": "\"It wasn't the best\"", "Pros": "i worked with friendly crew members", "Cons": "I was overworked and management was unorganized"}, "2": {"Date": " May 15, 2017", "Summary": "\"Opportunities to grow\"", "Pros": "Opportunities are always there to move up in the companyManagement Development program is worth 12 college credits towards a BAGreat BenefitsGood company valuesGreat food quality", "Cons": "Some times long hours, and working weekends and holidays, but after awhile you get used to have days off in the middle of the week."}, "3": {"Date": " May 15, 2017", "Summary": "\"Basic beginner job\"", "Pros": "Good for a high-school job", "Cons": "food rushes are never fun"}, "4": {"Date": " May 15, 2017", "Summary": "\"I miss my McDonald's TBH\"", "Pros": "Tuition Reimbursement, Language Assistance, Promotion Oppurtunity", "Cons": "Sporadic schedules, minimum wage, unrealistic expectations from management."}, "5": {"Date": " May 16, 2017", "Summary": "\"Facilities Kitchen Design\"", "Pros": "The co-workers are great. It's very much a family environment and the schedule is flexible between work and home life.", "Cons": "Poor training and poor communication between teams."}, "6": {"Date": " May 29, 2017", "Summary": "\"Hard Work and Long Hours\"", "Pros": "If you are looking for a job that is flexible and can offer lots of hours, McDonald's is great. The coworkers are fun to work with (in general), and you can get raises quickly as long as you are a motivated and hard worker.", "Cons": "Management is not helpful, and are largely unaware of problems in the restaurant and what needs to be fixed. You will have to work some pretty late nights and early mornings. Customers will not respect you. Generally, it is understaffed so you will have to juggle multiple tasks and jobs at once."}, "7": {"Date": " May 29, 2017", "Summary": "\"Good start. But worth so much more\"", "Pros": "Good start to my resume", "Cons": "Low wage, Losts of work OFF the clock. Many wage and hour violations."}, "8": {"Date": " May 29, 2017", "Summary": "\"OM\"", "Pros": "Great benefits, clear vision, good team work, several resources available", "Cons": "Corporate lather, corporate politics almost always not based on results but on connections,"}, "9": {"Date": " May 29, 2017", "Summary": "\"Crew member\"", "Pros": "Good hours, will always have work", "Cons": "Lousy costumers, poor management that doesn't care"}}