{"0": {"Date": " Jul 18, 2016", "Summary": "\"Management\"", "Pros": "They have flexible scheduled hours", "Cons": "Customers treat some employees poorly"}, "1": {"Date": " Jul 18, 2016", "Summary": "\"Cashier\"", "Pros": "Some of the upsides to working at this store/company are everyone is like family and a lot of us have known each other for years. We worked well as a store and for the most part with each other. The owners seemed to care about you and your well-being.", "Cons": "Some of the Cons working at this job are they are not very professional. The mangers picked favorites."}, "2": {"Date": " Jul 19, 2016", "Summary": "\"Good Start\"", "Pros": "Good start as teenager job...", "Cons": "Can be stressful in busy times."}, "3": {"Date": " Jul 19, 2016", "Summary": "\"Public relationship intern\"", "Pros": "The working environment is always energetic. There will be coffee and snacks.", "Cons": "The Work is repetitive, but it was probably because I am an intern and I just stayed for a short time."}, "4": {"Date": " Aug 1, 2016", "Summary": "\"Nice to advance, but maybe not stay?\"", "Pros": "Easy to get on, many opportunities for advancement; I started off there as cashier for my very first job, left as a Department Head of Guest Services(management), for crew HIGHLY negotiable hours- managers a little less but still easy to work a good schedule (although this does depend on the GM [the good ones work with you]. A very good place to get work experience in both hard and soft skills.", "Cons": "Constantly on-call, low volume stores have big worries about labor so large potential for being sent home early, High turnover so the constant worry of, \"Is so-and-so going to show up for their shift?\" especially frustrating when they're your replacement. If you become a manager expect to have to shift your life to revolve around your job."}, "5": {"Date": " Aug 1, 2016", "Summary": "\"Crew Member\"", "Pros": "eh, good people to work with, I have nothing else to say. free meal with shift.", "Cons": "will not give enough hours, labor intensive, food is terrible, horrible customers"}, "6": {"Date": " Aug 1, 2016", "Summary": "\"Something good/ something bad\"", "Pros": "very Flexible with work hours", "Cons": "employee attitudes aren't always addressed to provide good service"}, "7": {"Date": " Aug 2, 2016", "Summary": "\"mcdonalds perks\"", "Pros": "The money is consistent and the pay is far you always receive your money on time and last but not least it's a reliable source of income", "Cons": "the customer service is poor at times and the customers are extremely rude and you are expected to take the disrespect with a smile"}, "8": {"Date": " Jul 17, 2016", "Summary": "\"Department Manager\"", "Pros": "I worked with a wonderful group of people who helped teach me the tools and skills needed to succed in any job venue.", "Cons": "Low pay and veribal bashing by the customers on a continual basis. Having to sacrifice service in order for corporate to make a few extra bucks."}, "9": {"Date": " Jul 17, 2016", "Summary": "\"Funn\"", "Pros": "Fun great first job and easy.", "Cons": "Fast paced on your feet and busy"}}