{"0": {"Date": " Sep 27, 2016", "Summary": "\"great company to work for\"", "Pros": "The people I worked with were professionals who brought joy to the workplace regardless of the the environment we were. The location was clean and well kept", "Cons": "Some of the customers were a little bit on the scary side and the neighborhood could have been better. The pay could have been better too - minimum wage is not enough for anyone"}, "1": {"Date": " Sep 27, 2016", "Summary": "\"Mcdonalds crew member\"", "Pros": "Very flexible hours when communicating. Very friendly", "Cons": "Fast paced, will get you working very hard even if it's slow. Will send you home early at times when business is slow, hours are cut occasionally ."}, "2": {"Date": " Oct 11, 2016", "Summary": "\"Line\"", "Pros": "Fun people to work with", "Cons": "Poor management. Good ole boy system"}, "3": {"Date": " Sep 27, 2016", "Summary": "\"annoying\"", "Pros": "good first job for any age", "Cons": "i felt like wasn't treated fairly"}, "4": {"Date": " Oct 11, 2016", "Summary": "\"Got the job done\"", "Pros": "Hire anyone, decent hours as a part time job for students", "Cons": "low pay, some horrible customers"}, "5": {"Date": " Oct 12, 2016", "Summary": "\"McDonald's\"", "Pros": "Fun environment good coworkers easy to get days off and vacations", "Cons": "Horrible pay with bad schedules made changes to it every day"}, "6": {"Date": " Oct 12, 2016", "Summary": "\"A good starter job\"", "Pros": "If you're self-motivated there are opportunities for development. They also work around school schedules. Also the work isn't very challenging so it's a good starter job.", "Cons": "They don't adequately compensate their employees for the work asked of them. A manager should make more than the crew."}, "7": {"Date": " Oct 12, 2016", "Summary": "\"Crew worker\"", "Pros": "Good hoursVery flexable is you're a student", "Cons": "Always short staffed, people always calling off"}, "8": {"Date": " Sep 26, 2016", "Summary": "\"Cashier\"", "Pros": "Great place to start working first job with further growth opps.", "Cons": "A lot of people working each shift."}, "9": {"Date": " Sep 26, 2016", "Summary": "\"maintenance\"", "Pros": "It is my line of work", "Cons": "They don't pay that much for an hourly wage."}}