{"0": {"Date": " Jul 12, 2016", "Summary": "\"It's a great first job!\"", "Pros": "Teaches you how to deal with people, & teaches you good customer service! It's a very good first job. Plus you get 50% off everything! You can spend up to $20", "Cons": "Some customers are really rude lol just don't let your emotions get the best of you, keep a positive attitude no matter how difficult the customer! & Also sometimes it could get really messy in the Kitchen kind of gross.You may also gain weight if you eat a lot lol"}, "1": {"Date": " Jul 25, 2016", "Summary": "\"cashier\"", "Pros": "Free meals and pay sick leaves", "Cons": "lots of favoritism little room for advancement"}, "2": {"Date": " Jul 25, 2016", "Summary": "\"Crew member\"", "Pros": "It's fun and easy and busy", "Cons": "It's ran by high school kids"}, "3": {"Date": " Jul 26, 2016", "Summary": "\"Decent pay for a first job\"", "Pros": "Decent pay (at least at this one $9)flexible hoursjob isn't hard", "Cons": "Customer complaintsMachines can break down from time to timelunch rush"}, "4": {"Date": " Jul 10, 2016", "Summary": "\"Good\"", "Pros": "Good pay, good training, Co workers were very nice to talk to them about different things", "Cons": "It's McDonalds, so the drive through people were very weird. Not in a bad way, a good way."}, "5": {"Date": " Jul 11, 2016", "Summary": "\"Good job if you know how to manage it\"", "Pros": "Many opportunities to grow in the franchise that I'm working at right now. Owner is really good motivating managers and making sure we have all the tools to be successful.Your job can be very easy if you know how to manage your people and if you train your department managers the way they should be trained.", "Cons": "Costumes are usually complaining for small things.Sometimes I feel like I'm babysitting employees. And at the beginning it can be stressful."}, "6": {"Date": " Jul 25, 2016", "Summary": "\"job to have when looking for another job\"", "Pros": "-easy-not hard to move up", "Cons": "-repetitive, low pay (8.50), management, the smell, the customers"}, "7": {"Date": " Jul 25, 2016", "Summary": "\"Part time\"", "Pros": "Flexible hours and a wide variety of positions. Advancing can happen but very hard", "Cons": "Awful bosses.Not a fun place to workVery stressfulI hated the job"}, "8": {"Date": " Jul 25, 2016", "Summary": "\"cashier\"", "Pros": "flexible, interesting, fun, meeting new people", "Cons": "stressful, dealing with mean people, very very fast paced"}, "9": {"Date": " Jul 10, 2016", "Summary": "\"Crew\"", "Pros": "Easy work, clearly specified procedures and instructions. If adhered to, objectives to satisfy client needs are met. Flexible scheduling.", "Cons": "Very high crew turnover and generally low reliability from most crew members which puts a lot of pressure on those that do turn up for work. Probably due to the low entry level pay and low opportunity cost associated with not turning up for work."}}