{"0": {"Date": " Sep 27, 2016", "Summary": "\"Manager\"", "Pros": "Deligated a crew, and got to train my way.", "Cons": "Underpaid, unappreciated. Long hours in a sweaty hot kitchen, little to no room for growth."}, "1": {"Date": " Sep 5, 2016", "Summary": "\"ehhh\"", "Pros": "got money in high school", "Cons": "didnt like how everyone complained within the staff"}, "2": {"Date": " Aug 21, 2016", "Summary": "\"cashier\"", "Pros": "meeting new people seeing them smile always the best", "Cons": "lots of drama from the workers there but got along with them"}, "3": {"Date": " Aug 21, 2016", "Summary": "\"The McDonalds experience\"", "Pros": "It is easy to stay employed.", "Cons": "They cut too many hours"}, "4": {"Date": " Aug 21, 2016", "Summary": "\"Good first job\"", "Pros": "McDonald's provides for good training for people just entering the job world. I'm 17 and they're very strict on labor laws so I don't work above a certain amount of hours. They cut back my hours when school starts so I'm not overworked, and I always get my requested days off.", "Cons": "My coworkers are mostly high schoolers, so there is drama every so often. They're not very good at getting people to train you on things, most things you learn for yourself. Customers get irritated easily, I was yelled at for not taking cheese off a hamburger, and was threatened when I didn't make a milkshake fast enough."}, "5": {"Date": " Aug 22, 2016", "Summary": "\"Great place to start\"", "Pros": "Very flexible schedule that works around your life. Not to tired at the end of the day either.", "Cons": "Food lines can sometimes go on for hours; and, low staff make it incredibly hard to get other needed tasks done."}, "6": {"Date": " Aug 22, 2016", "Summary": "\"Great job!\"", "Pros": "McDonald's catches a lot of flak but it really is a fantastic job that teaches a ton if valuable information and gives you the skills required to be successful in many other job avenues!", "Cons": "Can stressful and high paced so if you're prone to anxiety attacks or can't handle stress 2rll maybe stay away from fast food in general"}, "7": {"Date": " Aug 29, 2016", "Summary": "\"Director- level\"", "Pros": "Enthusiastic, work-hard-play-hard culture, great experience for working within a large corporate organization and supporting a large, complex set of franchises. A strong desire to be innovative and meet the business challenges facing them. Most corporate employees are devoted to the company and there is a family feel. Strong ethics - I never witnessed a whiff of unethical behavior in my 5+ years there.", "Cons": "Because of it's passion for traditions, corporate management has trouble creating true change where it is needed. Also, while the family culture can be wonderful, relationships play too big a part with the franchisees' respect (or lack of) for their corporate counterparts. Those who \"came up through the restaurants\" are sometimes given preferential treatment and are put into positions for which they do not have the skills or talent. I found compensation to be low compared to other companies that hire for my area of expertise."}, "8": {"Date": " Sep 4, 2016", "Summary": "\"Cashier/ crew member\"", "Pros": "They are very organized and clean. They are very fast paced. They are polite and very welcoming.", "Cons": "Their music and clientele are there only problem"}, "9": {"Date": " Aug 20, 2016", "Summary": "\"manager\"", "Pros": "get payed well like alot", "Cons": "alot of work to do"}}