{"0": {"Date": " Aug 12, 2016", "Summary": "\"2nd Assistant Manager\"", "Pros": "Supervise youths in their first jobsEnergetic atmosphereProprietary ledger/bookkeeping experienceFun for kids and families on the go!", "Cons": "Frequent overtime demandsPressure to meet labor percentage goals"}, "1": {"Date": " Aug 26, 2016", "Summary": "\"Great Place\"", "Pros": "Good People and fun to work at", "Cons": "Low Pay and not much room for advancement"}, "2": {"Date": " Sep 16, 2016", "Summary": "\"Chaise\"", "Pros": "grear place to work if you need money", "Cons": "Really fast paced for a larger person"}, "3": {"Date": " Sep 16, 2016", "Summary": "\"Not good for a long term\"", "Pros": "Free food, flexible schedule, good teamwork, thats it there much pros", "Cons": "Irregular hours , low pay, short staff, high turnover, no benefits"}, "4": {"Date": " Aug 11, 2016", "Summary": "\"Job quality depends on the location\"", "Pros": "Depending on the owner, this can be a great job. It definitely has its ups and downs.", "Cons": "Customer Service is hard especially in fast food."}, "5": {"Date": " Aug 25, 2016", "Summary": "\"Crew\"", "Pros": "McDonald's has very flexible hours and you get free food during your break. Also, you get free drinks all day. Working with the sakes and McCafé is great.", "Cons": "Expect a lot of standing and confusion. You get a break after 5 hours and it's unpaid. Costumers can be very rude and they are always right."}, "6": {"Date": " Aug 25, 2016", "Summary": "\"Crew Member\"", "Pros": "Decent pay along with as many hours as I wanted", "Cons": "Limited breaks and constant work"}, "7": {"Date": " Aug 25, 2016", "Summary": "\"mcdonalds doing the best they can\"", "Pros": "mcdonalds does the best they can to offer employee benefits including some college tuition assistance", "Cons": "fast food is difficult work, lots of staff turnover and sometimes management seems unresponsive to employee concerns,"}, "8": {"Date": " Aug 25, 2016", "Summary": "\"Average Job\"", "Pros": "Easy Job and easy to obtain position.Good for a summer job and you will get paid minimum wage.Its your average job.", "Cons": "Having to always clean, and do something even if its unnecessary. You get what you expect when you start working there. minimum wage, and the same conditions of any fast food joint."}, "9": {"Date": " Aug 25, 2016", "Summary": "\"Simple Work, Awful Hours, Unhappy people\"", "Pros": "The work is easy. It's not complicated regardless of where you are stationed. I was a crew member that worked in the kitchen and generally worked breakfast lunch and dinner.", "Cons": "Mc Donald's a fast-paced environment with high demands and expectations not suited for the bare minimum wage offered. On the kitchen side of things, the work is not without its dangers. The grill is extremely hot and you will more than likely give yourself a few 2nd degree burns trying to throw down meat as quickly as you can. Managers will hound you for inexperience or lack of speed. Turn over rate is generally high and most employees show a sense of dread or at the very least a morbid look of apathy."}}