{"0": {"Date": " Sep 25, 2017", "Summary": "\"Terrible Culture\"", "Pros": "Easy to move into management. You get paid albeit very little for the amount of work you will be expected to do.", "Cons": "Terrible place to work. Never enough labor. Constantly changing procedures. Nothing is ever good enough. Up double digits sales and transactions not good enough you probably forgot to put a timer on the sanitizer bucket."}, "1": {"Date": " Sep 25, 2017", "Summary": "\"Working at McDonalds\"", "Pros": "You can get promoted quick depending on who you know, you don't have to have any skills", "Cons": "Good managers are treated the worst, wage deductions, threats of getting fired for everything, don't Care about their employees life/health, no paid vacations or health insurance"}, "2": {"Date": " Sep 26, 2017", "Summary": "\"Prep Cook\"", "Pros": "Like cook,setting -up line,sometime baking", "Cons": "Not enough hours,days,not appreciated,chooses,employee some give more than 8,some not"}, "3": {"Date": " Sep 4, 2017", "Summary": "\"Not worth the pay\"", "Pros": "If you like working with people, you'll have fun. This is a relatively easy job when you have good co-workers.", "Cons": "There aren't even benefits to make up for the low pay. Even when you work long shifts you rarely get a break. We never get holiday pay and apparently there is a new policy in place that only allows managers to get vacation pay. We also don't get raises often; I've only gotten one in three years here."}, "4": {"Date": " Aug 20, 2017", "Summary": "\"Great workplace environment\"", "Pros": "Friendly staff that helps show you the ropes so that you learn easier and are more capable to handle the daily challenges.", "Cons": "You're me feet will hurt from working more than two hours so do what you can to prevent any pain"}, "5": {"Date": " Sep 4, 2017", "Summary": "\"McDonald's is a nice starter job.\"", "Pros": "You make new and some life long friends. You get half off or at some stores free food. Your schedule is flexible.", "Cons": "The pay sucks. Usually it's hot. Some customers are rude"}, "6": {"Date": " Aug 19, 2017", "Summary": "\"Crew\"", "Pros": "Flexible scheduling, easy going coworkers", "Cons": "Sometimes not having enough hours."}, "7": {"Date": " Aug 19, 2017", "Summary": "\"Crew trainner\"", "Pros": "Its very easy and i also boss the mangers around a lil bit i am great at helping out", "Cons": "I got a raise"}, "8": {"Date": " Aug 20, 2017", "Summary": "\"Crew Member\"", "Pros": "I good reason to work at McDonald's is the respect. The other reason is they also pay good enough", "Cons": "I seen a lot of people do dirty things and I reported it to the administration then they fired me."}, "9": {"Date": " Sep 2, 2017", "Summary": "\"Okay Job\"", "Pros": "- Easy work- Time goes by fast", "Cons": "- Management is sometimes rude- Management sometimes doesn't care about personal afflictions."}}