{"0": {"Date": " Apr 27, 2016", "Summary": "\"Crew\"", "Pros": "Easy job, but fast paced", "Cons": "waking up at 3:30 am for a minimum wage job."}, "1": {"Date": " Apr 28, 2016", "Summary": "\"What to expect\"", "Pros": "Experience in the fast good industry. Learning customer service skills. Learning to put up with co-workers and managers in a drama filled environment.", "Cons": "Drama caused by management and co-workers. Management not working together to better the crew or store. Lack of training."}, "2": {"Date": " Apr 26, 2016", "Summary": "\"Good Starter Job- that's it\"", "Pros": "Teaches you the basics of working at a job. Easy to get into. You don't have to commit to your job comparatively. Decent pay for how easy it is. Semi-flexible hours.", "Cons": "Terrible management, no one really cares about you in your career or your personal life, just as long as you are fast and adequate. Teenagers don't care about the job and often don't show up at all, are late, and are lazy in general. Negative work environment. It is hard to be proud working at a place that serves such terrible quality food."}, "3": {"Date": " Apr 26, 2016", "Summary": "\"I worked as a certified swing manager.\"", "Pros": "Easy tasks to follow, different menus were always changing for something new and fresh. Fixed schedules for managers. Easy to train other people or learn other departments.", "Cons": "The interactions between the GM in the morning was very frustrating. Sometimes, some mean customers come hungry and get mad for the aervice you provide. The stress you get from working is enormously a lot that you will get used to hearing mean things to be normal in your life."}, "4": {"Date": " May 18, 2016", "Summary": "\"Over worked\"", "Pros": "nothing was good about this job besides actually having a job", "Cons": "Will work you worse than a pack mule"}, "5": {"Date": " May 19, 2016", "Summary": "\"It is horrible!\"", "Pros": "I guess there is a flexible schedule, although at the location I work they never give me the days I request off, even months ahead.", "Cons": "The people that work there are ATROCIOUS. Not only is it ghetto, but the managers are rude, inconsiderate, and have horrible attitudes. I understand this may not be all locations, but the location I work at and from what I have observed at other locations around me, the employees and managers are horrible people. You will also leave work smelling like crap everyday, covered in filth. Also, they rush you on every little thing, even if helping the customers."}, "6": {"Date": " May 19, 2016", "Summary": "\"Some job is better than no job.\"", "Pros": "The job is flexible, especially if you happen to be a college student. Requests for days off are usually honored. There is opportunity to do a lot for the company and what a person has done can go on a resume. The job also inspires a person to get out to do something great.", "Cons": "Working for a privately owned McDonald's is not ideal, at least in my experience. Benefits will normally decrease over time. The owner may cut corners at the expense of everyone to benefit themselves. Employees are not recognized to the extent that they should be for what they do. An AC could be broken over a period of a decade with nothing being done to fix it. And the corporation just lets it slide."}, "7": {"Date": " Apr 27, 2016", "Summary": "\"Grill\"", "Pros": "Free food when the boss isn't looking", "Cons": "Low pay crazy schedule ghetto people"}, "8": {"Date": " Apr 8, 2016", "Summary": "\"Crew member\"", "Pros": "Clean full Uniforms provided to employees.", "Cons": "Starting pay rate of minimum wage usually."}, "9": {"Date": " Apr 12, 2016", "Summary": "\"review\"", "Pros": "ProsFlexible hoursEasy tasksLots of hours available", "Cons": "Low pay Stressful environment High paced"}}