{"0": {"Date": " Feb 20, 2017", "Summary": "\"Crew member\"", "Pros": "I'm able to provide for my son and make people smile", "Cons": "The attitudes of managers my feet hurt"}, "1": {"Date": " Feb 21, 2017", "Summary": "\"Good place to work\"", "Pros": "The manager at my particular McDonald's is very professional, and treats customers and workers very well. We also get a lot of the newer equipment, so it makes the job easier. It's still hard work, though.", "Cons": "It's still a minimum wage job with not a lot of benefits. While it's a great job for someone just out of high school earning work hours, or someone that's in-between the job they really want; it's not the best option for someone looking to build a long-term career (unless you go into management). Plus, if you are not in decent physical shape, you will have difficulty working at McDonald's."}, "2": {"Date": " Feb 21, 2017", "Summary": "\"Guest Service Manager\"", "Pros": "Working for customer satisfaction and service to be exceptional", "Cons": "Slow in advancing to Department Manager"}, "3": {"Date": " Mar 7, 2017", "Summary": "\"Okay employment\"", "Pros": "They offer a free meal for every shift you work, if you like their food that can be considered a benefit", "Cons": "They gave part time employees horrible shifts and never wanted to give days off that they needed."}, "4": {"Date": " Feb 19, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Good benefits, good medical, great birthday system. Work parties. Events. Perkspot.", "Cons": "Some people have language barriers."}, "5": {"Date": " Mar 6, 2017", "Summary": "\"Terrible Management\"", "Pros": "free meal per shift, over min wage", "Cons": "no decent managers at my location, none of them would do their work and the crew members were left to suffer. would schedule me for 11 hours one week and 30 the next"}, "6": {"Date": " Mar 6, 2017", "Summary": "\"Basic Teenager Job\"", "Pros": "Easy Work. Looking for extra pocket money with minimal work? look no further!", "Cons": "Like anywhere the customers can be good or bad, you get a lot of bad ones. If the person in charge of making the work schedule does not like you expect to get lousy work hours. Got some really bad training. And most of the cooks did not speak English, really hard to tell them special orders."}, "7": {"Date": " Mar 7, 2017", "Summary": "\"manager\"", "Pros": "benefits are great. My medical and dental insurance are the better then most companies or the state offer.", "Cons": "very long hours standing on my feet. I work 10 plus hours a day without a break due to my manager title. I work as a manager of 2 departments and only get paid for 1. so not fair..."}, "8": {"Date": " Mar 6, 2017", "Summary": "\"McDonald's\"", "Pros": "For the most part, the customers are easy to deal with and so are the co-workers. Everything is stocked in a way that is easy to find.", "Cons": "You do have to deal with customers who get upset over the littlest things: ice cream machine is shut down, having to repeat themselves once or twice, the prices of menu items, etc. There's also the co-workers who sit on their phone all shift and do nothing until it's super busy. Not to mention, all they do is talk to the other co-worker who also does nothing."}, "9": {"Date": " Mar 6, 2017", "Summary": "\"Minimum wage trap.\"", "Pros": "The flexibility of hours is good and there is room for advancement.", "Cons": "Raises and compensation if very few and far between. They will train you at full time but after those initial two weeks they pull e rug out from under you and some employees are lucky to get 15 hours a week"}}