{"0": {"Date": " Feb 2, 2017", "Summary": "\"Former Shift Lead\"", "Pros": "Fast paced environment, lots of room for growth, promotes from within, great co-workers. Great opportunity for high school and early college kids.", "Cons": "Got called in to cover shifts a lot as a shift lead. Management was not good. Promoted, but pay did not increase with promotion."}, "1": {"Date": " Feb 2, 2017", "Summary": "\"Gallery\"", "Pros": "The crew I worked with made things run smoothly.", "Cons": "Customers were rude at the Gallery location, and while the crew was great, there was a lot of rotating of good members in and out which killed the pros."}, "2": {"Date": " Jan 17, 2017", "Summary": "\"I've worked there for over a year\"", "Pros": "Friendly to work with", "Cons": "Could be faster during lunch"}, "3": {"Date": " Jan 17, 2017", "Summary": "\"Best job in my life\"", "Pros": "I keeps a bag under the counter to put mistakes in so I can eat at the end of my shift.", "Cons": "The man. My so called manager sits over my shoulder and complains about my drawer when it doesn't add up. I be like look lady if you want in my drawers then lets go out back to my truck and we can do this like adults."}, "4": {"Date": " Feb 1, 2017", "Summary": "\"worst job ive ever had\"", "Pros": "hours, breaks, food, thats it", "Cons": "drama! with highschoolers and managment, favoritism, and managers arent trained well, no communication"}, "5": {"Date": " Jan 17, 2017", "Summary": "\"REVIEW\"", "Pros": "Great Benefits for employees long term", "Cons": "Workload must be reviewed for operations, less administration"}, "6": {"Date": " Jan 17, 2017", "Summary": "\"Experience worker\"", "Pros": "Friendly coworkers, flexible schedules, easy training", "Cons": "Low pay, fast pace environment, dirty"}, "7": {"Date": " Jan 17, 2017", "Summary": "\"I loved McDonald's\"", "Pros": "fast paced environment, lots of food", "Cons": "Too much food in front of you"}, "8": {"Date": " Jan 18, 2017", "Summary": "\"Work\"", "Pros": "Had hours non stop. Made good friends.Had fun while working.I'm very good with fast paced working.", "Cons": "Rude customersRedundant managersIt cost to drink water.No air conditioning....that kitchen be hot."}, "9": {"Date": " Jan 31, 2017", "Summary": "\"Crew member\"", "Pros": "Flexible hours, pays minimum wage", "Cons": "The restaurant that worked in did not have a great manager. Schedules were mad two days before the week started. It doesn't boost employee morale to threaten people with being fired if they don't work on holidays."}}