{"0": {"Date": " Feb 29, 2016", "Summary": "\"Swing Manager\"", "Pros": "Gained valuable experience for future internships and employment. Learned skills necessary to succeed in the business world. Hours were flexible, and duties were easy.", "Cons": "Dealing with customer's and inadequate employees was aggravating. Facilities were not always the cleanest."}, "1": {"Date": " Feb 29, 2016", "Summary": "\"fry cook\"", "Pros": "offers opportunities to move up", "Cons": "have to put up with a lot of young coworkers and their problems"}, "2": {"Date": " Feb 15, 2016", "Summary": "\"Great place\"", "Pros": "As. Great place to learn about the workplace. Great team of employees that I will always love to death", "Cons": "It was hard working in fast food and being on my feet all the time. I would like the chance for a promotion b"}, "3": {"Date": " Feb 14, 2016", "Summary": "\"Assistant Manager\"", "Pros": "Flexible schedule, lots of overtime available, jack of all trades, never get stuck at any station, pretty good pay.", "Cons": "overtime pretty much mandatory, angry customers generally have to deal with you, doing most of the managers job for them."}, "4": {"Date": " Feb 14, 2016", "Summary": "\"Good for a first job\"", "Pros": "Depending on the management, McDonalds can be a good starting place. Just by showing up and working, you could easily get promoted to management. The coworkers start to feel like family.", "Cons": "The usual bad customers (and you WILL get those) can ruin your day. It's really repetitive work, and the pay is just above minimum wage. The wrong management will ruin your team."}, "5": {"Date": " Feb 15, 2016", "Summary": "\"Assistant Manager\"", "Pros": "The pros are the training and management experience that I gained. I gained many valuable skills that I have been able to apply to all aspects of my life.", "Cons": "The only real con that I had was not getting promoted because I was too valuable in my position. Had I gotten the promotion, I would still be working there. Most of the time I wish I still was. I just couldn't wait forever."}, "6": {"Date": " Feb 28, 2016", "Summary": "\"Food prepping, food assembly, maintenance\"", "Pros": "Get paid every week, teamwork, great opportunity.", "Cons": "The management sometimes is not good."}, "7": {"Date": " Feb 29, 2016", "Summary": "\"Not the Mcbest\"", "Pros": "Fast-paced environment (which is guess is only a \"pro\" if you're into that),", "Cons": "Management (in my experience) has no inclination to admit when they're wrong, and quite frankly, doesn't care."}, "8": {"Date": " Mar 20, 2016", "Summary": "\"My Review\"", "Pros": "Learning to get along with co-workers and customers", "Cons": "They change your availability without your permission"}, "9": {"Date": " Mar 20, 2016", "Summary": "\"General Manager\"", "Pros": "Love working with public and customer service was my specialty", "Cons": "Serious Upper Management issue. The chain of command from GM was DM the VP and President. But, they wanted to work me 70 hours and pay me for 40 every week. Got old cause I was the GM but never had control of my own restaurant because to many chiefs and not enough indians."}}