{"0": {"Date": " Jan 5, 2017", "Summary": "\"Associate\"", "Pros": "Not around any more so don't bother applying. When they were they were somewhat flexible in scheduling. That was the only pro.", "Cons": "Couldn't do simple things as promised. No direct deposit after filling out the forms twice. Would ask for time off in advance and would have to work or threatened with being fired. Actual physical location was falling apart, and would only get cosmetic treatment before inspections. Pay for managers topped out at $8.50 and could only make extra for getting sales incentives. Managers were shuffled between stores when they were in discipline."}, "1": {"Date": " Nov 29, 2016", "Summary": "\"Crew member\"", "Pros": "Some of the people are cool", "Cons": "It doesnt pay like it should"}, "2": {"Date": " Nov 29, 2016", "Summary": "\"Great Store\"", "Pros": "Worked with some amazing people, learned a lot about work culture.", "Cons": "Hot Conditions but not too bad"}, "3": {"Date": " Dec 13, 2016", "Summary": "\"McDonalds\"", "Pros": "Staff was fun to work with.", "Cons": "Constantly changing products, low pay for the amount of work required."}, "4": {"Date": " Dec 13, 2016", "Summary": "\"crew/manag\"", "Pros": "Work with your daily schedule, when busy day goes fast, able to advance", "Cons": "Low wage, being short handed"}, "5": {"Date": " Dec 13, 2016", "Summary": "\"Life at McDonalds\"", "Pros": "Easy to advance, clear guidelines, no prior experience necessary, will usually work with any scheduling constraints.", "Cons": "Large amount of effort for little compensation, customers and coworkers can create a hostile work environment at times."}, "6": {"Date": " Dec 14, 2016", "Summary": "\"Cook\"", "Pros": "Flexible with your school schedules, willing to work with you to grow in the immediate company. Plenty of opportunities for more hours.", "Cons": "The management could care less what you do, other employees are unhelpful and are there just for the paycheck"}, "7": {"Date": " Nov 28, 2016", "Summary": "\"Crew\"", "Pros": "I have 16 years of experience", "Cons": "The manager was rude. Lack of hours."}, "8": {"Date": " Nov 28, 2016", "Summary": "\"Service Man\"", "Pros": "Payment is too little for my value", "Cons": "Payment is too little for my value, so I am sad"}, "9": {"Date": " Nov 28, 2016", "Summary": "\"Manager\"", "Pros": "No day is ever the same!", "Cons": "Work hours vary a lot."}}