{"0": {"Date": " Oct 2, 2016", "Summary": "\"Good Starter Job\"", "Pros": "Teaches you valuable life lessons; like go to college. :D", "Cons": "Hard thoughtless work. You will sweat and smell like burger grease."}, "1": {"Date": " Oct 16, 2016", "Summary": "\"Part Time Gig\"", "Pros": "Since minimum wage went up working at McDonalds part time helped me to save money and it was simple", "Cons": "dealing with rude customers"}, "2": {"Date": " Oct 16, 2016", "Summary": "\"Crew Member\"", "Pros": "Experience with customer service, meet people, 50% discount on days you work.", "Cons": "Low pay, high stress/fast paced, few breaks"}, "3": {"Date": " Oct 17, 2016", "Summary": "\"McDonalds\"", "Pros": "The company is growing, and continues to pioneer towards the future.", "Cons": "Some of the employees have left for different companies"}, "4": {"Date": " Oct 17, 2016", "Summary": "\"I didn't stay for long because i had a higher paying job\"", "Pros": "Friendly environment. Customers are rude because most feel you are below them for working there. Depending on your manager it can be fun or it can be hell", "Cons": "Work hard for so little."}, "5": {"Date": " Oct 17, 2016", "Summary": "\"Almost\"", "Pros": "The coworkers were great and I loved working with them.", "Cons": "The management was rude and the organization was horrible ."}, "6": {"Date": " Oct 2, 2016", "Summary": "\"Job opening\"", "Pros": "Is that you have fun at what you do and interact with people.", "Cons": "It sometimes can be very stressful and lot of work for one person."}, "7": {"Date": " Oct 15, 2016", "Summary": "\"Crew Member\"", "Pros": "Availability to request off and get the day off", "Cons": "Not valued as an employee, really no benefits. & pushed around by managers"}, "8": {"Date": " Oct 16, 2016", "Summary": "\"I'm a crew trainer\"", "Pros": "It is a good place to start off at, definitely not a career. It helps build customer service skills which is beneficial for other jobs down the road", "Cons": "Day shifts are often smoother running than night shifts. It's just one thing I've noticed from working there, probably because a lot of high schoolers could only work at night"}, "9": {"Date": " Oct 1, 2016", "Summary": "\"Operations manager\"", "Pros": "Opportunity for many new experiences", "Cons": "Work life balance is a challenge"}}