{"0": {"Date": " Jul 6, 2016", "Summary": "\"Crew Member\"", "Pros": "pay is more than minimum wage", "Cons": "stressful place to work at"}, "1": {"Date": " Jul 6, 2016", "Summary": "\"Very unorganized place\"", "Pros": "Always guaranteed hours and sometimes overtime when understaffed", "Cons": "Not enough crews working. Overworked and underpaid"}, "2": {"Date": " Jul 6, 2016", "Summary": "\"Not horrible but could be better.\"", "Pros": "Most customers are friendly, friendly coworkers, easy work, flexible schedules, and discounted food.", "Cons": "Management is unorganized and some managers are unexperienced, no benefits, understaffed, sent home early a lot to meet labor."}, "3": {"Date": " Jul 6, 2016", "Summary": "\"Cashier\"", "Pros": "Free Food quick hours and nice people", "Cons": "Low wage, rude customers, very boring."}, "4": {"Date": " Jul 6, 2016", "Summary": "\"crew\"", "Pros": "great people great friends customers are sometimes great", "Cons": "managers are rude and canning do not care about you"}, "5": {"Date": " Jul 6, 2016", "Summary": "\"Ok job\"", "Pros": "you are able to meet new people", "Cons": "serious lack of pay/ hour ratio"}, "6": {"Date": " Jul 6, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Occasionally good people, most of the time they had smiles on their faces.", "Cons": "Greasy, hard work for little pay."}, "7": {"Date": " Jul 6, 2016", "Summary": "\"Not The Best\"", "Pros": "Meet New PeopleExperience Having a JobOk Pay For Being A Teenager", "Cons": "Fast PacedCan Be Extremely BusyOk TrainingCan Be BoringJust Isn't The Best Job For Me Personally"}, "8": {"Date": " Jun 22, 2016", "Summary": "\"Customer Service\"", "Pros": "There is Room for Growth..They Offer Paid Training to New Employees. There's A McDonalds In Every City So Getting to Work Wont Be A Problem.", "Cons": "Some Customers Are Hard to Handle So You Need to Have Alot of Patience and Self Control. Employees Discount Could Be Better."}, "9": {"Date": " Jul 5, 2016", "Summary": "\"Old job\"", "Pros": "Good food, and great way to communicate with customers", "Cons": "Bad management and lunch time can be chaotic."}}