{"0": {"Date": " Apr 25, 2016", "Summary": "\"Overall Good place to work\"", "Pros": "Great place to work and nice people to work with. The environment is clean and management do care about you here. Over all it is a good place to work depending on experience.", "Cons": "Dealing with the public and other people that come into the restaurant is not a good part of the job because people are rude. Work life balance is not good, but the establishment still has to run."}, "1": {"Date": " Apr 25, 2016", "Summary": "\"cashier\"", "Pros": "Coworkers were nice and sometimes helpful.", "Cons": "rude customers (that's everywhere) short staff , had selfish boss."}, "2": {"Date": " Apr 8, 2016", "Summary": "\"Can be good, if you like part time\"", "Pros": "Flexible schedules, great if you like customer service/smiling. I personally have great co-workers and love to go to work!", "Cons": "I can't believe some people they've advanced to Shift Lead or worse Manager... the Peter Principle in effect! Sometimes they hire seriously stupid people, makes the job harder."}, "3": {"Date": " Apr 11, 2016", "Summary": "\"Loving it!!\"", "Pros": "It holds amazing opportunities! It is stressful and a lot harder than most think, but it's a great corporation to work for!", "Cons": "Again it's stressful, sometimes hard work goes unnoticed for awhile- if you keep it up you can be at the top in no time!"}, "4": {"Date": " Apr 11, 2016", "Summary": "\"Cashier and cook\"", "Pros": "I love my job McDonald's has always treated me fair I love my customers and the people I work with we are family at work lol", "Cons": "We have to work that's a downer"}, "5": {"Date": " Apr 11, 2016", "Summary": "\"Business Consultant\"", "Pros": "At McDonalds you learn a lot about things to help you in the future", "Cons": "I do not have any negative comments about McDonalds"}, "6": {"Date": " Apr 11, 2016", "Summary": "\"Cook\"", "Pros": "good wage and good benefits", "Cons": "customers that don't appreciate you at all"}, "7": {"Date": " Apr 24, 2016", "Summary": "\"Crew member\"", "Pros": "You get to learn how to work with some interesting people.", "Cons": "The management is terrible."}, "8": {"Date": " Apr 25, 2016", "Summary": "\"McDonald's\"", "Pros": "Easy if you are doing drive through", "Cons": "Rude customers, horrible managers one of which even got drunk during her shift, lots of drama, the smell is horrible, too many customers"}, "9": {"Date": " Apr 26, 2016", "Summary": "\"Cashier\"", "Pros": "One of the pros include the half off discount for food and meeting new people", "Cons": "Theres a lot of favoritism between managers and crew members"}}