{"0": {"Date": " Dec 14, 2016", "Summary": "\"Great place to work\"", "Pros": "good pay, excellent management. They do a fantastic job of managing your schedule around your prior obligations as their are always so many shift options", "Cons": "Working night shifts. Some nights you would have to be there at 3am and it was awful getting up that early"}, "1": {"Date": " Dec 14, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Make sure doing it suppose to do.", "Cons": "Make sure the crew are doing the correct procedure"}, "2": {"Date": " Dec 14, 2016", "Summary": "\"Great company\"", "Pros": "Great place to work for", "Cons": "Systems are internally developed and outdated"}, "3": {"Date": " Dec 14, 2016", "Summary": "\"McDonalds\"", "Pros": "really good work ethics and really good learning Experience the environment really nice", "Cons": "the rude customer not enought hours and the breaks are really short"}, "4": {"Date": " Dec 15, 2016", "Summary": "\"Maintenance\"", "Pros": "Great place to work", "Cons": "None as far as I am concerned."}, "5": {"Date": " Jan 19, 2017", "Summary": "\"Manager\"", "Pros": "Teaches you patience and leadership skills", "Cons": "Attitudes of workers and customers"}, "6": {"Date": " Dec 29, 2016", "Summary": "\"Good hours and the crew members are nice.\"", "Pros": "Fun, easy, fast paced. You will love it because its an easy job.", "Cons": "Some times management isn't so good."}, "7": {"Date": " Dec 29, 2016", "Summary": "\"Cashier\"", "Pros": "Good clean environment up to speed with giving and taking orders", "Cons": "The coworkers were lazy and rude to the customers"}, "8": {"Date": " Dec 29, 2016", "Summary": "\"No thanks\"", "Pros": "Hours. Above minimum wage. Lots of service", "Cons": "Terrible management and staffing issues"}, "9": {"Date": " Dec 29, 2016", "Summary": "\"Horrible management\"", "Pros": "You learn very useful and universal skills. Working/interacting with a wide variety of people. Learning how to be resilient. Food safety is always useful knowledge.", "Cons": "Horrid management that is not held accountable, unrealistic expectations of staff and little to no incentive in pay. Favoritism/nepotism at play in staffing decisions. Inflexible scheduling, long hours."}}