{"0": {"Date": " Feb 10, 2016", "Summary": "\"Fired for showing up to early...sad face\"", "Pros": "Feelings aren't hurt when fired", "Cons": "Saying you work at MacDonaldsPayLife"}, "1": {"Date": " Jan 4, 2016", "Summary": "\"it is a job\"", "Pros": "it is a paying job that can help when things are tight or need some extra cash", "Cons": "can get stressful due to demand"}, "2": {"Date": " Jan 5, 2016", "Summary": "\"Former employee\"", "Pros": "The people I worked with were amazing! They loved their job and they were great at it.", "Cons": "The hours varied so I was never sure what hours I was going to work one week to the next."}, "3": {"Date": " Jan 5, 2016", "Summary": "\"It's a ok job for a teen.\"", "Pros": "friendly team well insurance free meals", "Cons": "upper management won't give time off very stressfull"}, "4": {"Date": " Jan 5, 2016", "Summary": "\"Cashier Team Member\"", "Pros": "It's a company that allows for growth opportunities", "Cons": "Drive-through in the winter is not very pleasant"}, "5": {"Date": " Jan 18, 2016", "Summary": "\"Worked for MCD in 2 States, not everything better in TX\"", "Pros": "decent amount of hours, free food and discounts on some, some staff will work together as a good crew, mostly flexible, In Arkansas the owners threw parties for Christmas and had contest for TVs, video game consoles and others", "Cons": "low pay for managers and crew, long hours sometimes without break, turnover rates, how management plays favorites, since in TX the language barrier, they offer class for English but no one takes it, Manager yell at crew for they mistakes or misshaps"}, "6": {"Date": " Jan 18, 2016", "Summary": "\"I enjoyed working for Mcdonalds. Cant say I had a bad experience.\"", "Pros": "They like to promote from within. I enjoyed moving up and making decent money.", "Cons": "The culture is not as professional as I would have preferred. Not enough opportunities for bonuses either."}, "7": {"Date": " Jan 18, 2016", "Summary": "\"Good place to work for a first time job\"", "Pros": "Great coworkers, good environment, move up positions, 50% off food, free drinks", "Cons": "Favoritism, Hours, Hard work, rude customers"}, "8": {"Date": " Jan 18, 2016", "Summary": "\"Cashier\"", "Pros": "30 plus hoursGreat crewAvailable over time", "Cons": "I don't have any complaints"}, "9": {"Date": " Jan 19, 2016", "Summary": "\"Good for a starting job.\"", "Pros": "Fun people and great and faced paced.", "Cons": "The managers are strict and nag you when you call in sick and think you're lying all the time and cut hours for stupid reasons"}}