{"0": {"Date": " Mar 17, 2018", "Summary": "\"Don’t waste your time\"", "Pros": "Half off food, free drinks", "Cons": "The coworkers are lazy, managers don’t do a good job. The customers are just rude half the time. The management doesn’t care for employees. Staff isn’t trained properly"}, "1": {"Date": " Mar 2, 2018", "Summary": "\"Crew Member\"", "Pros": "considerable discount on employee food", "Cons": "the work hours can be difficult"}, "2": {"Date": " Mar 16, 2018", "Summary": "\"Cashier\"", "Pros": "easy job to get, easy to balance with life if you're under 18", "Cons": "low wage, poor working conditions, terrible coworkers"}, "3": {"Date": " Mar 17, 2018", "Summary": "\"Crew trainer\"", "Pros": "Free meals. Flexible with there hours. There are benefits. They provide with the uniform. It's very easy to become a manager", "Cons": "Make you stay work over time even if u dont want to because they are understaffed. Depends where you work at but some people won't give you respect"}, "4": {"Date": " Mar 1, 2018", "Summary": "\"Good but not paid good.\"", "Pros": "Easy work. Easy people. Work around when you want to work", "Cons": "Pay is not very competitive"}, "5": {"Date": " Mar 1, 2018", "Summary": "\"It was okay, not bad\"", "Pros": "Great pay, good hours, not bad for a first time job", "Cons": "Rude management and rude coworkers"}, "6": {"Date": " Mar 1, 2018", "Summary": "\"Crew member\"", "Pros": "Great opportunity at McDonald's plus I'm always fast paced and that's what McDonald's was all about was fast pace and quality food", "Cons": "The time it takes to become a manager is ridiculous I feel like if you are qualified you should get the position"}, "7": {"Date": " Mar 15, 2018", "Summary": "\"Crew Member\"", "Pros": "McDonald's was very flexible with hours", "Cons": "Never had breaks or lunches on time or got off on time"}, "8": {"Date": " Mar 15, 2018", "Summary": "\"Crew Trainer\"", "Pros": "The flexibility as they usually worked around your schedule. I also enjoyed the benefits of getting supplement insurance from Aflac that you can keep for life.", "Cons": "Raises were rarely given out and have too many management changes. Over they failed to hire reliable employees and instead kept hiring sorry high school kids that always slacked off during the job."}, "9": {"Date": " Mar 15, 2018", "Summary": "\"Crew member\"", "Pros": "flexible, good start, cashier, good crew", "Cons": "can be unrecognized for performance"}}