{"0": {"Date": " Sep 1, 2017", "Summary": "\"It's better than you think\"", "Pros": "Ya lots of free food and happy atmosphere", "Cons": "Too much food and you spend all your money on new clothes"}, "1": {"Date": " Sep 2, 2017", "Summary": "\"Pretty good\"", "Pros": "•Opportunity to get an income•Friendly co-workers•Nice boss•Half off lunch•possibility to get some education funding•Good food", "Cons": "•Really fast pace•High Expectations of New employees•less hours if you don't meet their expectations•Has a tendency to overstretch an employee"}, "2": {"Date": " Sep 15, 2017", "Summary": "\"Shift manager\"", "Pros": "Good experience, get to work with people that kinda become your family,", "Cons": "Very stressful, we have to deal with a lot of crap, we don't make much more than the crew"}, "3": {"Date": " Oct 7, 2017", "Summary": "\"Poor job Poor management.\"", "Pros": "Most Co-workers are fun to work with", "Cons": "Low intelligence level required to get the job shows when you have co-workers who can hardly add or subtract if they hit the wrong button. Even worse is the fact most managers are only managers because they've been there longer than most since most quit due to poor management."}, "4": {"Date": " Aug 31, 2017", "Summary": "\"Cashier\"", "Pros": "great Team work ethics,very efficient and fast paced and everyone did their best to always meet the daily goals and satisfying the customers.", "Cons": "It was a bit to far for me and could not transfer closer to my home until 3 months."}, "5": {"Date": " Aug 31, 2017", "Summary": "\"Good Place to Work\"", "Pros": "Very nice facilityGood first job", "Cons": "Low payThe boss was kinda mean"}, "6": {"Date": " Aug 31, 2017", "Summary": "\"Not great experience, but was okay\"", "Pros": "You can get discounts on the food", "Cons": "too many customers in the store"}, "7": {"Date": " Sep 1, 2017", "Summary": "\"Manager\"", "Pros": "Gain lots of real world skills useful beyond the workplace", "Cons": "Scheduling can be incorrect or outside availability"}, "8": {"Date": " Sep 14, 2017", "Summary": "\"Cashier\"", "Pros": "Working for McDonald's has many peeps such as: flexible hours, customer service experience, built multitasking skills/trainings, communication skills, and weekly pay.", "Cons": "Working for McDonald's also has its consequences such as: Colliding shift hours, fast paced environment can cause miscommunication with team and management team, lack of weekly hours not due to availability."}, "9": {"Date": " Sep 14, 2017", "Summary": "\"Former employee\"", "Pros": "Free lunch meal and some great customers", "Cons": "They don't listen to their employees when they need a change for medical reasons"}}