{"0": {"Date": " Mar 16, 2018", "Summary": "\"Team Member\"", "Pros": "Good work environment, nice understandable leaders, etc.", "Cons": "Not enough workers at one time."}, "1": {"Date": " Mar 16, 2018", "Summary": "\"Former Shift Manager\"", "Pros": "It was a great job to have during high school and college and taught me a lot about work ethic and how to work in a fast paced environment.", "Cons": "Very stressful at certain times, but not too bad in the end."}, "2": {"Date": " Mar 17, 2018", "Summary": "\"Pretty good\"", "Pros": "Nice environment and good management and staff.", "Cons": "Smell like Big Mac after work."}, "3": {"Date": " Mar 15, 2018", "Summary": "\"Crew Trainer\"", "Pros": "McDonald's always encourages career development of it employees who take their job seriously and show passion about what they do.", "Cons": "At times, shifts are understaffed and co-workers can be highly unreliable."}, "4": {"Date": " Mar 15, 2018", "Summary": "\"Great for College\"", "Pros": "advancement, training, tuition assistance if at a corp. store.", "Cons": "no appreciation for graduating college/pursuing higher education."}, "5": {"Date": " Mar 15, 2018", "Summary": "\"Working as a Swing Manager is difficult at times yet rewarding work, with an emphasis on interpersonal communication.\"", "Pros": "You're constantly improving your communication and customer service skills and learning new aspects of your job.", "Cons": "It can be stressful working in such a fast-paced environment, but rewarding in the end."}, "6": {"Date": " Mar 16, 2018", "Summary": "\"Employment Records Coordinator\"", "Pros": "People, Time off and benefits cannot be matched anywhere.", "Cons": "Work load at times is heavy"}, "7": {"Date": " Mar 29, 2018", "Summary": "\"Administrative Assistant\"", "Pros": "Benefits are good and leadership team is top notch", "Cons": "Administrative Manager is difficult to work with. Continual contradictions, backstabbing, pitting team member against team member"}, "8": {"Date": " Mar 15, 2018", "Summary": "\"Crew member\"", "Pros": "good service all the time", "Cons": "none at all what so ever"}, "9": {"Date": " Mar 30, 2018", "Summary": "\"Review for McDonald's\"", "Pros": "Good coworkers and everyone has good sense of humor", "Cons": "Powell Wyoming location has no discount for employees our comes or play place for kids."}}