{"0": {"Date": " Jan 22, 2018", "Summary": "\"Mcdonalds\"", "Pros": "Flexible schedules and free food", "Cons": "Always busy, and you wil leave the day smelling bad"}, "1": {"Date": " Jan 6, 2018", "Summary": "\"some wha good\"", "Pros": "Free Food Gives you a rush and see how fas you are", "Cons": "standing on your feet for long periods of time and nasty people"}, "2": {"Date": " Feb 11, 2018", "Summary": "\"Crew member\"", "Pros": "There are none in my opinion. Worst experience of my work life. I will never return to a McDonalds, not even as a customer and will pass along my opinion to others", "Cons": "Overnight was physically demanding and critically understaffed. Very underpaid. Manager didn't give a damn when critical problems arise. She never showed up or even responded. Sanitary measures not followed. People showed up when they felt like it or not at all. No appreciation for hard work. Worst job I've ever had"}, "3": {"Date": " Jan 6, 2018", "Summary": "\"General Manager\"", "Pros": "Great work environment: excellent trainingValued as an employee. Decent benefits and great pay", "Cons": "Stressful due to employees: long hours: worked all weekend"}, "4": {"Date": " Jan 6, 2018", "Summary": "\"Cashier\"", "Pros": "Friendly staff an good place", "Cons": "Mean attitudes an can do better"}, "5": {"Date": " Jan 5, 2018", "Summary": "\"Great First Job\"", "Pros": "Pay, Respectful, Resume Building Is Great", "Cons": "Hours, workload, stressful, smell, bad boss"}, "6": {"Date": " Jan 5, 2018", "Summary": "\"Driving\"", "Pros": "Working to bring the best to The company growth and benefit to explore world wide", "Cons": "To maintain the trust to workers and promote workers motivations with everything needed"}, "7": {"Date": " Jan 20, 2018", "Summary": "\"team member\"", "Pros": "free meals, and free drinks also very easy job", "Cons": "low pay, horrible mangers that only care about their selves"}, "8": {"Date": " Jan 21, 2018", "Summary": "\"Part Time\"", "Pros": "Great job to start working at young", "Cons": "Difficult to deal with customeres"}, "9": {"Date": " Jan 19, 2018", "Summary": "\"a good place to build experience for better employers\"", "Pros": "The work is simple and pay is frequent. they really latch onto you if you are a good employee; they'll give you weekends off if you want and as many shifts as you'd like. less customers come in colder months", "Cons": "Management really makes or breaks your experience here. My first gen. manager was so awful that I was looking to file a complaint with dept. of labor against him but my new manager is good. Same goes with shift managers. I think some of the shift managers are picked just because the slots need to be filled -> they'll just hang out in the back or go down \"to look for something\" while leaving you alone at the storefront. Afternoon shift employees are awful; they don't show up on time at least 70% of the time and you'll have to stay until they come. As with any retail job, customers can be awful but people just suck. Choose a good area to work in and you'll run into less of those kinds of people."}}