{"0": {"Date": " Jun 20, 2016", "Summary": "\"McDonalds\"", "Pros": "You get to have free food. You also get a chance to learn more about the company. You get a chance to become a manager.", "Cons": "Most of the employees are not happy. Not a very good working environment. Very hot atmosphere."}, "1": {"Date": " Jul 4, 2016", "Summary": "\"OK\"", "Pros": "Flexible hours, it's ok for a part time job", "Cons": "Alot of work for little"}, "2": {"Date": " Jul 5, 2016", "Summary": "\"Fry Cook\"", "Pros": "Flexible Schedule, Easy Work, Nice customers", "Cons": "Low Pay, Mean Coworkers, Unclean environment"}, "3": {"Date": " Jun 17, 2016", "Summary": "\"Opinion\"", "Pros": "Great team familyFree drinksThat's about it", "Cons": "Rude customersGhetto managersThe customers stay lyingLow paying rate"}, "4": {"Date": " Jul 25, 2016", "Summary": "\"Manager\"", "Pros": "Free food, good training, great colleagues, great opportunities", "Cons": "Micro managed, low pay, lousy benefits"}, "5": {"Date": " Jul 26, 2016", "Summary": "\"Cashier\"", "Pros": "You get plenty of hours", "Cons": "Managers are very unprofessional and rude"}, "6": {"Date": " Jun 20, 2016", "Summary": "\"Cashier\"", "Pros": "Managers were very nice, and the training was not that complicates. The hours fit into my schedule", "Cons": "Not the best pay in the world, and sometimes customers were not always friendly."}, "7": {"Date": " Jul 3, 2016", "Summary": "\"Treatment on changing availability\"", "Pros": "Easy interview. Discount on food during lunch break. Some people easy to get along with. Flexibility of hours when you're available all the time.", "Cons": "Bus load of customers when you're not proficient with register, hard to hear orders over non stop talking of customers in line/lobby.Was not offered chance to cross train in the cooking/prepping area from cashier position.When availability hours are changed due to relocation/transportation, manager cut my hours to the point of not even enough to make bills."}, "8": {"Date": " Jul 24, 2016", "Summary": "\"Shift manager\"", "Pros": "Built communication skills, necessity for following proper procedures and the proper way to hold a position of authority", "Cons": "Too much unnecessary stress caused by people not the work. You had managers above you who were very hypocritical, showed favoritism for some people, did not properly teach others, and were not qualified for their positions."}, "9": {"Date": " Jul 24, 2016", "Summary": "\"Do not\"", "Pros": "The good thing is that you are working and you are making money but it is not worth the way you are treated", "Cons": "You dont get treated the way you should by managers, sisters should not run a store together."}}