{"0": {"Date": " Jan 5, 2016", "Summary": "\"Cashier\"", "Pros": "Learned people skills, learned how to work with others, learned responsibility, learned how to take athority, learned how to be professional.", "Cons": "The building workers were unprofessional, they cut everybody's check, they where bad at communication, manger showed favertizum to her family,"}, "1": {"Date": " Jan 6, 2016", "Summary": "\"Crew\"", "Pros": "Coworkers was the fun people", "Cons": "No pay raises seem unfair"}, "2": {"Date": " Jan 4, 2016", "Summary": "\"I worked at McDonald's part-time\"", "Pros": "not a stressful job", "Cons": "have to deal with a lot of mean customers"}, "3": {"Date": " Jan 4, 2016", "Summary": "\"cashier\"", "Pros": "friendly employees and environment overall.", "Cons": "Fast pace, always on your toes."}, "4": {"Date": " Jan 4, 2016", "Summary": "\"department manager\"", "Pros": "Fun ppl to work with", "Cons": "Can be stressfull at times"}, "5": {"Date": " Jan 4, 2016", "Summary": "\"cashier\"", "Pros": "it was ok making money doing getting some hours. I guess I could have eaten there", "Cons": "it was a pretty simple task and was definitely boring from time to time"}, "6": {"Date": " Jan 25, 2016", "Summary": "\"Crew Member\"", "Pros": "Getting along well and becoming close with co workers", "Cons": "Super long hoursVery short breaksDiscounts is only for the store you work at and only while your on break."}, "7": {"Date": " Jan 26, 2016", "Summary": "\"Shift Manager\"", "Pros": "it is a lot of fun", "Cons": "it is Mcdonalds so yeah"}, "8": {"Date": " Dec 31, 2015", "Summary": "\"Accountant (corporate)\"", "Pros": "Lots of good people, nice office work environment, green buildings. Individual department management has the freedom to run things as they see fit, some are positive and productive, others are oppressive.", "Cons": "They're hiring lots of new grads and giving them too much power to change processes (to get credit for \"ideas\" however rudimentary and ineffective) without regard for consequences to work flow, controls and productivity. Bullying is rampant."}, "9": {"Date": " Jan 4, 2016", "Summary": "\"interesting\"", "Pros": "meeting very strange people on a regular basis. not much pros to say. I work for mcdonalds, MCDONADLS, mcdonalds.... have a nice day", "Cons": "very bad job. do not work for mcdonalds. DO NOT WORK FOR MCDONALDS. if you ar in california work for in n out!"}}