{"0": {"Date": " Aug 19, 2016", "Summary": "\"working for McDonalds\"", "Pros": "working for mcdonalds provides you with the opportunity to meet new people and to help brighten someone elses day, it provides you with a second family people to always have your back because they all want the same things", "Cons": "not getting enough hours or more vacation time"}, "1": {"Date": " Sep 24, 2016", "Summary": "\"Bad\"", "Pros": "Was a pretty bad place to work can't think of anything good", "Cons": "I will share some of the down sides to working there. Getting up and going to this place come to mind."}, "2": {"Date": " Sep 24, 2016", "Summary": "\"not worth it\"", "Pros": "relationships and bonds with other employees, table service, relationships with customers, meeting new people, learning new things", "Cons": "lack of training, special treatment of certain employees, the pay, the way managers speak to employees, there was not a lot of teamwork"}, "3": {"Date": " Sep 4, 2016", "Summary": "\"Cashier\"", "Pros": "New people to work with.", "Cons": "Barely get any hours. When there's plenty of people there still get shifted around to do other stuff."}, "4": {"Date": " Aug 19, 2016", "Summary": "\"Crew member review\"", "Pros": "nice people, good boss, easy to move up, good hours", "Cons": "customers were annoying, my wife hated the long hours, made a poor salary"}, "5": {"Date": " Sep 2, 2016", "Summary": "\"ok\"", "Pros": "Easy, cool workers from my location.", "Cons": "Customers can be a bit rude but that's normal for a fast food industry."}, "6": {"Date": " Aug 18, 2016", "Summary": "\"united as a family\"", "Pros": "if you are a good worker you can get a raise quickly and be given time off when needed or cant come in.....you can be allowed to work overtime if needed and if you contribute instead of taking up space at work", "Cons": "having to work past your scheduled shift because others don't show up or there is no one scheduled to relieve you"}, "7": {"Date": " Aug 18, 2016", "Summary": "\"Awesome Staff!\"", "Pros": "Friendly staff, helpful, clean, safe", "Cons": "Nothing but good reviews here."}, "8": {"Date": " Sep 23, 2016", "Summary": "\"Crew trainer\"", "Pros": "Making customers happy , steady pace", "Cons": "Can get very stressful when really busy and short handed"}, "9": {"Date": " Sep 1, 2016", "Summary": "\"Cashier/crew member\"", "Pros": "Flexible shedulingGood 1st jobMeeting all customersManagers were good.Gained experience handling money and working fast paced", "Cons": "mostly HS student always asked for someone to cover their shift."}}