{"0": {"Date": " May 7, 2017", "Summary": "\"Fast paced work environment, always a new challenge every day.\"", "Pros": "High potential for advancement in the company. Unlimited relocation opportunities throughout the U.S. and worldwide. Performance based bonuses are earned quarterly.", "Cons": "The quality of new employees is sometimes lacking. Negative perception about the company. Sometimes you will work holidays and late night shifts."}, "1": {"Date": " May 7, 2017", "Summary": "\"McDonald's Crew Member Review\"", "Pros": "Hours are consistent and the pay is adequate for the work.", "Cons": "You usually have to work full time at this location. If you are looking for very little hours, for part time, purposes this is not the place for you."}, "2": {"Date": " May 7, 2017", "Summary": "\"McDonald's\"", "Pros": "The were flexible and I got the hours I requested.", "Cons": "I worked the night shift, but it was not as bad as I anticipated."}, "3": {"Date": " May 7, 2017", "Summary": "\"My Review Title\"", "Pros": "Fun Professional Funny People Exciting Electric", "Cons": "Difficult CUSTOMER SERVICE Humans hours moneys"}, "4": {"Date": " May 7, 2017", "Summary": "\"Crew Trainer\"", "Pros": "I learned a lot of team management through out the training process", "Cons": "Long hours are involved."}, "5": {"Date": " May 7, 2017", "Summary": "\"Great\"", "Pros": "Good experience for first time job", "Cons": "Management could be annoying, but in the end they are in charge"}, "6": {"Date": " May 22, 2017", "Summary": "\"Okay\"", "Pros": "Some coworkers are great and become your friends and you get to work in the iconic arches", "Cons": "Not enough pay, the pay is not the best for the amount of work done and some customers are rude."}, "7": {"Date": " May 22, 2017", "Summary": "\"Departament manager\"", "Pros": "We work 40 hour or more weekly", "Cons": "They dont paid maternity and no benefits"}, "8": {"Date": " May 6, 2017", "Summary": "\"Worked there before\"", "Pros": "Great people to work for, and serve. You usually will get good hours, because they are always so busy.", "Cons": "McDonald's is always so busy, so you'll never have a slow day."}, "9": {"Date": " Jun 11, 2017", "Summary": "\"Disorganized\"", "Pros": "There is free food and a higher than minimum starting wage", "Cons": "The managers where I worked were incompetent, never returned calls, and at times were outright mean to employees for the fun of it."}}