{"0": {"Date": " Jan 18, 2018", "Summary": "\"Not bad\"", "Pros": "The coworkers are very nice", "Cons": "Management isn't always so nice"}, "1": {"Date": " Jan 19, 2018", "Summary": "\"Maintenance\"", "Pros": "Good coworkers and decent hrs", "Cons": "Expanding employee hrs and pay rates"}, "2": {"Date": " Jan 19, 2018", "Summary": "\"Drive thru\"", "Pros": "management made me feel like I was part of the team", "Cons": "the hours could have been better"}, "3": {"Date": " Feb 2, 2018", "Summary": "\"get what you ask for\"", "Pros": "The student benefits really help while in school.", "Cons": "Hours can run late sometimes which can affect hours of sleep."}, "4": {"Date": " Feb 2, 2018", "Summary": "\"McDonald's\"", "Pros": "The job is easy and you recieve free food on your lunch break", "Cons": "Not getting enough hours in"}, "5": {"Date": " Jan 17, 2018", "Summary": "\"Crew Trainer\"", "Pros": "Amazing with customers , loves to treat everyone with a great smile, enjoys her job with great affection.", "Cons": "No cons . No bad side, theres nothing wrong with Ruta. Shes been amazing."}, "6": {"Date": " Jan 17, 2018", "Summary": "\"clerk\"", "Pros": "Management is friendly. Free food", "Cons": "Cant think of any right now"}, "7": {"Date": " Jan 18, 2018", "Summary": "\"Founder\"", "Pros": "It is good company for work", "Cons": "No complaints so far til now"}, "8": {"Date": " Feb 22, 2018", "Summary": "\"Cook, dishwasher and unloaded the delivery truck for many years\"", "Pros": "It was a paycheck that's all!", "Cons": "After 21 YEARS of employment my brother was let go of McDoanld's. The reason..because they are going in a different direction and they don't think he is a good fit. And they are very concerned about his health. They are worried he wont be able to handle the \"new expectations.\" Isnt that up to him to decide? Are they judging him due to diabilities?!?! He had a set back in the fall but was released with no restrictions and could get back to work the day after released!! He took a week off anyway then right back at it again. He has given up days off, took lots of crap, stayed there til 4am, put his blood, sweat and tears into that place only to be left go. Shawn is a kind, sweet, giving guy who would literally give you his last dollar. McDonald's of Pottstown you should be ashamed!!!! You will not get one more penny of me or my family's money. I advise you all to rethink your next trip as well. They clearly are not about people..but about the money."}, "9": {"Date": " Feb 1, 2018", "Summary": "\"If you gotta\"", "Pros": "You'll love it, if you need the money.", "Cons": "greasy hair, rude customers, fry smell"}}