{"0": {"Date": " Jan 6, 2016", "Summary": "\"Meh\"", "Pros": "Free food and drink, cool coworkers in general, good part time job while in school.", "Cons": "Awful pay, in general dead end, some coworkers have no desire to work so others have to pick up slack."}, "1": {"Date": " Jan 6, 2016", "Summary": "\"Eh\"", "Pros": "Friendly co-workersIt was moneyNice uniform", "Cons": "Kind of a gross jobConfusingPoor training"}, "2": {"Date": " Jan 7, 2016", "Summary": "\"It's called McHell for a reason.\"", "Pros": "Desperation to make money. Some locations have great Co workers and that helps a lot too. Some management is really chill and professional at the same time while being genuine. That's special.", "Cons": "Many of the managers and customers treat you like crap even if you are doing what you were told by your managers and whatever went wrong wasn't your fault at all. People suck."}, "3": {"Date": " Jan 7, 2016", "Summary": "\"McDonalds really doesn't care about their employee.\"", "Pros": "You get paid a little more than minimum wage. Sometimes you can make friends there. You learn to respect fast food workers more because sometimes the mistakes really aren't their fault.", "Cons": "I was pregnant when working there and the female managers didn't care when I told them I couldn't lift heavy boxes and tried to make me do it anyway. I passed out at work at one point and they told me if I ever felt like that again to tell them so I don't get hurt but when I did feel like that they ignored it had me continue to stand."}, "4": {"Date": " Jan 5, 2016", "Summary": "\"Depends on the owner operator\"", "Pros": "Fast paced workplace. Opportunity to grow with in the company. No degrees required.", "Cons": "In some cases low pay with high expectations. Have to find the right owner operator who values their employees."}, "5": {"Date": " Jan 5, 2016", "Summary": "\"Mickey D's\"", "Pros": "Free lunch, great coworkers, ok hours, downtown location", "Cons": "Management, rude customers, gossiping coworkers, huge crowds during festivals & concerts"}, "6": {"Date": " Jan 5, 2016", "Summary": "\"Crew Member\"", "Pros": "Flexible work scheduleGood first jobGreat for improving your customer service skills", "Cons": "Gets really busy"}, "7": {"Date": " Jan 5, 2016", "Summary": "\"Good\"", "Pros": "Nice people to work With.", "Cons": "Upper Management did have much care."}, "8": {"Date": " Jan 26, 2016", "Summary": "\"hated every mintue\"", "Pros": "nothing at all is great about this job", "Cons": "the entire job is terrible and the people working there are even worse"}, "9": {"Date": " Jan 26, 2016", "Summary": "\"Cashier\"", "Pros": "They give you lots of hours", "Cons": "Bad management/bad employees to work with"}}