{"0": {"Date": " Nov 16, 2016", "Summary": "\"counter\"", "Pros": "Flexible hours. Great management. Fun", "Cons": "Can be challenging during peek hours. Very busy"}, "1": {"Date": " Nov 16, 2016", "Summary": "\"McDonalds\"", "Pros": "Its a good to start with and make some money and helps you to communicate to your team and others.", "Cons": "Its not a good job to be there forever and waste your time with the less and less hours im getting im suppose to support my single mom and with the income in our small house."}, "2": {"Date": " Nov 17, 2016", "Summary": "\"It was an okay environment but not enough hours\"", "Pros": "Easy job , great employees", "Cons": "Bad management , terrible GM"}, "3": {"Date": " Nov 2, 2016", "Summary": "\"how much do i make\"", "Pros": "i like the team work and team compatibility", "Cons": "i dont like the way the food is sey up and the way we have to make it"}, "4": {"Date": " Nov 16, 2016", "Summary": "\"Review\"", "Pros": "I love meeting new people. At McDonald's you meet new people every day. The customer that return become a part of the McDonald's family. I serve the very young, the young adult, families, the mature, to the precious elders. I see people who set up their computer and get some word down while enjoying a meal or interact with the social media. I see families come in to share a meal together after running errands or on their way to some place. We even have young adults come in to play card games while enjoying a snack. It is amazing being a brief part of their lives and they a brief part of our lives. I have met some amazing people as team mates as well. Those who work together to not just accomplish a job but to push themselves to excel towards excellence.", "Cons": "Customer Service is the building block of any business. McDonald's had the opportunity to train so many young people who are stepping into the job market for the first time. I do not feel McDonald's is successful in this area. They have an opportunity to build team work and I do not feel they are successful here either."}, "5": {"Date": " Nov 17, 2016", "Summary": "\"trainer\"", "Pros": "food to employees. good job for a student", "Cons": "bad management and sexual harassment from management"}, "6": {"Date": " Nov 1, 2016", "Summary": "\"Cashier\"", "Pros": "Easy to grasp once you get going", "Cons": "rude customers, money, standing alot"}, "7": {"Date": " Nov 15, 2016", "Summary": "\"Cashier\"", "Pros": "Entry level job hardly any experience", "Cons": "Mediocre benefits little opportunities to move up"}, "8": {"Date": " Nov 15, 2016", "Summary": "\"Manager\"", "Pros": "Feel empowerd and able to manage", "Cons": "Hard to move up through company"}, "9": {"Date": " Nov 16, 2016", "Summary": "\"Crew\"", "Pros": "Free food on breaks", "Cons": "Only getting to work two days out the week because their over staffed"}}