{"0": {"Date": " Sep 7, 2016", "Summary": "\"Cashier\"", "Pros": "They will always work around your school schedule. So if you want to work full and go to school first time it is a great place to work.", "Cons": "They do pay minimum wage, Some of the management isn't very good. They get the position out of seniority it feels like."}, "1": {"Date": " Sep 7, 2016", "Summary": "\"Eh\"", "Pros": "Free foodMaking new friendsThey'll work with your schedule", "Cons": "Management is all over the placeSchedule is inconsistentUnderstaffed"}, "2": {"Date": " Sep 8, 2016", "Summary": "\"It wasn't that bad.\"", "Pros": "Easy work easy pay, everything is simple and not hard to learn. Working in the front is not hard at all as long as you can count.", "Cons": "The worst part of working with people is having to keep a smile on your face when dealing with rude customers."}, "3": {"Date": " Sep 8, 2016", "Summary": "\"Crew Member\"", "Pros": "Friendly, great people to work for", "Cons": "The organization behind the counter is disorganized"}, "4": {"Date": " Sep 28, 2016", "Summary": "\"Horrible\"", "Pros": "Flexibility with hours, nothing else", "Cons": "No respect for employees, breaks within 1 hour of shift ending, minors work overtime"}, "5": {"Date": " Sep 7, 2016", "Summary": "\"Poor management incentives\"", "Pros": "Customers and building relationships on a daily basis. Teaching and training.", "Cons": "Broken promises for training and advancements."}, "6": {"Date": " Sep 7, 2016", "Summary": "\"Great Company with Poor Representation\"", "Pros": "Great Training program!! Mcdonalds has an overall great mission,vision, and history.", "Cons": "Low labor budget, which leaves the 20% employee exhausted and overwhelmed."}, "7": {"Date": " Aug 23, 2016", "Summary": "\"It's ok\"", "Pros": "Nice people in the workplaceCan be fun at timesAlways have something to do", "Cons": "Can be boring at timesDealing with rude customers is difficultVery difficult to always keep a positive attitude"}, "8": {"Date": " Aug 23, 2016", "Summary": "\"Cook\"", "Pros": "Pay money crew check Mcdonalds", "Cons": "Stand all day short breaks"}, "9": {"Date": " Aug 23, 2016", "Summary": "\"Not terrible\"", "Pros": "Good starter company. Helps with school. Flexible hours. Part time or full time positions. Discount food and it actually tastes good if you make it yourself.", "Cons": "Pay is not the greatest but what do you expect? I mean it is McDonald's. Some of the other people that work there are lazy."}}