{"0": {"Date": " Sep 12, 2016", "Summary": "\"Decent first job\"", "Pros": "Free (limited items) food for mealsMeet new friends of all agesTons of hours = great paychecksSometimes customers give you a tipThere are some nice people in this worldSometimes funny things happen--like old men flirting with you xDYou can get a scholarship", "Cons": "Rude customersRude co-workers. (If there's certain co-workers that annoy you it'll suck because NO ONE WILL FIRE THEM)Critical managementCattinessDiscountsYour availability is \"flexible\" for THEM. Not YOU.Customers think you practically live thereTeenagers on afternoon shiftsHaving to pay for dumb mess like baconThings breaking down all the timeThe smell"}, "1": {"Date": " Sep 12, 2016", "Summary": "\"McDonald's\"", "Pros": "good place to start a first job and start to gain skills dealing with other peoplelearn how to develop cash handling skills", "Cons": "the grease in the back smells really badsome of the customers could be very particular on their food"}, "2": {"Date": " Sep 13, 2016", "Summary": "\"Free Lance Burger Flipper\"", "Pros": "Foods aight. 350k salary word word", "Cons": "Didn't pay that much word word word"}, "3": {"Date": " Aug 28, 2016", "Summary": "\"Crew Member\"", "Pros": "good job, worked with your hours!!", "Cons": "People do not respect you"}, "4": {"Date": " Oct 3, 2016", "Summary": "\"Fry Guy\"", "Pros": "Free fries if working the fryer", "Cons": "Working at McDonalds is not a good pick-up line"}, "5": {"Date": " Oct 3, 2016", "Summary": "\"Cashiers\"", "Pros": "Great job to gain work experience. Free food", "Cons": "The managers and dealing with rude customers for little pay."}, "6": {"Date": " Oct 4, 2016", "Summary": "\"The worst work environment I've ever encountered\"", "Pros": "A couple of people try to put a smile on my face. A few other people give me respect.", "Cons": "A good portion of co-workers are unprofessional, rude, and ignorant. When they were asked to change behavior, they just mocked me the entire shift. When I'm present at work, they slander me as though I'm invisible and don't have ears. First 2 weeks they were contemplating or very sure that I am mentally retarded or that I'm a drug addict. If I was smoking pot because of how quiet (and antisocial) or that I'm stupid. Now it's \"She's mentally ill.\" Truth be told, I've suffer from bipolar with severe depression and not medicated. So it does hinder my work, but, it doesn't help that I'm very uncomfortable in my environment. Especially since it seems that the work place is a huge social clique and lacks diversity (a.k.a same herd of cows.) Work environment is discouraging, unprofessional, and depressing. A good majority of the time you hear them complaining about either work or personal lives. Especially those that are new to the job. They really put them down. You'll also hear them complain if you're doing your job correctly. Why? Because your setting a standard that they do not want to put forth the extra time into. I've heard them complain about how I was wiping down the chairs, sweeping the floors, and scrubbing the vats too long (which btw is 10 min to scrub each vat; they do it in a couple min). The store is very dirty and worn down because of their lack of effort. (Do you dare look underneath the dining tables?!) They use that effort to converse with each other rather than to pick up a rag and clean.Training in grill area is inadequate and can be confusing because of conflicting views on how to do things. Training up front is better though. I've learned more up front than in grill area. Just to throw extra bits to this in here, within the past few months, 6 people have quit that job. The workplace has a problem with people snooping through others' phones and/or steal stuff from their wallets/purse. I haven't had anything stolen but I have overheard coworkers talking about the contents in my phone. She went so far as to log in my Game of War and shared my username with another coworker."}, "7": {"Date": " Sep 12, 2016", "Summary": "\"No surprise here.\"", "Pros": "Decent first job, I guess.", "Cons": "It's exactly as exhausting and repetitive as you'd think."}, "8": {"Date": " Sep 12, 2016", "Summary": "\"Poor pay, but as many hours as you want\"", "Pros": "Easy to move upAlways hiring, always begging you to work more hours", "Cons": "Will take advantage of your availabilityDo anything they can to avoid giving you more than a 5 cent raise per year"}, "9": {"Date": " Sep 11, 2016", "Summary": "\"not a bad place\"", "Pros": "It was easy to learn and got off when suppose to. Co-workers who would be nice", "Cons": "Not enough hours. angry customers people who thought you were nothing burger flipper working overnight in 24 hour open store."}}