{"0": {"Date": " Aug 29, 2017", "Summary": "\"Cashier\"", "Pros": "Good first job to encourage hard work, discipline, time management and to get an education.", "Cons": "Hours, Minimum Wage, Constant Changing Management"}, "1": {"Date": " Aug 14, 2017", "Summary": "\"Great Job!!!\"", "Pros": "Great!!! Benefits for employees awesome", "Cons": "bad customer service at times"}, "2": {"Date": " Aug 28, 2017", "Summary": "\"Cashier/Order Taker\"", "Pros": "Free lunch for break and really close to my school", "Cons": "The management was sloppy and never had anything under control, especially when it came time for shifts"}, "3": {"Date": " Aug 28, 2017", "Summary": "\"Cashier\"", "Pros": "If you are willing to learn, and hard working you can be easily promoted. You also get a free meal,everyday you work.", "Cons": "Management affects how your work experience is, but that's the same anywhere."}, "4": {"Date": " Aug 29, 2017", "Summary": "\"Humbling Experience\"", "Pros": "Flexible work scheduleFree FoodConstantly Busy", "Cons": "Horrible turnover rate, even among management. I went through 6 different GMs in 2 years of working here"}, "5": {"Date": " Aug 13, 2017", "Summary": "\"Mcdonalds\"", "Pros": "You get a lot of hours", "Cons": "Employees dont always show up for work"}, "6": {"Date": " Sep 18, 2017", "Summary": "\"Don't work here\"", "Pros": "I can't think of any pros.", "Cons": "The job and company as a whole is terrible."}, "7": {"Date": " Sep 18, 2017", "Summary": "\"Horrible job\"", "Pros": "Great people (sometimes), fun place to work (sometimes), lunch and uniform is supplied, easy work", "Cons": "Nine hour shifts with only one half hour break for your meal.Let that sink in. In a normal restaurant, you get more breaks for more time plus tips. Here, maybe because the work is so simple (yeah you can do more secondary jobs if you want to help out more), you're expected to go a whole nine hours with only one break. And that break is TINY. Now I've worked restaurants before, but this is my first fast food restaurant where I'm expected to work such a long period of time without being able to get water on my own. Here, you have to ask permission for a \"courtesy cup\". Which sounds like a privilege when it should be more of a right. You have to greet each and every customer (if working at a register of course) with \"Hello, my name is ____! How can I help you?\" so it's hard not to get a dry throat after the nth customer.People need to get permission for everything. Clock in. Bathroom (you also need to give a reason). Water (\"courtesy cups\"). Bathroom. Customer using the same card twice. Checking a $50/$100 bill. Clock out. Breathe. Fart. Blink. Wow. Mcdonald's has gotten everything covered to the most minuscule detail just so they can squeeze as much as they can out of their workers without expecting any uprising because of all the courtesies they've so gracefully given to their staff.It's actually really impressive on McDonald's part, but I'm sorry. I couldn't buy into it. Hard work? Not really, but get ready to be more tired in one day than a whole week at a regular restaurant. Because you're not really working.. you're being exploited.Did I mention the pay is also shit? \"Well, it's McDonald's. What do you expect?\" This mentality needs to stop. Well, the people who work there are PEOPLE. The people who eat there are PEOPLE. If this is your first job and you have very low expectations and don't mind being worked like a mule, go ahead. Ask for the courtesy cup. Give your reason to be able to go to the bathroom.This job is for those who always asked this question in school: \"Why do I have to be here every day? I don't get paid.\"Here's your answer. In school, you get an education that gives you leeway to higher education which gives you a shot at a career. You just want to get paid? Well at McDonald's you can get paid for coming. It's just like you were in school. Ask to go to the bathroom. Ask to go to the water fountain. Ask for everything. But is that really how you want to live your life?"}, "8": {"Date": " Sep 19, 2017", "Summary": "\"Terrible Coorporation\"", "Pros": "Nothing about this business is a pro", "Cons": "Never get to advance even though you're a \"Manager in Training\"they will switch owners and change every bit of your work ethic.if you dont dedicate your life to mcdonalds you arent worth the time.just a terrible business all around"}, "9": {"Date": " Aug 27, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Some great people who value the customers and want to not be the stereotypical employee", "Cons": "Some people just dont want to work there but are forced to by there parents."}}