{"0": {"Date": " Sep 20, 2016", "Summary": "\"Need the 12 month access\"", "Pros": "Pretty good experience for those (mainly teens) who have never experienced a real job and want to have a taste of what work is like. Also a good starting resume builder for teens and young adults.", "Cons": "Hours can be pretty bad and work can be hectic."}, "1": {"Date": " Sep 20, 2016", "Summary": "\"Good people bad politics\"", "Pros": "Great people, Free food and drinks which to a guy in he's late teens was highly worth it.", "Cons": "The politics and low pay for managers and crew alike leads to high turnover rates."}, "2": {"Date": " Sep 4, 2016", "Summary": "\"Fun place\"", "Pros": "Everyone is super nice and exciting", "Cons": "Teenage drama can be an issue"}, "3": {"Date": " Oct 10, 2016", "Summary": "\"At least its a job\"", "Pros": "Fast paced, no time to stand around and be bored.", "Cons": "Customers will almost always be rude, you're almost always understaffed, and its always your fault the food doesn't come out fast enough."}, "4": {"Date": " Oct 11, 2016", "Summary": "\"Shift manager\"", "Pros": "The pay, the potential growth", "Cons": "Never do anything right, hate everyone"}, "5": {"Date": " Sep 19, 2016", "Summary": "\"working at mc donalds\"", "Pros": "They have flexabil. Scheduling. You get great training and benefits.if you work full time you get a free meal for your launch.", "Cons": "They pay isn't all that great. If you want to smell like grease and fried food this is the job for you"}, "6": {"Date": " Sep 19, 2016", "Summary": "\"Pretty good starter\"", "Pros": "Pretty good starting job for most people. Show up, do what you're told and you will make it.", "Cons": "Pay is pretty terrible, and management can be a little overbearing sometimes"}, "7": {"Date": " Sep 19, 2016", "Summary": "\"Customer Service\"", "Pros": "Opportunity to meet varies people", "Cons": "Starting rate is too low (7.25/hr). High turnover of employees."}, "8": {"Date": " Sep 19, 2016", "Summary": "\"Cashier\"", "Pros": "The only good thing is that you get to meet people. Your co workers become your family. Which is good sometimes.", "Cons": "A lot of them. Bad pay. Some customers don't make it easy for you. They get mad when prices go up and they blame you as if you owned the store."}, "9": {"Date": " Sep 20, 2016", "Summary": "\"Fast Food Sucks\"", "Pros": "Flexible hours, Free Food on Lunch Break", "Cons": "Stressful management, annoying customers, exhausting workload, no raise"}}