{"0": {"Date": " Nov 26, 2017", "Summary": "\"Crew Member\"", "Pros": "Managers and employees are very helpful in teaching you how to work for the company. Just ask anyone for help and they are there for you helping you.", "Cons": "The person in charge of employee's hours do not do a very good job. We are mostly under staff most of the time, or we have way to many employees per shift which is rare. I usually have to do two to three stations alone. Sometimes I dont even get my break to relax and refuel myself."}, "1": {"Date": " Nov 26, 2017", "Summary": "\"best first job\"", "Pros": "perfect first job if you're looking for something to do part-time as a student", "Cons": "not the greatest place to be at if you're not consistent and keep working there."}, "2": {"Date": " Nov 26, 2017", "Summary": "\"A good first job\"", "Pros": "Flexible HoursQuick to LearnFriendly StaffGenerally Friendly Customers", "Cons": "Technology going down oftenAngry CustomersLow Pay"}, "3": {"Date": " Dec 10, 2017", "Summary": "\"Skills\"", "Pros": "Potential to develop different skills", "Cons": "Standing challenges for lengthy time"}, "4": {"Date": " Dec 11, 2017", "Summary": "\"Review\"", "Pros": "you get free food at worj", "Cons": "Long hours you have to work"}, "5": {"Date": " Dec 11, 2017", "Summary": "\"Pretty good place\"", "Pros": "Food can be delicious, although the hours can get short, they provide you your own debit card which i highly like.", "Cons": "Hours Can get pretty short. Busy times."}, "6": {"Date": " Dec 10, 2017", "Summary": "\"Good people, bad management\"", "Pros": "The people I worked with were great and made me feel very welcome, did their best to help me through my training period and were very patient", "Cons": "The managers don’t work with your schedule, and were very rude to employees"}, "7": {"Date": " Nov 24, 2017", "Summary": "\"I love McDonald's\"", "Pros": "I love to help others I really appreciate that the youth appreciate me more because that's who it's all about.", "Cons": "Possibly when it becomes rush hour and we might fall off tasks but we are a team so we pick up each other's slack."}, "8": {"Date": " Nov 24, 2017", "Summary": "\"It's a part time job\"", "Pros": "It's good for a kid to earn extra money", "Cons": "People who expect more than minimum wage"}, "9": {"Date": " Nov 24, 2017", "Summary": "\"Great place to work.\"", "Pros": "Flexible schedules, good team development.", "Cons": "None at the moment."}}