{"0": {"Date": " Dec 17, 2015", "Summary": "\"McDonalds job review\"", "Pros": "The pros of this job are that they allow for flexible schedules and free employee meals.", "Cons": "The cons of this job are the work is frustrating and its a fast pace environment."}, "1": {"Date": " Dec 18, 2015", "Summary": "\"Awesome\"", "Pros": "Awesome place to work for if you're a student or individual seeking a part-time/supplemental income. The hours were flexible for me.", "Cons": "I can not say too many bad things about this company. The benefits were legit for part-time, though I never had to use them for anything major."}, "2": {"Date": " Dec 3, 2015", "Summary": "\"Mcdonalds facts\"", "Pros": "They have flexible hours and it's easy work.", "Cons": "Rushes can suck if you're not experienced."}, "3": {"Date": " Jan 7, 2016", "Summary": "\"Okay for first job.\"", "Pros": "One of the few good things about working for this company is flexible hours. Also, most coworkers are pretty chill.", "Cons": "Stress level is off the roof. Management expects unrealistic demands. Also, lousy pay for the amount of work you put in."}, "4": {"Date": " Jan 7, 2016", "Summary": "\"lab\"", "Pros": "hours are the best part", "Cons": "pay is the worst part"}, "5": {"Date": " Jan 7, 2016", "Summary": "\"Shift Manager\"", "Pros": "Customers, working with new hires, helping them find their place at McDonald.", "Cons": "Owners, upper management only care about themselves. And too much is based on if you are liked are not. When it should be based on the ability to get the job done."}, "6": {"Date": " Jan 7, 2016", "Summary": "\"Trainer\"", "Pros": "Fast money, great food, folks, and fun", "Cons": "No quality of life, favoritism, loss integrity"}, "7": {"Date": " Dec 17, 2015", "Summary": "\"worst\"", "Pros": "Fun,good people to work with", "Cons": "Hard work for low pay"}, "8": {"Date": " Dec 17, 2015", "Summary": "\"Ehh\"", "Pros": "Decent first job. I made my own money for once.", "Cons": "Rude managers. Rude customers."}, "9": {"Date": " Jan 7, 2016", "Summary": "\"Honest Mc'Donalds Review\"", "Pros": "Good for short-term employment, good to learn experience and possible job advanced placement with the right restaurant. Very flexible when it comes to personal life at least for me I never had a problem with needing time off if it is deserved.", "Cons": "Poor management, training intake was very poor not thorough or what you would expect to learn each job."}}