{"0": {"Date": " Feb 19, 2016", "Summary": "\"Anonymous\"", "Pros": "Excellent culture. The people are super laid back with a mix of old and young people. Flexible hours if you're in the right group. Great work/life balance. Ability to move laterally.", "Cons": "There were certain managers that had pretty bad reputations that caused people to leave the company. Though it was well known, nothing was done to prevent the managers from causing more brilliant talent from leaving the company.Also, top management lied a lot. For instance, in 2015, the company announced \"There are rumors that we are moving our HQ to Chicago. These rumors are not true. We are only thinking of putting the new digital team there.\" Then come 2016, they announce \"We are considering moving our HQ downtown.\" Do you know how many McDonald's lifers are at this company? There are a ton of people who moved their families close to Oakbrook for this job. Only the young folks are excited about this potential move. Maybe that's their plan...They had great work/life balance but it came with lower than market pay.There was an insane amount of turnover during the two years I was there. No job security.The last thing is it's nearly impossible to move up. In fact, I knew some people that remained the \"senior\" level for over 30 years and they gave up with trying to move up."}, "1": {"Date": " Mar 10, 2016", "Summary": "\"Crew trainer\"", "Pros": "- Free food- Easy tasks", "Cons": "-Lacks ethics-Unprofessional-Long hours with no breaks-Apply elsewhere!!!"}, "2": {"Date": " Feb 24, 2016", "Summary": "\"Not bad\"", "Pros": "Good payGood hoursGreat benefitsFun place to workQuick payingFor the most part easy jobGood management", "Cons": "The only real con it that the job can get monotonous. Most people do the same thing every day."}, "3": {"Date": " Mar 9, 2016", "Summary": "\"Crew Member\"", "Pros": "Some good things that I picked up while working at McDonald's were free uniforms, discount on food, and learning how to work properly. The team work was decent.", "Cons": "There are some things that are better observed."}, "4": {"Date": " Mar 10, 2016", "Summary": "\"Project Leader\"", "Pros": "excellent work life balance , excellent diversity & inclusion programs", "Cons": "management, leadership, layoffs could use some improvements"}, "5": {"Date": " Mar 10, 2016", "Summary": "\"Not terrible.\"", "Pros": "Once you got to know your mangers and crew and what to expect you were pretty much golden.", "Cons": "People were always calling in. It can be busy. You get rude customers, and you can never do anything right."}, "6": {"Date": " Mar 30, 2016", "Summary": "\"crew member\"", "Pros": "the lack of work and is an aid for college", "Cons": "few hours of work, very demanding and little companionship"}, "7": {"Date": " Mar 9, 2016", "Summary": "\"crew member\"", "Pros": "schedule flexibility was a good thing", "Cons": "stress crazy, horrible days and rude customers"}, "8": {"Date": " Mar 10, 2016", "Summary": "\"Crew member\"", "Pros": "Extra hours if your lucky", "Cons": "Mostly just cut hours, broken machines, and angry customers."}, "9": {"Date": " Feb 23, 2016", "Summary": "\"Good First Job\"", "Pros": "Incredibly friendly co-workers. I was never judged when asking for help from them. Management had control during afternoon rushes and were familiar with the busiest hours and brought in staff accordingly.", "Cons": "The \"Crew Member\" position is disorganized in comparison to a lot of other fast food restaurants. As a crew member you're responsible for managing 75% of the restaurant, and it's very difficult to train for every task you'll be doing."}}