{"0": {"Date": " Oct 14, 2017", "Summary": "\"Easy job, weird hours okay\"", "Pros": "Easy job except for dumb customers", "Cons": "The dumb customers and not great pay"}, "1": {"Date": " Oct 14, 2017", "Summary": "\"Eh\"", "Pros": "Flexible hours, cool people, free food", "Cons": "No rewards, no incentives, and the customers"}, "2": {"Date": " Sep 28, 2017", "Summary": "\"Cashier\"", "Pros": "Flexible schedule. Good hours. Opportunities for a higher position.", "Cons": "I really like it there I have nothing bad to say."}, "3": {"Date": " Sep 28, 2017", "Summary": "\"Burger flipping fry shaker\"", "Pros": "Wakes you from the dead at 1 o'clock in the morning with the sense of urgency to take a unpoopable dookie", "Cons": "You wake up still alive"}, "4": {"Date": " Sep 29, 2017", "Summary": "\"Great Place to Work\"", "Pros": "Raises, work with great people, always room for promotions.", "Cons": "Sometimes work past your shift, sometimes don't get a break, depending on who the shift Manager is you won't get all your hours, they can send you home after only working two hours of business is slow."}, "5": {"Date": " Nov 3, 2017", "Summary": "\"Terrible\"", "Pros": "It paid you weekly and free food.", "Cons": "The hours were unreasonable and too much work."}, "6": {"Date": " Oct 13, 2017", "Summary": "\"High School Job\"", "Pros": "Hire young people with no experience, obtain work history, difficult start", "Cons": "low pay, no employee discount, work just shy of full time."}, "7": {"Date": " Sep 28, 2017", "Summary": "\"Great as a Teenager but if you're an overachiever then they'll overwork you\"", "Pros": "If they like you you'll get a lot of hours (though still be part time because you were \"Scheduled\" for 38 even if you worked 46)Job ExperienceCoworkers were nice and some sense of community", "Cons": "Low Pay and Fast paced environment - really high stress if you care about giving the best service, for those who don't care so much they seem to do really great there."}, "8": {"Date": " Sep 28, 2017", "Summary": "\"wasn’t bad, but wasn’t necessary wonderful.\"", "Pros": "The fries there are always truly a blessing. plus getting to eat the food is amazing. always love doing that.", "Cons": "smell of mcdonald’s fries being ruined seems to happen after you work there for a while. be warned cause i loved their fries."}, "9": {"Date": " Sep 29, 2017", "Summary": "\"Lots of work\"", "Pros": "Funny work place interesting people", "Cons": "Lots of work in a hot place"}}