{"0": {"Date": " Aug 2, 2016", "Summary": "\"Need Information on GD\"", "Pros": "Good food and smells and stuff", "Cons": "Too many people and stuff"}, "1": {"Date": " Aug 2, 2016", "Summary": "\"Alright\"", "Pros": "Fun coworkers, Decent hours, paid on time.", "Cons": "Some stupid coworkers who literally wouldn't follow rules, and some management who wouldn't enforce."}, "2": {"Date": " Aug 15, 2016", "Summary": "\"Floor supervisor\"", "Pros": "They have opportunitys to move up and the benefits plus open availability", "Cons": "They have been taking vacation time and bonuses away after just recently giving them to us"}, "3": {"Date": " Aug 1, 2016", "Summary": "\"Cashier\"", "Pros": "Great food with great benefits nice employees", "Cons": "Bad pay don't work here all your life"}, "4": {"Date": " Sep 5, 2016", "Summary": "\"Shift Manager\"", "Pros": "Good first job to have when your still in school.", "Cons": "Management does not treat their employees with respect."}, "5": {"Date": " Sep 5, 2016", "Summary": "\"Help needed\"", "Pros": "The other employees here are nice.", "Cons": "Not much room for advancement. Getting a raise is a rarity.Typically overworked, and no incentives are offered."}, "6": {"Date": " Sep 5, 2016", "Summary": "\"Poor Work Environment\"", "Pros": "The hours of McDonald's locations are flexible and can be tailored to many lifestyles and availability preferences.", "Cons": "Work ethic of subordinates failed to meet even sub-par standards, poor upper management conflict resolution skills, poor time management of higher level supervisors."}, "7": {"Date": " Sep 5, 2016", "Summary": "\"Horrible place to work\"", "Pros": "Half off of anything not on the dollar menu, free food if you came in early/stay late (which was usually every day because people were always calling out or not showing up with no repercussions), on holidays you got to wear a regular t-shirt with work pants and shoes.", "Cons": "Horrible working conditions, everything was always breaking and filthy, store manager was rude and belittled you almost every day, customers were rude, nothing was properly cleaned until a week before an inspection, served expired/past serve time food to customers (they would just put new time stickers on the items), other expired food is given to employees, doesn't enforce cleanliness (employees wiping their face/nose then handling food. Usually with no gloves)."}, "8": {"Date": " Sep 5, 2016", "Summary": "\"chef\"", "Pros": "good food you know what i mean", "Cons": "customers this ride never ends man"}, "9": {"Date": " Jul 31, 2016", "Summary": "\"Ok\"", "Pros": "Great place to work for, flexible hours and easy to work with", "Cons": "Yeah I really didn't have any problems with this company"}}