{"0": {"Date": " Apr 5, 2016", "Summary": "\"It has been a wonderful place to learn how to run a business, from the ground up.\"", "Pros": "Stability, consistent pay, paid time off, fun atmosphere. The owner of the company really takes the time to help you grow, and offers many classes to learn.", "Cons": "Stress of handling fifty things at one time, with a smile on your face. There are days when you are expected to do entirely too much (superhuman)"}, "1": {"Date": " Apr 6, 2016", "Summary": "\"Summer Job\"", "Pros": "Ton of hours, Management was great", "Cons": "Scheduling was all over the place, but still manageable"}, "2": {"Date": " Apr 6, 2016", "Summary": "\"crew member\"", "Pros": "The pros are Flexible Scheduling", "Cons": "The cons are the inconsistency between managers"}, "3": {"Date": " Apr 19, 2016", "Summary": "\"Way to make some money\"", "Pros": "I was given a free meal as part of my break and I came to enjoy working with my co-workers (they renovated our restaurant).", "Cons": "Rude customers and very very poor management. There was a huge lack of organization and it made it difficult to feel like you wanted to stick around."}, "4": {"Date": " Apr 19, 2016", "Summary": "\"Good as a first job, but not much else\"", "Pros": "McDonald's offer flexible hours and is a very solid first job for those in high school or college. Crew is very friendly and upbeat.", "Cons": "Work is very physical and fast paced, so it is not meant for everyone. Minimum wage to begin with, with small bi-yearly raises. Frequently asked to work extra."}, "5": {"Date": " Apr 19, 2016", "Summary": "\"McDonald's\"", "Pros": "Great hours, so great pay", "Cons": "Sometimes get too overwhelmed when there's too many customers and not enough people working"}, "6": {"Date": " Apr 19, 2016", "Summary": "\"Swing Manager\"", "Pros": "Good Benefits, Good fun, and you learn a lot", "Cons": "Hard to develop, grow and promote with the company unless you have no other commitments."}, "7": {"Date": " Apr 20, 2016", "Summary": "\"Manager\"", "Pros": "Flexible work schedule at best", "Cons": "Drama and negative energy towards crrw."}, "8": {"Date": " Apr 20, 2016", "Summary": "\"Decent First Job\"", "Pros": "Good for a first job to gain some experience, not where I'd like to work long term", "Cons": "Low Pay, not where I would like to work long term by any means"}, "9": {"Date": " Apr 5, 2016", "Summary": "\"great place\"", "Pros": "food is awesome! people are nice. i learned a lot. the clientele are nice people too. great place to work. that's all i have to say", "Cons": "sometimes i would eat too much mcdonalds before or after my shift and I would get burnt out on it. Also, i really wish that the mcrib was all year round on the menu"}}