{"0": {"Date": " Jun 2, 2017", "Summary": "\"Parachute Packer\"", "Pros": "Excellent owner and co-owner. Flexible scheduling just expect to work weekends and holidays with few exceptions.", "Cons": "Not a lot of room for advancement and pay is acceptable but could stand to be better for the amount of labor."}, "1": {"Date": " Jul 8, 2017", "Summary": "\"do not go here at least\"", "Pros": "but free uniformflexible hours", "Cons": "getting burn most of the time only minimum wagedangerous environmenthaveing to pay for slip resistant shoes out of your check that's what I heard from another employeeand on top of that they'll let you home early all the time thus cutting into your hours like crazyno overtime everwill do anything possible to stop itnot much trainingthere is no discount"}, "2": {"Date": " Jun 17, 2017", "Summary": "\"The owner was cheap there are good owners out there.\"", "Pros": "Flexibility, promotions, schooling provided for promotions. Ability to grow. Great way to get management experience .", "Cons": "Stressful if poorly operated by the owner. If you don't get trained properly get out asap."}, "3": {"Date": " Jun 2, 2017", "Summary": "\"Nice Pay, but at times stressful\"", "Pros": "Nice pay, Work wasn't as hard", "Cons": "Short Breaks, sometimes was stressful"}, "4": {"Date": " Jun 3, 2017", "Summary": "\"Crew\"", "Pros": "The Nice managers will help but may sometimes gives you a good challenge", "Cons": "Sometimes won't receive any break. Low wage and bad management skills"}, "5": {"Date": " Jun 16, 2017", "Summary": "\"Straight to the money ok\"", "Pros": "The customers, the team, the hours", "Cons": "The pay is the main thing"}, "6": {"Date": " Jun 16, 2017", "Summary": "\"Enough to put extra cash to your pocket\"", "Pros": "Discout 50% nice crew comunication", "Cons": "Lack of dedicated employees understaff"}, "7": {"Date": " May 30, 2017", "Summary": "\"As Good as You Could Expect\"", "Pros": "They gave me a job with references that I think helped me going forward. Winning employee of the month looked good on a resume with future employers .", "Cons": "All the things people generally gripe about, sometimes people are rude, the wage isn't great but that is all to be expected."}, "8": {"Date": " Jun 2, 2017", "Summary": "\"Great place to build a career\"", "Pros": "Great place to work", "Cons": "Customers can be very rude"}, "9": {"Date": " Jul 7, 2017", "Summary": "\"eh\"", "Pros": "Good pay and flexible hours", "Cons": "lots of hours bad work enviroment"}}