{"0": {"Date": " Dec 18, 2016", "Summary": "\"Decent job\"", "Pros": "Hours were somewhat flexible for students", "Cons": "Its a service job, dont want to do this job for long"}, "1": {"Date": " Dec 19, 2016", "Summary": "\"Decent job if you have little alternatives\"", "Pros": "The customer service experience, sometimes free food, generally jokey unserious atmosphere during non-rush-hour periods.", "Cons": "Management is usually very unprofessional and condescending. A lot of work for little pay, and they expect you to do busy-work - if you're seen doing nothing, they're gonna find something for you to do."}, "2": {"Date": " Dec 3, 2016", "Summary": "\"McDonald's\"", "Pros": "Good employees, benefits, hours, extra cash incentives, chance to move up in the company, free food and drinks.", "Cons": "Fast food, being on your feet for long hours, always short staffed, very fast paced work. It's not for everyone."}, "3": {"Date": " Dec 15, 2016", "Summary": "\"employee\"", "Pros": "I loved the staff and made so many memories with the wonderful employees. The place was really clean and neat.", "Cons": "The environment wasn't as safe and clean as I wished but it was okay. I had to deal with a lot of bad customers."}, "4": {"Date": " Jan 7, 2017", "Summary": "\"Fast food sucks\"", "Pros": "Discounted food but is that really a pro?", "Cons": "Everything else it was a horrible experience."}, "5": {"Date": " Dec 18, 2016", "Summary": "\"Pretty demanding and unprofessional work enviroment\"", "Pros": "A Job is a job is a job.The particular store was always in need of people so the current employees received insane hours.", "Cons": "I worked at the training grounds for reject managers. As well that we would rarly have more than 2 people working at a time"}, "6": {"Date": " Dec 3, 2016", "Summary": "\"Not that bad\"", "Pros": "Where I worked they were fast and I learned quick, one or two people that have nasty attitudes but other then that it was a good job for $10.50 an hour. Since you're new you have to clean and stock a lot do what they tell you to do and don't be rude.", "Cons": "You're on your feet 4-8 hours constantly rushing on order after order. Can get very overwhelming at times but in a week or two you will get used to it and learn everything. Good first job."}, "7": {"Date": " Dec 3, 2016", "Summary": "\"The job itself isn't so bad. I mean, no one really desires to work in fast food but you gotta do what you gotta do.\"", "Pros": "I've met some decent people and I've really learned about the concept of teamwork here. The pay isn't to bad for a job that's working with my college schedule and allowing me to further my opportunities within the company as well.", "Cons": "Honestly, the cons are genuinely the customers. The job isn't what makes the food experience horrible but it's the people we serve. Fast food workers are such a demanded service yet so degraded upon for working there. Majority of us are either down on our luck in life or working to further education. Fast food workers are highly disregarded and disrespected."}, "8": {"Date": " Dec 16, 2016", "Summary": "\"Cashier\"", "Pros": "Its good job first job for someone that is searching for oneMy manager was always flexible when it came to schedulescoworkers were great people to work with", "Cons": "The pay is really low, the chances of getting higher pay was very low.Its a fast food job so your not going to get any benefits or any paid time off."}, "9": {"Date": " Dec 1, 2016", "Summary": "\"I was on the crew and all in all it was a good job great people to work with and a good first job\"", "Pros": "It was excellent i had fun working with other co-workers and managers.", "Cons": "It gets hard especially with customers who are rude and people you work with that have bad days."}}