{"0": {"Date": " Oct 9, 2017", "Summary": "\"server\"", "Pros": "they had good customers a lot", "Cons": "low pay that was not good"}, "1": {"Date": " Oct 23, 2017", "Summary": "\"Easy to work your way to management.\"", "Pros": "Easy to work your way to management.", "Cons": "Grease ruins your skin."}, "2": {"Date": " Oct 23, 2017", "Summary": "\"Cashier\"", "Pros": "Interactions with customers, if you're looking to train your charismatic skills", "Cons": "Nearly everything.-Lazy coworkers-Even lazier shift managers, to the point in which they'll leave early and have you take care of the stuff they were supposed to do (stock things), on top of everything you had to do to begin with.-No leniency on taking sick days-No vacation days, unless you're okay with people, including your manager giving you a bad look when you come back to work."}, "3": {"Date": " Oct 23, 2017", "Summary": "\"Food Prep\"", "Pros": "You get most of the hrs that you need.", "Cons": "You do not get a lunch break most of the time. You work over your hrs then you start to work for free with out knowing it."}, "4": {"Date": " Oct 23, 2017", "Summary": "\"manager\"", "Pros": "Some of the people are really great. Flexible Schedules.", "Cons": "A lot of the customers"}, "5": {"Date": " Oct 23, 2017", "Summary": "\"What I've experienced\"", "Pros": "Some people are nice, seven dollars of free food.", "Cons": "At least where I work they rarely post the next weeks schedule on time. Expect things from one person but not others. Favoritism."}, "6": {"Date": " Oct 8, 2017", "Summary": "\"Better than nothing\"", "Pros": "Consistant work and always paid on time !!", "Cons": "Fast paced environment and dealing with unreliable employees"}, "7": {"Date": " Oct 9, 2017", "Summary": "\"Keep looking forward and you can progress\"", "Pros": "Competitive washes, great room for growth within organization; however, if you keep your wits about you you can excel thee corporate ladder.", "Cons": "There aren’t many cons as long as you do your job; Howe, getting caught up in the drama of childish nonsense can slow your progression"}, "8": {"Date": " Oct 22, 2017", "Summary": "\"First job in High School\"", "Pros": "Nice first job, great people to work with, easy", "Cons": "Rude customers traumatized me for life"}, "9": {"Date": " Oct 22, 2017", "Summary": "\"Crew Member\"", "Pros": "Enjoyed coworkers, fun company holiday party, generally enjoyed work", "Cons": "was kept on one position for a few months before being trained elsewhere, sometimes managers would keep you over without notice or communication if you were a better employee or someone didn't come in"}}