{"0": {"Date": " Aug 4, 2017", "Summary": "\"Not good\"", "Pros": "You get to work with other people and make great friends.", "Cons": "The mangers are mean to you and very hard on you if you don't do the job fast enough for them."}, "1": {"Date": " Aug 6, 2017", "Summary": "\"Shift manager\"", "Pros": "Worked here for over 4 years some co workers become like family.Get promoted to management make $1.53 more .Learn to be strong because your basically on your own with 5 new people everyday.Get no recognition for the slave work you do.Get persuaded into giving up your availability without knowledge.", "Cons": "No team workIt's every man for themselves when it comes to managementGet written up for helping out after asked to stay longer (overtime)"}, "2": {"Date": " Jul 21, 2017", "Summary": "\"Certified Swing Manager\"", "Pros": "I learned so much about myself through working there", "Cons": "They will over work you if you let them"}, "3": {"Date": " Jul 22, 2017", "Summary": "\"Manager\"", "Pros": "good amount of hours, flexible schedule", "Cons": "not enough of flexibility to go back to school"}, "4": {"Date": " Aug 4, 2017", "Summary": "\"Decent first job\"", "Pros": "Your coworkers will be the light in the darkness, free food, nice \"usual\" customers, will teach you how to multitask and use time effectively", "Cons": "Can be very stressful, low wage, work environment needs improvement, more/better training needed"}, "5": {"Date": " Aug 5, 2017", "Summary": "\"Cashier\"", "Pros": "Free food on your lunch break", "Cons": "Everything else and bad customers."}, "6": {"Date": " Jul 21, 2017", "Summary": "\"Crew\"", "Pros": "Good service and everyone is nice", "Cons": "The hours are to little for me"}, "7": {"Date": " Aug 25, 2017", "Summary": "\"My Job\"", "Pros": "Food for free every day", "Cons": "Pay was not very good"}, "8": {"Date": " Aug 3, 2017", "Summary": "\"Great learning experience\"", "Pros": "The training and benefits are actually pretty decent. The training is business training and you can get college credit for it.", "Cons": "Challenging changes. Sometimes changes in protocol can change the efficiency of the Store. Especially true when managing a younger generation."}, "9": {"Date": " Aug 4, 2017", "Summary": "\"Crew\"", "Pros": "Working with th3 public is always a plus for me. I love to make people HAPPY with the great McDonald's food.", "Cons": "Standing on your feet all day. Sometimes working long hours. It seems like everyday there is a disgruntled customer for whatever reason"}}