{"0": {"Date": " Nov 25, 2017", "Summary": "\"First Job Experience\"", "Pros": "Its a good first job. In my location the managers do care and it makes a huge difference at work. It will teach you how the working world functions and is a very easy way to get yourself out there. If you show up and make an effort, they'll keep you.", "Cons": "Whether you have hours or not will depend on \"labor\", and there are a lot of teenagers and adults who come here expecting to not come to work and still have a job. Your work environment depends on your managers, not a pro or con, but something to keep in mind."}, "1": {"Date": " Nov 9, 2017", "Summary": "\"Patty man\"", "Pros": "Great hours, Benefits, Ability to transfer", "Cons": "Nothing comes to mind. Really great place"}, "2": {"Date": " Dec 14, 2017", "Summary": "\"Cashier\"", "Pros": "Easy access to solid work hours", "Cons": "Very Sub par management tactics"}, "3": {"Date": " Dec 15, 2017", "Summary": "\"TRAGIC\"", "Pros": "They was nothing good about working here", "Cons": "Every possible con you can thing of"}, "4": {"Date": " Nov 23, 2017", "Summary": "\"Crew Trainer\"", "Pros": "My coworkers were like my best friends,", "Cons": "As the years went on, everyone began leaving and crappy people replaced. Store went to crap after that. Everything sucks in this company. Great first job but not after that"}, "5": {"Date": " Nov 8, 2017", "Summary": "\"Frycook\"", "Pros": "Free Food , flexible schedule, and decent hours", "Cons": "Bad Management, bad pay and no breaks"}, "6": {"Date": " Nov 9, 2017", "Summary": "\"i was grill crew and a dishwasher\"", "Pros": "the job is very fun", "Cons": "the schedule is sometimes off"}, "7": {"Date": " Nov 7, 2017", "Summary": "\"summer operations intern\"", "Pros": "great company culture, friendly coworkers", "Cons": "not enough guidance throughout internship"}, "8": {"Date": " Nov 7, 2017", "Summary": "\"My experience was really good overall. I enjoyed working with my coworkers there & the managers are understanding.\"", "Pros": "Great team! The crew is really helpful in training you to become one of them. Great management. Great enviroment to work in", "Cons": "Every now & then you come across a rude customer. Other times you get really specific orders from customers so you have to pay extra attention to them to meet their needs."}, "9": {"Date": " Nov 8, 2017", "Summary": "\"Career Opportunity\"", "Pros": "A lot of opportunities to grow", "Cons": "I have no opinion for cons"}}