{"0": {"Date": " Jan 11, 2018", "Summary": "\"Great first job!\"", "Pros": "Easy work, good pay for a starter job. Easy work, good first pay for a starter job. Easy work, good first pay.", "Cons": "Nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing nothing"}, "1": {"Date": " Feb 16, 2018", "Summary": "\"Cashier\"", "Pros": "It's a job that pays my bills and keeps me alive", "Cons": "It's McDonalds and the food sucks, but it's a job"}, "2": {"Date": " Jan 26, 2018", "Summary": "\"Cashier\"", "Pros": "If you're a teenager in school they'll work around your school schedule.", "Cons": "Under payed for the amount of work you're require to do."}, "3": {"Date": " Jan 26, 2018", "Summary": "\"Cashier\"", "Pros": "Free lunch. Some of the customers make the day better", "Cons": "A lot of drama between managers"}, "4": {"Date": " Jan 10, 2018", "Summary": "\"Team Member\"", "Pros": "Got along well with other team members. know how to operate cash register. know how to prepare sandwiches. like learning new things, and always room for improvements.", "Cons": "time available to complete tasks, and people not liking to work with other teammates"}, "5": {"Date": " Jan 10, 2018", "Summary": "\"Good enough\"", "Pros": "Steady Work and fun colleagues", "Cons": "schedule changes at the last minute"}, "6": {"Date": " Jan 24, 2018", "Summary": "\"Mediocre\"", "Pros": "Great people, had a lot of fun", "Cons": "Awful employers. They were so bad at scheduling."}, "7": {"Date": " Jan 24, 2018", "Summary": "\"Mediocre experience\"", "Pros": "Decent pay and relatively easy job", "Cons": "Inflexible hours and inconsistent management"}, "8": {"Date": " Jan 24, 2018", "Summary": "\"ok for part time\"", "Pros": "friendly working environment, nice co-worker, no experience require, sometimes get free make", "Cons": "not fixed schedule, change every week and hard to plan rest of your time"}, "9": {"Date": " Jan 24, 2018", "Summary": "\"employee\"", "Pros": "good hours, free food, no over time", "Cons": "not overtime, no daycare, no holidays off, no benefits"}}