{"0": {"Date": " Dec 4, 2017", "Summary": "\"Cashier\"", "Pros": "Challenging but fair in management", "Cons": "bad management for most busy days"}, "1": {"Date": " Dec 4, 2017", "Summary": "\"Cashier\"", "Pros": "Good enviornment. Easy Work mainly taking customer orders and maintenance.", "Cons": "The pay is minimum wage. Can get hectic."}, "2": {"Date": " Nov 19, 2017", "Summary": "\"Love working here.\"", "Pros": "FlexibleGood payFree food on weekendsLots of varietyFood is not as gross as everyone says it isFast hire time", "Cons": "Standing a lotWorking back drive through windowWorking with incompetent teenagersAll the beeping timersGetting some burnsSome bad managers"}, "3": {"Date": " Dec 3, 2017", "Summary": "\"Senior Analyst\"", "Pros": "A great company. Easy access to speak with higher management and collaboration between people was great.", "Cons": "Not enough opportunities to be promoted"}, "4": {"Date": " Dec 3, 2017", "Summary": "\"Cashier\"", "Pros": "Food is great at this job", "Cons": "Sometimes you will smell like French fries when you come home"}, "5": {"Date": " Dec 3, 2017", "Summary": "\"Needs to provide equal care\"", "Pros": "McDonalds does strongly value customer service.", "Cons": "McDonald's does not value it's employees as much as they should."}, "6": {"Date": " Nov 17, 2017", "Summary": "\"My review\"", "Pros": "Great people and great job", "Cons": "Fast pass, but then again that helps you keep busy"}, "7": {"Date": " Dec 3, 2017", "Summary": "\"There is so much drama it's ridiculous. They cut our benifets, screwed me out of maternity leave pay\"", "Pros": "The rest of the staff was pretty amazing and the regular customers were great to talk to everyday. Not a whole lot else that's good.", "Cons": "Everything. Everything is always broken, the customers who aren't nice really really suck. Plus no one ever really gets trained correctly so no one actually knows how to do their job"}, "8": {"Date": " Nov 17, 2017", "Summary": "\"Front line\"", "Pros": "Great experience. Provided me with a great perspective.", "Cons": "There were no negatives with this position."}, "9": {"Date": " Nov 17, 2017", "Summary": "\"order food\"", "Pros": "discount food，nice cowokers and manager", "Cons": "Only thoses，low benifites，fast paces.The syatem have a bug..keeping tells me you must ebtee at leastleast 5 words."}}