{"0": {"Date": " Jan 18, 2017", "Summary": "\"Zytecqua's overall look\"", "Pros": "Friendly environment the co-workers are very social and fun to be around.everyone knows how to do their job and pays attention.", "Cons": "Little hours and the it's to far to travel after school.some people have nasty attitudes"}, "1": {"Date": " Jan 18, 2017", "Summary": "\"McDonald's Crew Member\"", "Pros": "I would highly recommend this job to any high schooler or college student looking for part time work! The salary is decent and the hours are flexible.", "Cons": "You will get sick of the food after you work at McDonald's for a long time! I am not sure why, but now I cannot stand the smell of the place after working in the kitchen."}, "2": {"Date": " Jan 18, 2017", "Summary": "\"Part-Time\"", "Pros": "Great Part-time job for High school students, flexible hours.", "Cons": "Job is the same everyday"}, "3": {"Date": " Jan 19, 2017", "Summary": "\"Line Manager\"", "Pros": "Great Food, Great People to work with", "Cons": "High employee turnover and difficult to work around other's schedules"}, "4": {"Date": " Feb 1, 2017", "Summary": "\"Job At McDonalds\"", "Pros": "I was with Friends and built a good strong relationship with the customers, and I learned a lot of good values to work with others.", "Cons": "I had very little time to do what I wanted and I was not making no profit for myself working there. I hardly had enough money to put in the gas tank."}, "5": {"Date": " Feb 1, 2017", "Summary": "\"Department Manager\"", "Pros": "Good Hours, Cares about employees, Tuition Help", "Cons": "Not Paid enough, OOP doesnt care"}, "6": {"Date": " Feb 1, 2017", "Summary": "\"It was OK\"", "Pros": "Really easy to move up if you voice it.Great work-life balanceVery accommodating when \"life\" happensIt really does become a family", "Cons": "There wasn't a great start pay, with the franchise and even moving up with management, they wanted to give an 7 cent increase to run their store. It was ridiculous."}, "7": {"Date": " Feb 1, 2017", "Summary": "\"Working at Mcdonald's\"", "Pros": "You get coupons and hands on experience with cooking good food", "Cons": "Culture is very bad, most surfaces (floor, tables, counters, etc.,) are not sanitary."}, "8": {"Date": " Feb 1, 2017", "Summary": "\"Decent for a high school job\"", "Pros": "Schedule Flexibility, relaxed atmosphere, easy job tasks", "Cons": "Customers were horrible, managers weren't always that great"}, "9": {"Date": " Feb 1, 2017", "Summary": "\"sales associate\"", "Pros": "easy to get a job", "Cons": "Place was dirty, Business was slow, minimum wage"}}