{"0": {"Date": " Apr 8, 2016", "Summary": "\"At Least it's a Job\"", "Pros": "You get one discount a day, which is better than nothing. You learn customer service as well. Also, you receive hard-earned minimum wage.", "Cons": "Managers don't care. My manager left whenever she felt like it, busy or not, telling us to clock her out. They treat their employees horribly, no respect is given (and honestly not a ton is received). Vacations? Forget about it. Even if you ask for the days off they'll schedule you. It's a good first job, but otherwise I would never sponsor working for this company."}, "1": {"Date": " Apr 8, 2016", "Summary": "\"Crew member\"", "Pros": "None at all it sucked", "Cons": "It sucked to much drama way to much drama"}, "2": {"Date": " Apr 8, 2016", "Summary": "\"Unfair\"", "Pros": "There are no pro's to working for this company when it really doesn't care about the employees as much as the money that they get from employees work hard for them to put money in there pockets", "Cons": "I've been working for mcdonald's for going on a year and I found out 4 months ago that assistant managers get free food and crew only gets half off on their food when the crew does most of the real work and I thank it should change that the crew get free assistant managers have the half price meal they make more any how"}, "3": {"Date": " Mar 3, 2016", "Summary": "\"Cashier/ Crew Trainer\"", "Pros": "To provide Great Customer service to customers, to satisfy each and every want that they have.", "Cons": "We should get t shirts for the summer."}, "4": {"Date": " Mar 17, 2016", "Summary": "\"Okay for high school\"", "Pros": "Flexible, good for high school", "Cons": "Disorganized, doesn't pay a lot for someone out of high school"}, "5": {"Date": " Mar 17, 2016", "Summary": "\"Great for Students\"", "Pros": "If you're a student looking for some quick cash, its a great part time job. They tend to work around your schedule and make sure that you prioritize your education.", "Cons": "I wouldn't suggest letting what you make go to your head. I know some would say this is redundant, but some of the people I worked with prioritized McDonald's over finishing their education."}, "6": {"Date": " Mar 1, 2016", "Summary": "\"Great learning experience.\"", "Pros": "Positive overall environment. You learn great people skills and how to be a supportive leader. Very flexible hours and schedule for a student.", "Cons": "Fast paced, didn't always have the best managements. Can get frustrating working with employees who do not take their job seriously."}, "7": {"Date": " Mar 3, 2016", "Summary": "\"None\"", "Pros": "Very great place to work for a very good company to work for a lot to learn a lot to achieve the opportunities are phenomenal", "Cons": "Very disappointed that we are not corporate anymore we are now franchise and I really really hate that the employees has lost a lot"}, "8": {"Date": " Apr 7, 2016", "Summary": "\"Abuse\"", "Pros": "You will have a miserable time being miserable.", "Cons": "Discount, friends that stab you in the back!"}, "9": {"Date": " Apr 8, 2016", "Summary": "\"Pays bad treatment is bad and trying to get a lunch break is like trying to get straw from the middle of the haystack\"", "Pros": "It is a job so if that's what you need to feed your family then you just have to tolerate them", "Cons": "Management is used to having kids so they treat them horribly they don't talk down to them and don't give them any respect"}}