{"0": {"Date": " Jul 15, 2016", "Summary": "\"cashier\"", "Pros": "great job, flexible and fun", "Cons": "long hours and inability to choose hours"}, "1": {"Date": " Aug 20, 2016", "Summary": "\"shift manager\"", "Pros": "flexible schedules,learn customer service skills and meet new people who become friends for life.", "Cons": "overwork/under paid, do not work for any franchise stores."}, "2": {"Date": " Jul 15, 2016", "Summary": "\"Crew Member\"", "Pros": "Lots of acceptance, very big on diversity", "Cons": "Understaffed at times, overstaffed at times"}, "3": {"Date": " Jul 29, 2016", "Summary": "\"not for over 25\"", "Pros": "wages are going up every year", "Cons": "not a career for adults"}, "4": {"Date": " Jul 29, 2016", "Summary": "\"Cashier\"", "Pros": "You see what goes on while making food at McDonald's", "Cons": "no employee discountsno flexible hours"}, "5": {"Date": " Aug 20, 2016", "Summary": "\"Eh\"", "Pros": "Judging highlighting the error message when I was wondering if you have any questions or concerns please visit the lockouts page and the other day and I will be in the morning and I will be in the morning and I will be in the morning and I will have the right direction and a couple weeks to see the status is a very long day at a local guy and a couple", "Cons": "The following link and you can see the attachment for your time to get the best way for you and I will be in touch and go to the inbox by boomerang the first time in total there"}, "6": {"Date": " Aug 20, 2016", "Summary": "\"Not worth the the gas to drive there\"", "Pros": "I can not really find a pro.", "Cons": "Getting yelled at over French fries"}, "7": {"Date": " Jul 29, 2016", "Summary": "\"Crew member\"", "Pros": "Friendly people willing to work with you", "Cons": "Pay rate stinks more hours"}, "8": {"Date": " Jul 28, 2016", "Summary": "\"crew member\"", "Pros": "The only good thing that came out of working here was meeting a few good friends.", "Cons": "The work environment wasn't always pleasant. You had coworkers getting away with being on their phones all the time instead of doing their job. We were always short staffed and if someone called off consecutive days nothing was ever done about it. It was allowed. The hours were terrible and the good workers were never noticed until it was too late and they have moved on. Do not work here unless you want to get treated like you are at the bottom all the time."}, "9": {"Date": " Jul 28, 2016", "Summary": "\"Great place to learn\"", "Pros": "I've honestly learned to have a great work ethic from working at McDonald's. Also, the benefits weren't bad.", "Cons": "I was a manager and got paid a dollar over minimum wage.. among other things."}}