{"0": {"Date": " May 22, 2016", "Summary": "\"Cashier\"", "Pros": "It was a great first job as a cashier for I got to learn what it truly meant to work", "Cons": "I was only paid minimum wage, I didn't get any benefits, my hours won't always the same each week"}, "1": {"Date": " May 22, 2016", "Summary": "\"Manager\"", "Pros": "Fast paced environment. good first job", "Cons": "no advancement. pay is bare minimum"}, "2": {"Date": " May 22, 2016", "Summary": "\"Crew trainer\"", "Pros": "Free food on 30 break", "Cons": "Work only for teenager. Underpaid"}, "3": {"Date": " May 7, 2016", "Summary": "\"cashier\"", "Pros": "I was full time and I like working with people and get along with every ong", "Cons": "I get along with every one"}, "4": {"Date": " May 7, 2016", "Summary": "\"Team Member\"", "Pros": "Free food and really nice people. The work was not as challenging as I thought it would be. There was opportunity for advancement.", "Cons": "Being splattered by fries was not fun. Occasionally rude customers and the management did not back me up in several interactions, which is never good."}, "5": {"Date": " Jun 13, 2016", "Summary": "\"Cook\"", "Pros": "Easy hire, not many pros but glass door is making me do this so I will be honest. Store members have terrible attitudes. Miserable people to work with.", "Cons": "Working with illiterate ppl who cannot read orders correctly and managers who love drama more than they love the job"}, "6": {"Date": " Jun 13, 2016", "Summary": "\"department manager\"", "Pros": "None at all very depressing", "Cons": "Company pays very little compared to similar jobs in the industry. High demanding, very stressful job. Company does not provide good benefits and no bonuses. They are very focused on maximizing profits for the owners but do not reward you for your contributions to this. They view everyone as expendable. They frequently hire managers and store managers that are not capable of handling the position and usually other managers have to pick up the slack. Any issues that arise at thr storr they always attempt to sweep underneath the rug. If you are looking for a company to appreciate your hard work and compensate you for it properly then this is not thr place to go. If you enjoy being abused and taken advantage of by your employer then this is certainly the place you should be looking at!"}, "7": {"Date": " May 22, 2016", "Summary": "\"N\\a\"", "Pros": "Great way to network with people", "Cons": "Manager has no communications skills."}, "8": {"Date": " May 3, 2016", "Summary": "\"IT\"", "Pros": "Flexible culture with a focus on family needs. Flexibility around overall employee needs. Growth opportunities", "Cons": "The culture is changing as the company is focused on changing to reduce overall costs. It will ultimately be a more efficient company, but the culture is taking a hit for it."}, "9": {"Date": " May 21, 2016", "Summary": "\"Crewmember\"", "Pros": "Most McDonald's have very flexible schedules, and low entry requirements. You may also be able to advance to a managerial position!", "Cons": "Most McDonald's also pay minimum wage. Also it will make your clothes smell like fry grease. Don't forget about all of the mean and entitled customers that blame you for them being late getting back to work on their lunch break. Etc.No direct deposit if you're not a manager. No benefits either."}}