{"0": {"Date": " Oct 11, 2017", "Summary": "\"The management was horrible.\"", "Pros": "The crew was fun to work with and made the environment a lot more fun to work in, and there was plenty of opportunity to get more hours", "Cons": "Management was unprofessional and unorganized. Complaints have been submitted to DM, GM, and HR but somehow the problems continue to arise again"}, "1": {"Date": " Sep 19, 2017", "Summary": "\"First stressful job\"", "Pros": "made friends there, learned some good customer service skills, learn the meaning of fast food.", "Cons": "treated like you know nothing, low pay, no health care or paid vacations."}, "2": {"Date": " Sep 19, 2017", "Summary": "\"very self centered no concern for others\"", "Pros": "flexible schedule with many hours to choose from can fit in your life", "Cons": "management is always under so much pressure to make numbers that staff does not count must work like robots"}, "3": {"Date": " Sep 4, 2017", "Summary": "\"Swing Manager\"", "Pros": "Flexibility for school and child care", "Cons": "Being overworked is likely but after becoming friends with your regulars it is more enjoyable"}, "4": {"Date": " Sep 5, 2017", "Summary": "\"Drama\"", "Pros": "Some of the employees are nice", "Cons": "Mostly teenagers, a lot of drama and favoritism"}, "5": {"Date": " Sep 18, 2017", "Summary": "\"Good First Job\"", "Pros": "EasyNo Prior Skills or Experience Necessary", "Cons": "BoringRepetitiveLong Shifts Feel Like They'll Never End"}, "6": {"Date": " Sep 18, 2017", "Summary": "\"New Employee\"", "Pros": "Free meal at lunch time", "Cons": "Low wages per hourly income"}, "7": {"Date": " Sep 18, 2017", "Summary": "\"Pretty good\"", "Pros": "Don't really have to think, screens point you in the right direction", "Cons": "Different managers will have different styles"}, "8": {"Date": " Sep 19, 2017", "Summary": "\"Crew Member\"", "Pros": "It was my first job and I met a lot of nice people who worked there. Working there gives you great customer service experience as well.", "Cons": "Dealing with rude people was the worst part. Also, the management made it seem like I had to dedicate my entire life to my part-time position."}, "9": {"Date": " Sep 3, 2017", "Summary": "\"Crew Member\"", "Pros": "It's the best first job any one can have. It gives team spirit and ability to grow with soft skills.", "Cons": "None can be pointed out as it is near perfect"}}