{"0": {"Date": " Oct 11, 2016", "Summary": "\"Shift manager\"", "Pros": "At this job you can learn how to boost up your multitasking skills...", "Cons": "There are good days and then there are bad days. If you have a bad day do yourself a favor and forget that you had a bad day because the next day might be worse. As a McDonald's employees, no matter the position, you are working in a faster paced environment, and you have to pick up with the speed. The moment you start to drag your feet, or slow down then you will be the reason why things aren't going the right way. You have to put your feelings aside, no matter what your boss says, or how bad your day is, and work like your at your best. This may become a challenge at first but you'll get the hang of it. You might not look at this as a con, you can look at this as advice, and that's a good thing. This advice can go for any job. Remember, you're not just working for your for your company, you're part of the company. Make your company look good!"}, "1": {"Date": " Oct 11, 2016", "Summary": "\"Its an alright Job.\"", "Pros": "- Working hours are fine- You ease into it quite well.- Employers are fun if you actually talk to them!- Can be fun if you try, just stick with you routine and don't get in trouble.-Employment meals is awesome!- Lots of things to do to keep yourself busy. (Help make drinks, bag food. Etc.)Advice for new recruits:- STAY OFF YOUR PHONE! For your own good and you'll be okay.", "Cons": "- Breaks are too short. So once you are done it feels like you haven't rest enough and you have to stand in one place or move constantly (keep yourself busy) for another 4-5 hours. Back breaking. But thats a job for you.-Some of the employees act like they don't know any better. So they get in trouble constantly.- Things can be pretty hectic when there isn't enough workers but even more when there are too many workers. Its like Stocks gone bad when its too busy and too many people at the same time if things don't go right."}, "2": {"Date": " Oct 11, 2016", "Summary": "\"Crew Trainer at McDonald's for Two Years\"", "Pros": "Generally relaxed environmentHires all types (I've worked with middle schoolers, ex-convicts, immigrants from all over the world, and people that are semi-retired looking for a way to fill time)Can be fun if you take pride in your work and connect to customers", "Cons": "Managers were corruptMajority of machinery was outdated/brokenNot much training for crew trainersCustomers often treated crew members rudely"}, "3": {"Date": " Oct 11, 2016", "Summary": "\"I'm moving it\"careers in the making \"\"", "Pros": "The insurance program is phenomenal. McDonald's will take care of you.", "Cons": "The pay is not on par with the stress levels"}, "4": {"Date": " Oct 11, 2016", "Summary": "\"cook\"", "Pros": "the pros of working at mcdonalds is the flexible hours. you select your own availability and they work around your schedule. it also pays pretty well.", "Cons": "you might get fat working there if you eat the food too much. those are the cons i see for it. it also causes for a tense environment with hot grills going and managers barking out orders."}, "5": {"Date": " Oct 11, 2016", "Summary": "\"McDonald's\"", "Pros": "It is a great restaurant and they will work with you.", "Cons": "The food service is slow sometimes, but it is getting better."}, "6": {"Date": " Oct 25, 2016", "Summary": "\"Grill Manager\"", "Pros": "I can work during the times.my kids are in school because it's hard to find sitters for 4 kids", "Cons": "They pay is no good. I'm use to making at least $30-$40 yearly."}, "7": {"Date": " Oct 25, 2016", "Summary": "\"Great customer service experience\"", "Pros": "Face to face ongoing customer service everyday.having to do many things at once helps develop management skills", "Cons": "Very Limited pay unless you are a store manager or move up into a corporate position."}, "8": {"Date": " Oct 26, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Most of the people who I worked with were friendly.Hours were very flexible and plentiful.The employee discount was pretty nice.", "Cons": "Management was extremely frustrating at timesWorking in the kitchen was tough work.Training newbies become rather frustrating over time."}, "9": {"Date": " Oct 10, 2016", "Summary": "\"SR.Swing MGR\"", "Pros": "I took inventory. Counted money made deposits in the pos systems then drop box then I put in inventory in the pos systems then I counted the safe the drawers to make sure the safe is accurate then I put in the pos systems and take care of all daily operations then make sure the crew help communication there goals and everybody working as a team to have a smooth operations help the team where they needed help", "Cons": "There where some downside like inventory count mess up then u have to recount to make sure the pos systems matched the count"}}