{"0": {"Date": " Sep 17, 2017", "Summary": "\"Stock and maintenance\"", "Pros": "Flexible schedules easy to work with", "Cons": "People always call out"}, "1": {"Date": " Oct 1, 2017", "Summary": "\"An okay job to work in\"", "Pros": "A free employee meal and breaks", "Cons": "Paid pretty low because hours were tallied late."}, "2": {"Date": " Oct 1, 2017", "Summary": "\"First Job\"", "Pros": "Great introduction to customer service and de-escalating situations", "Cons": "Hours, co workers and safety."}, "3": {"Date": " Oct 1, 2017", "Summary": "\"Cashier\"", "Pros": "Easy to preform. Workers were somewhat friendly.", "Cons": "Customers we sometimes a pain to deal with."}, "4": {"Date": " Oct 1, 2017", "Summary": "\"It was stressful but good pay\"", "Pros": "The workers are nice and you make friends with them. The pay was good and the older you got the better they paid.", "Cons": "The job is stressful because you deal with rude people. The hours are long and the bosses can be very strict."}, "5": {"Date": " Oct 2, 2017", "Summary": "\"Shift Leader\"", "Pros": "Gained management experience for other jobs. Enjoyed some people I worked with. Was able to practice safe food in the working environment.", "Cons": "Upper management and owners were not compliant with most regulations such as paid time off. Had hard time moving up past Shift leader."}, "6": {"Date": " Sep 17, 2017", "Summary": "\"McDonald's\"", "Pros": "I feel that I should work at McDonald's because I'm a very hard and dedicated worker and this can show a huge way of responsibility because this is my first fast food gig.", "Cons": "The downsides at working at McDonald's are the distractions be that is something I can most definitely resist."}, "7": {"Date": " Oct 23, 2017", "Summary": "\"Crew Member\"", "Pros": "Close to where I live, in walking distance", "Cons": "Bad management miners don't get their breaks, and they treat their workers like crap"}, "8": {"Date": " Oct 1, 2017", "Summary": "\"Part Time\"", "Pros": "Easy to get hours, not really hard work.", "Cons": "Just not a lot of fun"}, "9": {"Date": " Sep 30, 2017", "Summary": "\"Decide wisely\"", "Pros": "You get a paycheck biweekly,l.", "Cons": "Hours are given based on the like system. Of the bosses like you....Hours galore. They punish you by taking away hours."}}