{"0": {"Date": " Dec 6, 2015", "Summary": "\"Swing Manager\"", "Pros": "Flexible working hours. Free food.", "Cons": "Working conditions suck! High sell rate, less employees to actually meet goals."}, "1": {"Date": " Dec 21, 2015", "Summary": "\"Good Job For Teens To Enter The Workforce\"", "Pros": "It helps teach young people basic job related responsibilities. Things like showing up on time, keeping a neat & professional appearance, responsible money management skills (both personal and professional) But most of all Customer Service skills. Many people wouldn't know, but dealing with fast food customers can become the hardest thing about working there.", "Cons": "Dealing with the many customers who thinks you're the scum of the workforce because you do work at McDonald's. Low pay & hours is definitely a Con."}, "2": {"Date": " Dec 5, 2015", "Summary": "\"Good wage for a teenager\"", "Pros": "-Learned valuable skills-Flexible hours; could manage to ask for a few more hours-6 month raises", "Cons": "-Managed poorly; could do more to keep production going more smoothly-Unorganized"}, "3": {"Date": " Dec 19, 2015", "Summary": "\"Mcdonalds is okay.\"", "Pros": "It never gets boring, and for me that's okay. At mcdonalds, you get to see whats behind everything, and that's cool.", "Cons": "It's pretty looked down upon. It's minimum wage, most of the time. You usually deal with rude people, but that's is with every job, like mcdonalds."}, "4": {"Date": " Dec 4, 2015", "Summary": "\"Crew member\"", "Pros": "Great benefits, easy job, great crew", "Cons": "Poor pay but easy job i dont mind working here"}, "5": {"Date": " Dec 4, 2015", "Summary": "\"cashier\"", "Pros": "You can get all the hours you want. Great people to work with. They provide benefits such as insurance,health care and hire pay then 7.25 hr.", "Cons": "It can be very stressful. You have to work so many hours before you get insurance."}, "6": {"Date": " Dec 4, 2015", "Summary": "\"Cashier\"", "Pros": "Fun, fast paced, free food, and flexible hours.", "Cons": "Customers were rude at times."}, "7": {"Date": " Dec 5, 2015", "Summary": "\"Acceptable\"", "Pros": "Decent management. They were flexible with my hours being a student. Could have been worse for a minimum wage job.", "Cons": "Dealing with aggressive customers could be a pain but is to be expected in such an environment. Can be quite repetitive if there long term."}, "8": {"Date": " Dec 18, 2015", "Summary": "\"cook\"", "Pros": "fun and exciting place to start as a cook.", "Cons": "over works and does not care about employees health and well being."}, "9": {"Date": " Dec 18, 2015", "Summary": "\"Shift Manager\"", "Pros": "Great environment, friendly staff, food all the time, and easy advancement.", "Cons": "Poorly staffed, Unorganized, poor communication, can be very stressful,and the pay wasn't good enough."}}