{"0": {"Date": " Nov 14, 2016", "Summary": "\"I love McDonald's\"", "Pros": "The best reasons to work is to be positive and make someone's day", "Cons": "Having to deal with rude customers"}, "1": {"Date": " Nov 15, 2016", "Summary": "\"Mcdonalds reveiw\"", "Pros": "Mcdonalds are everywhere and they will never turn down anyone for a job oppurtunity", "Cons": "They have really bad working hours"}, "2": {"Date": " Nov 28, 2016", "Summary": "\"Okay for extra money but that's about it.\"", "Pros": "The work wasn't hard. Co workers were pretty cool.", "Cons": "The customers were horrible. Be prepared to ague."}, "3": {"Date": " Nov 28, 2016", "Summary": "\"Crew trainer\"", "Pros": "Fun work environment and you learn a lot about how a restaurant works.", "Cons": "High volume and weak management"}, "4": {"Date": " Nov 29, 2016", "Summary": "\"McDonald's\"", "Pros": "You get to work with people and try to make relationships with them when they come back.", "Cons": "Unfair Timing in each position due to lack of members"}, "5": {"Date": " Nov 27, 2016", "Summary": "\"Wouldn't reccomend if you can find something better\"", "Pros": "-Free meal at the end of the shift-Easy to get hired", "Cons": "Low pay - paid minimum wage, not a cent above it.Lack of training - I did not receive any formal training on how to make certain drinks or desserts. Instead I was instructed to watch a general training video that didn't teach me what was relevant to performing my jobCustomers can be rude - it's McDonald's.DisorganizedSeemed like high turnover"}, "6": {"Date": " Nov 29, 2016", "Summary": "\"Crew trainer\"", "Pros": "The employees were nicer than the customers. Management really needa to get thier crap together", "Cons": "Extrwmwly low quality food sold at exoberant prices. Common for employees to cross contaminate"}, "7": {"Date": " Nov 14, 2016", "Summary": "\"Right place, wrong time\"", "Pros": "Considerate management, flexible hours, and helpful coworkers", "Cons": "Sometimes scheduling conflicts, chaotic at times, extremely fast paced"}, "8": {"Date": " Nov 14, 2016", "Summary": "\"Assistant manager\"", "Pros": "Good business takes care of you like family", "Cons": "Don't really have many cons to say about this company"}, "9": {"Date": " Nov 27, 2016", "Summary": "\"Cashier\"", "Pros": "One free meal during shift and some percentage off after shift", "Cons": "Bad scheduling, low paid. Don't give out a discount card for all employees so they can get discount at other Mcdonals store"}}