{"0": {"Date": " Nov 4, 2016", "Summary": "\"General manager\"", "Pros": "N/a none nada not good bad", "Cons": "No benefits pay isn't fair"}, "1": {"Date": " Nov 2, 2016", "Summary": "\"Chew up Spit out\"", "Pros": "Not really any pros, you really earn your money. Its a paycheck.", "Cons": "No one wants to work, have to do the job of 3 people, yours and the two people that didnt show up, the franchisees are so afraid of corporate."}, "2": {"Date": " Oct 12, 2016", "Summary": "\"Generally stressful place, great people\"", "Pros": "Interacting with crew members can be amazing, I made a lot of friends here, the fast-paced work was fun at times", "Cons": "Sometimes too fast paced, generally poor management, sometimes you have to deal with angry people"}, "3": {"Date": " Oct 12, 2016", "Summary": "\"Cashier\"", "Pros": "Customer service is awesome. I enjoyed the training and staff they really help me feel comfortable with the environment.", "Cons": "There are hardly any downside to this job. My Son as only 3months old when I was working there so I had to put in the hours."}, "4": {"Date": " Oct 12, 2016", "Summary": "\"Cashier\"", "Pros": "Friendly staff, employee discount, flexible schedule", "Cons": "Rude customers from time to time"}, "5": {"Date": " Oct 12, 2016", "Summary": "\"Shift Manager\"", "Pros": "Flexible HoursSome Autonomy in Management Position", "Cons": "Low pay, limited training opportunities, bosses do not trust you to complete tasks as well as they can, bosses do not train others because they could lose their bonuses. No upward mobility."}, "6": {"Date": " Oct 12, 2016", "Summary": "\"good\"", "Pros": "The flexible schedule allowed me to work here while also being in high school. I was able to save money for community college.", "Cons": "There weren't very many cons. I knew what to expect when coming into a fast-food job. Sometimes specific customers would cause a headache."}, "7": {"Date": " Oct 13, 2016", "Summary": "\"General Manager Franchise\"", "Pros": "Flexible hours, great insurance, gain lots of training and experience, free meals", "Cons": "No 401k, Poor pay for work done, micromanaged to death"}, "8": {"Date": " Sep 27, 2016", "Summary": "\"Fantastic Company\"", "Pros": "Amazing Training program, easy to move up in company, flexible hours", "Cons": "Large compensation gap between my position and my superior"}, "9": {"Date": " Sep 27, 2016", "Summary": "\"hard work\"", "Pros": "very hard work but you get a dicscount on food", "Cons": "lalal hard hard hard hard hard"}}