{"0": {"Date": " Oct 21, 2016", "Summary": "\"Shift Manager at McDs\"", "Pros": "It can be a lot of fun because it's fast-paced and different everyday. I also worked with a lot of amazing people. Free meals and employee discounts. Easy to be promoted if you're a hard worker.", "Cons": "Customers can treat you like garbage just because you're a fast food worker and scheduling can suck (I worked for McDonald's for 3 years and never had a set schedule). They also occasionally hire people who are lazy and stupid so you have to do twice the work."}, "1": {"Date": " Nov 26, 2016", "Summary": "\"horrible management\"", "Pros": "college tution, and 50% off meal.", "Cons": "managers constantly had personal feuds, and we would run out of food."}, "2": {"Date": " Nov 26, 2016", "Summary": "\"McDonald's cashier and crew member\"", "Pros": "Some of the customers, free lunch and a income. Also the closeness of the staff", "Cons": "The day goes by to slow and I dont like how they speak to employees"}, "3": {"Date": " Nov 4, 2016", "Summary": "\"Mcdonalds cashier\"", "Pros": "Most of the people you work with is great.", "Cons": "Poor organization, poor pay, management that doesn't care."}, "4": {"Date": " Oct 17, 2016", "Summary": "\"General manager\"", "Pros": "Working with and meeting new people", "Cons": "Having to drive 45 minutes going and coming each day."}, "5": {"Date": " Oct 20, 2016", "Summary": "\"Swing Manager\"", "Pros": "The benefits package is comprehensive, including discounts with hundreds of other companies, college and university tuition assistance, high-school degree completion programs, English language courses, etc.", "Cons": "Non-competitive pay, and my location refused any requests for my work schedule I had point blank. I worked only when they decided I would."}, "6": {"Date": " Oct 20, 2016", "Summary": "\"Crew Member/ Cashier\"", "Pros": "For a fast-food restaurant they pay weekly and I love it because most fast-food restaurants don't.", "Cons": "Some of the managers need to be more professional and not treat or talk to you any kind of way. Most of us are similar in age"}, "7": {"Date": " Nov 3, 2016", "Summary": "\"Manager\"", "Pros": "Great crew. Thats all :)", "Cons": "Low payBad managementCrazy customers"}, "8": {"Date": " Nov 3, 2016", "Summary": "\"Okay\"", "Pros": "I worked during high school and the pay was decent", "Cons": "I didn't like always smelling like grease"}, "9": {"Date": " Nov 3, 2016", "Summary": "\"McD's Management\"", "Pros": "Team work is a priority.", "Cons": "Not paid nearly your worth, the stress and weight on your shoulders as manager really takes a toll when you are making barely over minimum wage."}}