{"0": {"Date": " Mar 30, 2017", "Summary": "\"Franchise vs Corporate\"", "Pros": "They have really flexible hours and a lot of them are willing to work with minors around their schedule. It's an alright part time job, but I'd never recommend it as a full time job.", "Cons": "It should be noted that most are consistently not very good for adults as jobs. They tend to undermine the necessity of their older labor force. You know the people who can work the hours minors legally can't. Since most of the McDonald's are franchises you're not going to get a very good collective view of what it's actually like working for them. Some are better managed than others. It's not going to be a universal experience and benefits vary from private company/owners as with a lot of chains. They tend to notoriously underpay though, but I will admit there are definitely other fast food places that pay less. In other news working in fast food for a career is a terrible idea."}, "1": {"Date": " Mar 29, 2017", "Summary": "\"Cashier\"", "Pros": "easy job, learn interpersonal skills", "Cons": "very busy during lunch hour, low pay"}, "2": {"Date": " Mar 29, 2017", "Summary": "\"Cashier\"", "Pros": "Good management, Flexible schedule , Easy Job", "Cons": "Interesting Managers Other lazy workers"}, "3": {"Date": " Mar 29, 2017", "Summary": "\"Not the best\"", "Pros": "Pays, somewhat flexible, down-to-earth peers", "Cons": "Hot in kitchen, management is rude to employees, safety policies discouraged"}, "4": {"Date": " Mar 29, 2017", "Summary": "\"The store use to be a very great Store. Store Manager is OK when she wants to be\"", "Pros": "Sometimes the store manager bake or buy cookies and share.. Few good workers from my time, most of them quit or got another job.", "Cons": "To much relationship in store and cost the store to not run as its suppose to because they can't be \"professional\"."}, "5": {"Date": " Mar 29, 2017", "Summary": "\"Great place to work and have food and fun.\"", "Pros": "Food is great. Employees are fun.", "Cons": "Gained 10 pounds working there."}, "6": {"Date": " Mar 14, 2017", "Summary": "\"Great\"", "Pros": "It was a very engaging and enlightening experience", "Cons": "The constant smell of fries was a bit too much at times."}, "7": {"Date": " Mar 14, 2017", "Summary": "\"Very easy, very fun job\"", "Pros": "Good training, friendly co-workers, 5 hour training days good for someone like me who hasn't worked in years", "Cons": "Gets super busy at lunch, no employee meals at my location, breaks sporadic and unorganized"}, "8": {"Date": " Apr 19, 2017", "Summary": "\"Bleh.\"", "Pros": "They tend to have flexible hours.", "Cons": "They tend to have poor management!"}, "9": {"Date": " Apr 20, 2017", "Summary": "\"Worst fast food place to work at\"", "Pros": "One Free lunch on shift, variety of hours you can work, meeting random new people, some of the staff makes the time go by fast", "Cons": "Management thinks they know everything, customers are very rude and will try to rob you so it takes a good eye to make sure you are careful, very poor pay"}}