{"0": {"Date": " Nov 27, 2017", "Summary": "\"McDonalds\"", "Pros": "Learn a lot, it is a good first job, many opportunities to move up", "Cons": "VERY fast paced, can be overwhelming, not the best with schedules, don't feel appreciated, bonus's when you are a manager"}, "1": {"Date": " Nov 27, 2017", "Summary": "\"Good job for first time workers\"", "Pros": "McDonald's is a great place to work for those new to the job market (High School and College age workers). It provides advancement opportunities, experience working with a diverse team, great customer service and sales experience in a retail setting, a free second language program (English or Spanish), and very flexible schedules.", "Cons": "There are no benefits offered, the pay is low, customers are frequently rude and management largely disregards employee complaints, your work experience depends heavily on your particular store's management (which is often unprofessional), and the stores I've worked at don't actually train new crew members before putting them to work."}, "2": {"Date": " Nov 13, 2017", "Summary": "\"Great place to work!\"", "Pros": "everyone so friendly, make lots of good memories, perfect for after school.", "Cons": "none really, all around great place!"}, "3": {"Date": " Nov 13, 2017", "Summary": "\"Iwill give it a tums up\"", "Pros": "Its a great place to work at", "Cons": "Great Place to work at"}, "4": {"Date": " Dec 18, 2017", "Summary": "\"HR administrator\"", "Pros": "interesting mix of people and ownership", "Cons": "pay, benefits, people, lack of bonus"}, "5": {"Date": " Nov 27, 2017", "Summary": "\"Gave me management experience\"", "Pros": "I was promoted to a manager at 18. They offered tuition reimbursement while I was in school. Gave me good management experience.", "Cons": "The customers honestly is what made this job so hard. Very impatient and non understanding and very rude at times."}, "6": {"Date": " Nov 28, 2017", "Summary": "\"Crew member\"", "Pros": "The people I worked with was great and taught me how to deal with demanding people and great work ethics in the food industry", "Cons": "The job was very demanding and exhausting and most of the time I was not treated well by customers"}, "7": {"Date": " Nov 26, 2017", "Summary": "\"Cashier\"", "Pros": "Not bad for fast food place", "Cons": "Pay was low and time off was hard to get"}, "8": {"Date": " Nov 26, 2017", "Summary": "\"Not very good\"", "Pros": "Its a fast pace job, so time goes by quick, also you can become friends with other co-workers. And get to multitask a lot.", "Cons": "Where I worked most of the time the restaurant was understaffed, or employees will go to restroom for like 5 minutes or take a long smoke break. Also when we weren't understaffed most of the crew wouldn't work or only knew one thing and refused to learn new things."}, "9": {"Date": " Nov 27, 2017", "Summary": "\"It was okay\"", "Pros": "Some fun people that are in a similar position as you", "Cons": "I obtained a warning from by employer because I was openly discussing my wage"}}