{"0": {"Date": " Sep 29, 2016", "Summary": "\"McDonald's\"", "Pros": "Employees that work there are very fun to work with and the overall casual environment is great.", "Cons": "The pay is quite low for what is actually expected of employees there, this is mostly for people looking for a first job experience."}, "1": {"Date": " Sep 28, 2016", "Summary": "\"Not the best\"", "Pros": "Weekly payEasy to move upMoney comes in because of lack of employees they need you to stay", "Cons": "If raises exceed promotion salary then you pay will be the sameNever any peopleHave to do 10 peoples jobs at one end because of the lack CrewBad scheduling techniques ex. Work from 6pm -1am one day to come back at 4am-12pm next day"}, "2": {"Date": " Sep 28, 2016", "Summary": "\"Cashier/crew trainer\"", "Pros": "In Houston. We had a good base pay with increase every 6 months. Flexible hours.", "Cons": "Not customer oriented employee wise. Not fast at ALLL. Managers were rude and unprofessional."}, "3": {"Date": " Sep 28, 2016", "Summary": "\"Cashier\"", "Pros": "The place is clean and nice", "Cons": "-they pay less and the managers can be ignorant"}, "4": {"Date": " Sep 28, 2016", "Summary": "\"Department Manager\"", "Pros": "Upward mobility is very possible in this company who owns upward of 60 McDonalds stores in the Memphis and North Mississippi area.", "Cons": "The company has grown so large that the individual has become lost in the chaos. Under utilization of training programs is prevalent. An under current of politics and personality rather than the appropriate professional judgment seems to rule staffing decisions."}, "5": {"Date": " Sep 13, 2016", "Summary": "\"steady\"", "Pros": "very clean sanitary swept everyday", "Cons": "disrespectful people not nice bad attitude"}, "6": {"Date": " Sep 13, 2016", "Summary": "\"Much better than I thought it was going to be!\"", "Pros": "Very friendly and fun employeesPerfect variety and amount of tasks to doTasks aren't too difficultFree food (one free meal during daily break)Got better at many skills including time management, teamwork, focusing and productivityBecame more adapted to working in a kitchenMy boss was great!Fun!If you love cooking, you will like it. :)", "Cons": "It can get extremely busy, but I think that depends on the location of the restaurant.You have to really watch what you are doing being and working in the kitchenSome customers can be hard to deal with (rarely had a bad customer)"}, "7": {"Date": " Sep 13, 2016", "Summary": "\"Corporate Needs to take OVER\"", "Pros": "Good way to learn Business management.", "Cons": "Not everything that glitters is gold"}, "8": {"Date": " Sep 14, 2016", "Summary": "\"Customer Service Manager\"", "Pros": "a lot of hours more money", "Cons": "no cons everything good ."}, "9": {"Date": " Sep 14, 2016", "Summary": "\"Construction Coordinator\"", "Pros": "Excellent company. Excellent benefits. Great people.", "Cons": "A lot of people got laid off"}}