{"0": {"Date": " Jun 20, 2016", "Summary": "\"Hated it\"", "Pros": "Paycheck is the best thing there is about working at this place. I just needed something to hold me over until I found something else.", "Cons": "Management needs training, co-workers are young and can be very rude and disrespectful. But some of them are really eager to learn and that is a good thing."}, "1": {"Date": " Jun 18, 2016", "Summary": "\"Meh\"", "Pros": "free uniforms, free food, pretty decent number of hours, pretty cool management", "Cons": "overnight hours, especially on weekends/school breaks/summer, yielded every high school and college kid within 100 miles. Obnoxious, whiny, trashed the restaurant. Made for double the cleaning on top of the all the cleaning overnight shift always has to do. Very thinly staffed so service person is at back window, presenting, and front counter. And regularly scheduled cleaning which includes tearing apart the fry station and completely stocking, wiping down, sweeping, and mopping the lobby. Hispanic managers played favorites."}, "2": {"Date": " Jul 9, 2016", "Summary": "\"Ew\"", "Pros": "Free food, though only for management.", "Cons": "They don't give out raises properly. If we got paid enough for what we did it wouldn't be such a bad job."}, "3": {"Date": " Jul 10, 2016", "Summary": "\"Crew Member\"", "Pros": "New experience, good learning opportunity", "Cons": "Bad outcome, tough work shifts"}, "4": {"Date": " Jun 18, 2016", "Summary": "\"Cashier\"", "Pros": "Cheap discounted food, it is a quick relatively easy way to make some spending money for both high school and college students", "Cons": "the smell of frying oil gets you nauseous and queasy; times can be boring and times can hectic especially during meal time"}, "5": {"Date": " Jun 18, 2016", "Summary": "\"Cashier\"", "Pros": "there are none really it was horrible", "Cons": "lack of management, not enough hours given"}, "6": {"Date": " Jun 3, 2016", "Summary": "\"Crew Trainer\"", "Pros": "There is a lot of room for you to grow... pay is pretty basic, but the work is fairly easy, tons of pushing buttons and simply remembering the training.", "Cons": "There is a lot of drama at stores, mainly because there are a lot of young people who work there, but for the most part its goes by too fast to notice very much. `"}, "7": {"Date": " Jun 3, 2016", "Summary": "\"Decent\"", "Pros": "Humble people to work with and I had good experience with customer service and fast food. Decent raises every 6 months.", "Cons": "Not enough pay, not a career option for me. They didn't seem to pay attention to actual work ethic but the people's looks more of."}, "8": {"Date": " Jun 17, 2016", "Summary": "\"Shift Manager\"", "Pros": "Great Benifits, Friendly Staff, organized,fast pace", "Cons": "Sometimes customers are extremely rude"}, "9": {"Date": " Jun 17, 2016", "Summary": "\"Cashier\"", "Pros": "Managers were so nice, great team.", "Cons": "Costumers are really rude, low salaries and hours."}}