{"0": {"Date": " Apr 4, 2016", "Summary": "\"Maintenence\"", "Pros": "It's fast paced so time goes by quickly.", "Cons": "I don't get paid enough or get enough hours to make my bills."}, "1": {"Date": " Apr 4, 2016", "Summary": "\"crew trainer\"", "Pros": "Half priced food, not much else", "Cons": "Horrible place, Poor Management Dirty, horrible Shifts"}, "2": {"Date": " Mar 14, 2016", "Summary": "\"its a job\"", "Pros": "The only pros working for this McDonalds is that you have to be really dumb or really lazy to be fired. Scheduals are flexable.", "Cons": "No benifits, low pay, no opprotunity for advancement if your General manager doesn't like you,"}, "3": {"Date": " Mar 15, 2016", "Summary": "\"If you need money, It's bearable\"", "Pros": "Minimum wage is up now", "Cons": "Lot's of workHot Summers with faulty equipment"}, "4": {"Date": " Feb 28, 2016", "Summary": "\"McDonalds - Shift Manager\"", "Pros": "-Free meals (depends on owner)-Great experience for resume (lot's of talking points)", "Cons": "-General Managers burn out fast and change frequently-\"Lifers\" can become annoying if they are bad/mean individuals-If you aren't making the schedules your shifts are likely prone to be short individuals making the shift an experience from hell"}, "5": {"Date": " Feb 29, 2016", "Summary": "\"Good for a college students\"", "Pros": "Easy to move up, lots of opportunity", "Cons": "Long hours, very busy all the time"}, "6": {"Date": " Mar 12, 2016", "Summary": "\"Paralegal\"", "Pros": "Eligible for Annual Bonuses, Sabbatical, Vacation Time", "Cons": "Company has and continues to move some functions overseas. No longer a concern about employee development. No longer an innovative leader with unique culture and value system. Just kind of following with what everyone else is doing"}, "7": {"Date": " Mar 13, 2016", "Summary": "\"from my POV.\"", "Pros": "Fast pace, nice customers, nice coworkers", "Cons": "no room for growth, young coworkers are hard to work with. They don't stay focused."}, "8": {"Date": " Mar 13, 2016", "Summary": "\"Crew\"", "Pros": "Working at the McDoanld's in Park city was an excellent experience while still attending high school. They were very flexible with the schedule and everyone was very friendly.", "Cons": "Didn't like the fact that they changed the employee lunch menu; one used to be able to order any meal on the menu. Now they limited the menu to cheaper burgers like mcchicken etc.. Also, after you are done working you will feel very greasy."}, "9": {"Date": " Apr 4, 2016", "Summary": "\"disorganized\"", "Pros": "Staff are cool free lunch", "Cons": "No organization over worked no consistency"}}