{"0": {"Date": " Jan 19, 2016", "Summary": "\"Great start\"", "Pros": "Great way to start off learning customer service and patience.Great way to teach hard work values.Actually great career path", "Cons": "Its McDonald's so there is the stereotype of working there...Sometimes you can encounter very immature managers.Hiring prospects can be very difficult."}, "1": {"Date": " Dec 28, 2015", "Summary": "\"McDonalds doesn't pay enough, even for people just starting\"", "Pros": "Learn valuable patience skills and how to deal with customers", "Cons": "You don't get paid enough to deal with drive-thru windows or irate customers"}, "2": {"Date": " Dec 13, 2015", "Summary": "\"First Job Out of High School\"", "Pros": "The people I worked with were fantastic, I really just enjoyed the job most based on my coworkers. I was given alot of hours when asked for them because I showed up reliably. The customers can be a pain, but that's to be expected", "Cons": "I was always called in because people never showed up to work, I could have declined to come in I guess, but then my hours may have been cut."}, "3": {"Date": " Dec 13, 2015", "Summary": "\"Great First Job\"", "Pros": "Depending on where you work, free food, great experience, you learn a lot, customer service and multitasking experience.", "Cons": "There was a couple toxic employees but other than that I made great friends who I still talk to today and go to school with."}, "4": {"Date": " Dec 10, 2015", "Summary": "\"Human Resources\"", "Pros": "Great company to work, Great benefits with comparable compensation with bonus opportunity. Many development opportunities. Ever changing environment with policy, procedure, product. Loved the challenges and change leadership.", "Cons": "You must have the willingness/eagerness to thrive in a challenging/changing environment."}, "5": {"Date": " Dec 14, 2015", "Summary": "\"I love it!\"", "Pros": "They are very flexible with me", "Cons": "You smell like grease at the end of the day"}, "6": {"Date": " Dec 27, 2015", "Summary": "\"AGM\"", "Pros": "Excellent Pay and benefits for salaried employees.", "Cons": "Quick service in general is a tough business. Mcdonalds, being an industry leader, is no different."}, "7": {"Date": " Dec 28, 2015", "Summary": "\"McDonald's\"", "Pros": "Friendly staffSteady hoursFree meals once per shiftFun working environment when not understaffed", "Cons": "Low pay for managementNo vacationExpectations too high for low payNo incentives or bonuses"}, "8": {"Date": " Dec 12, 2015", "Summary": "\"McDonalds Review\"", "Pros": "It was a great enviroment to work at for awhile. The McDonalds I worked at had nice co-workers. These are the pros of working there.", "Cons": "There aren't too many cons about working at McDonalds. I only did the job for a summer and didn't have enough time to see any negatives."}, "9": {"Date": " Dec 12, 2015", "Summary": "\"crew\"", "Pros": "flexible hoursokay people to work for", "Cons": "low pay for what you have to deal with but hey its mcdonaldsbarely get rasies"}}