{"0": {"Date": " May 10, 2016", "Summary": "\"Manager\"", "Pros": "Sometimes sometimes bad sometimes so so Fun", "Cons": "Company is very very Hard"}, "1": {"Date": " May 24, 2016", "Summary": "\"Department Manager\"", "Pros": "Flexible work hours for those in school or with facilities", "Cons": "Rude associates who do not know how to show respect"}, "2": {"Date": " May 24, 2016", "Summary": "\"McDonalds part time\"", "Pros": "decent paydiscount foodflexiblemake friendseasy work", "Cons": "long hoursoften hot by the grillboringrude customersno breaks"}, "3": {"Date": " May 25, 2016", "Summary": "\"Good job for students\"", "Pros": "Flexible schedule. Learn basic job skills (time management, self control, customer service, working as a team). Ok place to work for a little while.", "Cons": "No benefits, retirement, etc. they consider reduced meal prices and free uniforms a benefit. Pay you just enough to keep you around until one day you realize you make too much to leave your job, but have no retirement or insurance. Also made to feel guilty when taking earned vacation time"}, "4": {"Date": " May 9, 2016", "Summary": "\"Great, fun place to work- decent pay.\"", "Pros": "Flexible schedule, very lenient management when time off is needed. Meal discounts, fun, fast paced. Advancement opportunities fall to your feet, practically.", "Cons": "Pay starts very low, but raises and promotions rise like crazy!"}, "5": {"Date": " May 10, 2016", "Summary": "\"Senior Store Manager\"", "Pros": "Great environment to teach and work with many people.", "Cons": "The stress and lack of ownership or pride in most employees jobs."}, "6": {"Date": " May 22, 2016", "Summary": "\"Not a place to be right now\"", "Pros": "exciting place to work with a great brand.", "Cons": "The culture change is so extreme .. it has gone from caring for their people to treating them poorly especially those over 40."}, "7": {"Date": " May 23, 2016", "Summary": "\"MacShack\"", "Pros": "Flexible HoursGood People to work with", "Cons": "Call insNo call no shows"}, "8": {"Date": " May 23, 2016", "Summary": "\"Cashier\"", "Pros": "good food, people, and work environment", "Cons": "pay could be better, but overall very good"}, "9": {"Date": " May 23, 2016", "Summary": "\"Not the same corporate office any longer...\"", "Pros": "Was a good company until the latest CEO took over", "Cons": "Used to be a McFamily but now the Brits have taken over and its make the most money for ourselves & shareholders while laying the employees off."}}