{"0": {"Date": " Jul 7, 2017", "Summary": "\"Fine\"", "Pros": "Working here was okay, easy work, long hours", "Cons": "Not many cons, long hours and difficult scheduling"}, "1": {"Date": " Jun 23, 2017", "Summary": "\"I <3 Dickinson\"", "Pros": "Great culture, competitive pay, excellent benefits, incredible mission", "Cons": "Relatively isolated geographically, but cost of living is low"}, "2": {"Date": " Jul 28, 2017", "Summary": "\"Manager\"", "Pros": "There is no pros to working here", "Cons": "Pay is not worth the stress"}, "3": {"Date": " Jul 7, 2017", "Summary": "\"High school\"", "Pros": "It pays well for fast food and you have benefits available", "Cons": "It's like high school all over again , the groups ,the back stabbing and the all the talking out the side of there necks about EVERYONE. They act like they like you and then boom your the drit on the bottom of there shoe."}, "4": {"Date": " Jul 6, 2017", "Summary": "\"Manager\"", "Pros": "Friendly work environment , Fast paced", "Cons": "Poor scheduling, lack of workers"}, "5": {"Date": " Jul 6, 2017", "Summary": "\"Good beginner job\"", "Pros": "-gaining some type of experience in the fast-food restaurant chain-learning to work with others", "Cons": "-tiring work for minimum wage"}, "6": {"Date": " Jul 6, 2017", "Summary": "\"It was an okay first job experience didn't really feel like a job due to how unprofessional the setting was\"", "Pros": "Discounted foodSometimes free food in the kitchen if you sneak it without the GM seeingFree drinks when GM is gone", "Cons": "It's a hot environmentYou get acne because of all the grease from cooking or the heat from the coffeeYou smell terrible and feel terrible after"}, "7": {"Date": " Jul 7, 2017", "Summary": "\"It was ok up and till...\"", "Pros": "Great incentives, good pay, great programs", "Cons": "They don't recognize your potential. They hire others who are not worthy enough to be in those positions. They over look your requests for hours."}, "8": {"Date": " Jun 22, 2017", "Summary": "\"Great Place to be with good people\"", "Pros": "strong management and good co workers", "Cons": "fast paced and high stress during rushes"}, "9": {"Date": " Jun 22, 2017", "Summary": "\"Sales\"", "Pros": "Great Management, Good benefits, easy job", "Cons": "Rude customers, not enough hours"}}