{"0": {"Date": " Aug 17, 2017", "Summary": "\"Team member/ cashier\"", "Pros": "good first job, if management likes you you'll get good hours, always hiring", "Cons": "lots of favoritism, call in for a shift and you usually get your hours cut on the next schedule they make, get sick during your shift and you're usually stuck there"}, "1": {"Date": " Aug 17, 2017", "Summary": "\"Great Place For Young Adults And Students\"", "Pros": "Very Good Place To Work. Schedules And Hours Ate Good And They Have Flexible Scheduling Techniques. Very Friendly And Professional.", "Cons": "Nothing The Job Has Been Great"}, "2": {"Date": " Aug 31, 2017", "Summary": "\"Great Starter Job\"", "Pros": "Cool co-workers (Sometimes)Better pay then other fast food restaurantsPerfect starter job", "Cons": "Managers aren't equally trained, so you can have a good manager one day and a terrible manager the next.OverwhelmingA lot of hiring and firing all at onceManagement isn't terrible, but a lot needs to be fixedFranchise Owner hiring terrible people to look after his stores."}, "3": {"Date": " Aug 31, 2017", "Summary": "\"Rudy Garcia\"", "Pros": "Mcdonalds is a good job to start with. It will help with experience and patience. It will also help a young teen be independent.", "Cons": "There are going to be customers that get mad or complain but you cant let it effect on how well you do your job."}, "4": {"Date": " Aug 31, 2017", "Summary": "\"Crew Trainer\"", "Pros": "Decent experience and helped build my resume", "Cons": "Terrible pay and management is awful."}, "5": {"Date": " Aug 31, 2017", "Summary": "\"Fun but upper management is not good\"", "Pros": "Great people great place to grow and become more independent", "Cons": "management became very disrespectful once they got their manager uniforms"}, "6": {"Date": " Aug 31, 2017", "Summary": "\"It was nice for a while, but after I moved to 2nd shift with school everything went down hill.\"", "Pros": "They are very flexible with your schedule and do have a lot of good managers working there. I found it really fun to work there on the weekends with the morning crew.", "Cons": "If you are working there with school on 2nd shift you won't be able to have a social life, and you will realize how bad some of the managers on 2nd shift are."}, "7": {"Date": " Sep 1, 2017", "Summary": "\"Decent First job\"", "Pros": "Flexible hours if the management likes you", "Cons": "Hectic work environment that is fast paced"}, "8": {"Date": " Aug 16, 2017", "Summary": "\"Crew Member\"", "Pros": "Great people, Good environment, yummy food!", "Cons": "Not enough employees in work place"}, "9": {"Date": " Aug 16, 2017", "Summary": "\"Crew member\"", "Pros": "Awesome work schedule, for students", "Cons": "Not a steady schedule but secure"}}