{"0": {"Date": " Mar 27, 2018", "Summary": "\"Great\"", "Pros": "great people to work with", "Cons": "tough customers to deal with"}, "1": {"Date": " Mar 27, 2018", "Summary": "\"Shift Manager\"", "Pros": "It gave me a good opportunity to work with the people and realize that I enjoy customer service. It was a good place for a 1st time job.", "Cons": "Sometimes my supervisor lacked the skills to handle his job. He was promoted too quickly and the job was overwhelming to him."}, "2": {"Date": " Mar 12, 2018", "Summary": "\"Cashier\"", "Pros": "Get to meet a lot of people and learn how to deal with different people", "Cons": "nothing negative i can really say about it :)"}, "3": {"Date": " Mar 13, 2018", "Summary": "\"Flexible schedules, highly organized system of management, opportunities to grow as a person, and (for some) advance.\"", "Pros": "I love the fact that I can choose my own hours and leave time free to pursue other interests in my free time.", "Cons": "The pay is not great. It is not an intellectually stimulating environment if you are looking for that."}, "4": {"Date": " Mar 27, 2018", "Summary": "\"Cook\"", "Pros": "Good hours, nice people, and good benefits.", "Cons": "Hard work, dirty environment, and bad customers."}, "5": {"Date": " Mar 27, 2018", "Summary": "\"Manager\"", "Pros": "Free food and make friends", "Cons": "My sister was manager for 25 years and took advantage of free meals. But she died at 63 from coronary problems. Her doctor said her veins/arteries looked like they were filled with coral. Of course she smoked too."}, "6": {"Date": " Mar 27, 2018", "Summary": "\"cashier\"", "Pros": "Great people to work with.", "Cons": "Bad management style in the main office."}, "7": {"Date": " Mar 28, 2018", "Summary": "\"The management and the crew\"", "Pros": "You get a free meal with every shift you work over 4-5 hours and an employee discount of half off. Crew members are usually really great and fun.", "Cons": "The customers can be extremely rude and disrespectful and your employee discount can only be used at your place of employment"}, "8": {"Date": " Mar 28, 2018", "Summary": "\"McDonald's\"", "Pros": "I loved greeting all customers.", "Cons": "I hated working with the employees and higher powers."}, "9": {"Date": " Mar 12, 2018", "Summary": "\"Crew\"", "Pros": "welcoming staff and was willing to work with my schedule", "Cons": "busy environment, must be willing to work"}}