{"0": {"Date": " Dec 30, 2017", "Summary": "\"idk\"", "Pros": "Working with people I knew. I also went to school with most of the kids.", "Cons": "Having fights. They would threaten to put you in the deepfryer"}, "1": {"Date": " Dec 30, 2017", "Summary": "\"Best job\"", "Pros": "Best job that I’ve had so far but looking for more in life", "Cons": "Really loud, due to all the beeping and people"}, "2": {"Date": " Feb 5, 2018", "Summary": "\"Not great\"", "Pros": "Provides the ability for flexible scheduling", "Cons": "Pay, work, No Advancement , no Benifets"}, "3": {"Date": " Jan 14, 2018", "Summary": "\"Crew\"", "Pros": "Flexible work, great for high school students", "Cons": "Not much money, or hours to live on"}, "4": {"Date": " Jan 13, 2018", "Summary": "\"Crew Member at McD\"", "Pros": "Free food for break, friendly atmosphere among coworkers, and experience in a restaurant setting.", "Cons": "Often times if management has anything to do or the store is busy they'd rather handle that than give you your scheduled breaks on time, some customers can be horrendous, and at my store they were poor about scheduling shifts with some of us."}, "5": {"Date": " Dec 27, 2017", "Summary": "\"Great, but tiring\"", "Pros": "good employers and managerspay rate is goodflexible schedule, when school starts", "Cons": "customers who \"forget\" their money and walk out of the storefake bills and money taken off pay checkhectic days with long orders"}, "6": {"Date": " Feb 3, 2018", "Summary": "\"bad\"", "Pros": "food is kinda weird and very oily", "Cons": "gross working place y know"}, "7": {"Date": " Dec 28, 2017", "Summary": "\"Nice job\"", "Pros": "Perfect for the first timers", "Cons": "Nothing much except wished there was upward mobility"}, "8": {"Date": " Feb 2, 2018", "Summary": "\"1/10\"", "Pros": "The job itself was fairly easy.", "Cons": "The manager was racist, I worked over 40 hours a week every week but could not get put to full-time because they did not want to give anyone benefits, they do not care about employees what so ever. Also made me work off the clock."}, "9": {"Date": " Jan 12, 2018", "Summary": "\"McDonald's is what you'd expect\"", "Pros": "Money, if you're desperate. Easy to get part time work.", "Cons": "Have to be desperate, definitely causes burn out with the kind of customers you have to interact with"}}