{"0": {"Date": " Jan 12, 2017", "Summary": "\"Good\"", "Pros": "Nice people good hours. Takes time to listen. Good management. Convienent.", "Cons": "High turnover. Too many bosses. Need better meal plan. More local involement"}, "1": {"Date": " Jan 13, 2017", "Summary": "\"Looking for a part-time job\"", "Pros": "Work and study at the same time, to complete my Highschool !", "Cons": "It can be a little bit hard working while you're studying"}, "2": {"Date": " Jan 13, 2017", "Summary": "\"Great place people\"", "Pros": "You meet different people in the industry and you move up the ladder. Great experience", "Cons": "Late nights. Hostile customers."}, "3": {"Date": " Jan 26, 2017", "Summary": "\"Great time to be alive\"", "Pros": "Fun way to spend a summer", "Cons": "Not great prospects, wouldn't go back"}, "4": {"Date": " Jan 26, 2017", "Summary": "\"It's McDonald's. Don't get your hopes up.\"", "Pros": "Some of the people you meet are really great", "Cons": "Some of the people you meet are really horrible"}, "5": {"Date": " Jan 26, 2017", "Summary": "\"McD's\"", "Pros": "Free meals every shift and discounted meals if you buy.", "Cons": "Low pay, most people that work there don't know what teamwork means. Managment plays farvortism to certian employees."}, "6": {"Date": " Jan 27, 2017", "Summary": "\"Its ok\"", "Pros": "Flexible hours, discount on food, managers work well with your schedule, easy work.", "Cons": "Lazy workers, need more swing managers"}, "7": {"Date": " Jan 11, 2017", "Summary": "\"They're very fast when it comes to an order. They also smile at their customers and make them feel at home.\"", "Pros": "The staff treats everyone respectfully and they're always there to help and make a difference.", "Cons": "I don't believe I can complain at all. I feel at home when I'm there."}, "8": {"Date": " Jan 11, 2017", "Summary": "\"Manager\"", "Pros": "Great environment and fun atmosphere. Challenging wok and great experience.", "Cons": "The pay is too low."}, "9": {"Date": " Jan 11, 2017", "Summary": "\"Amazing experience never thought I would have liked it but it's an amazing first job!\"", "Pros": "Flexible Hours, Great management, they work with you and teach you what you need to know, you get to make a customers day by putting a smile on heir face!", "Cons": "Listening to managers coming complain, some co workers don't fully do their work right or fail to show up to work so the load rests on everyone else including you!"}}