{"0": {"Date": " Jan 26, 2017", "Summary": "\"Good for first job, Bad for anyone else.\"", "Pros": "You learn entry level service and fast food cooking. You gain experience. There is opportunity for promotion ( I was crew trainer after 8 months) and could of been manager after a year pretty easily. They do work around your schedule and give you the time you need off usually unless a lot of people put in for the same dates.", "Cons": "Minimum wage start and .10 cent raises. Promotions grant you less than a dollar raise. The pay is terrible for the amount of work you actually have to do. You can be overwhelmed at times do to high amounts of orders (example: 4 bundle boxes back to back with 10+ orders on screen. yes... that happened.) You have little to no time to breath because everyone is rushing everyone and people make your job harder because they do not care. management is the absolute worst... They pick favorites, are lazy, and lose their cool way to easily."}, "1": {"Date": " Jan 27, 2017", "Summary": "\"Not bad for my first job\"", "Pros": "Free food during breaks and discounts on the products off the clock", "Cons": "Rude customersMinimum wageNot a great location"}, "2": {"Date": " Jan 27, 2017", "Summary": "\"Its was a bad experience\"", "Pros": "They are willing to give hours if you work and show up on time so the hours was good", "Cons": "It was bad Un-professional the manger are very rude its very unorganized its not good at all only good thing was the Hours"}, "3": {"Date": " Jan 25, 2017", "Summary": "\"Crew trainer\"", "Pros": "The hours were flexible and i worked with a good group of people aside from managment", "Cons": "poor managment. I was there for over 2 and a half years and only got a 30 cent raise when i was practically running the kitchen the majority of the time."}, "4": {"Date": " Jan 25, 2017", "Summary": "\"OK I guess\"", "Pros": "-Really great place to be seventeen years old-Top notch minimum wage-Bathrooms could be worse I guess", "Cons": "-Store color scheme can get grating-Kids are certainly a downside-Probably won't advance much up this ladder"}, "5": {"Date": " Jan 10, 2017", "Summary": "\"food service worker\"", "Pros": "friendly co-workers , discount , food,", "Cons": "Typical corporate monster, regional/corporate management is almost non existent,management,customers,cleaning, breaks,days off"}, "6": {"Date": " Jan 10, 2017", "Summary": "\"Good stuff!\"", "Pros": "They had great service! \"I'm loving it!\"", "Cons": "They really didn't have any cons to as very good"}, "7": {"Date": " Feb 15, 2017", "Summary": "\"Cashier\"", "Pros": "Free food and fun coworkers", "Cons": "I smell like food all of the time, get sent home early if it's slow"}, "8": {"Date": " Jan 25, 2017", "Summary": "\"Across 3 franchises in 2 states, terrible cultures corrosive to personal integrity & one's own health\"", "Pros": "Short-term or long-term work depending on opportunityRelatively flexible hoursSlightly different culture at each store", "Cons": "Too many to list for this busy professional"}, "9": {"Date": " Jan 25, 2017", "Summary": "\"Good and bad points\"", "Pros": "They supplied me with a uniform free of charge and a couple of the managers were very understanding and appreciative, although usually not at the same time. When I got sick they were understanding.", "Cons": "No holiday overtime wages due to it being a non-franchised location, much of the staff I worked with during the evenings were young and they had a lot of trouble finding employees willing to work at that location. Highly understaffed. The window service was often rude to the customers, there was a disconnect between employees and most managers. On Christmas we were given an extremely understaffed crew, no holiday pay - just regular hourly, and due to being one of the only fast food places open completely used up and exhausted beyond our means. Our reward was a coupon that expired new years and a santa hat and a cheap computer bag or blanket instead of holiday pay. Many of the managers were very rude, although not all. When I asked to transfer positions I was told it was ok and I never heard from them again. I was hired being told I would crosstrain on all positions but they only kept me working in the kitchen which I could not continue due to health concerns."}}