{"0": {"Date": " Mar 13, 2018", "Summary": "\"It’s a very fast past environment to work in.\"", "Pros": "Lots of shift hours, if you want it.", "Cons": "Not much communication between employees and management, rude customers."}, "1": {"Date": " Mar 14, 2018", "Summary": "\"Draining but rewarding.\"", "Pros": "Flexible schedule, good natured people, fast paced, helps with education, benefits, health insurance, good upper management, good starting job.", "Cons": "Salary and promotions, long hours, not enough pay, no 401k, minimum wage."}, "2": {"Date": " Feb 27, 2018", "Summary": "\"Director\"", "Pros": "Great pay and benefits to employees", "Cons": "Poor long-term outlook for future"}, "3": {"Date": " Mar 13, 2018", "Summary": "\"Swing manager\"", "Pros": "The management was very helpful. Easy to move up in your career", "Cons": "I had the worst customers in my life."}, "4": {"Date": " Feb 26, 2018", "Summary": "\"What you'd expect\"", "Pros": "Good experience depending on your coworkers.", "Cons": "Some problems with the job, what you'd expect from any food service position"}, "5": {"Date": " Feb 26, 2018", "Summary": "\"Crew member\"", "Pros": "Loved working directly with other employeesFast paced, rarely boring", "Cons": "Work with a careless manager then the whole shift is a mess."}, "6": {"Date": " Feb 26, 2018", "Summary": "\"Management sucked but not bad for first job\"", "Pros": "Work is not too bad for high school/college students and a lot of hours are available.", "Cons": "Managed by people who do not know how to deal with customers or employees, can get very hectic."}, "7": {"Date": " Feb 26, 2018", "Summary": "\"Crew\"", "Pros": "Fast environment and get to interact with new customers on a daily basis.", "Cons": "Schedule is always short in staff and they are always fixing hours at the last minute."}, "8": {"Date": " Feb 26, 2018", "Summary": "\"Average\"", "Pros": "Competitive Pay, Benefits, Great Opportunities", "Cons": "Rude Customers Can Get To You Fast"}, "9": {"Date": " Feb 27, 2018", "Summary": "\"grill cook\"", "Pros": "good teamwork biulding skills,hand eye cordnation", "Cons": "too fast paced, too many jobs not anuf people"}}