{"0": {"Date": " May 12, 2017", "Summary": "\"My time at Mickey D's\"", "Pros": "Great pay and great staff.", "Cons": "Really long hours and customers can be a pain in the rear end."}, "1": {"Date": " May 13, 2017", "Summary": "\"Floor Supervisor\"", "Pros": "Great customers, great crew, fun place to work, flexible schedule.", "Cons": "Limited opportunity for advancement unless you're willing to be available for a schedule that includes any shift 24/7. Low pay."}, "2": {"Date": " May 26, 2017", "Summary": "\"Overall\"", "Pros": "Flexible hoursgood teamwork skills", "Cons": "Mostly depends on management, although not all are bad some managers may be too laidback and will not help"}, "3": {"Date": " May 26, 2017", "Summary": "\"Cashier\"", "Pros": "Nice coworkers, good salary, flexible hours", "Cons": "Rude people, manager, dirty"}, "4": {"Date": " May 26, 2017", "Summary": "\"Swing Manger\"", "Pros": "Fun to work around people you know, its easy40 hoursgood pay for a fast food", "Cons": "if your not a people person then this job isn't for you"}, "5": {"Date": " May 26, 2017", "Summary": "\"Drive thru\"", "Pros": "Meeting People, you also would get regulars that you end up talking to . Usually you can guess the amount of the meal.", "Cons": "Fast Pace. The per limit car clock is everything and often can interfere with providing solid customer service."}, "6": {"Date": " May 26, 2017", "Summary": "\"Review\"", "Pros": "Fast paced, time goes by extremely fast, free food, plus discount for family and friends, work great with school schedule.", "Cons": "Very rude customers, unprofessional staff, staff spoke primarily Spanish around each other although they were all fluent in english, made me feel unwelcome."}, "7": {"Date": " May 27, 2017", "Summary": "\"Mcdonalds has familiar roots\"", "Pros": "They work well together, fresh product out put", "Cons": "They toss to much food away, as well as cheat on there drive times."}, "8": {"Date": " May 11, 2017", "Summary": "\"McDonald's is a great place to work...\"", "Pros": "- Their benefits package is the best I've seen so far.- On the corporate side, there are MANY opportunities for growth.", "Cons": "- Can't think of any as I loved working there."}, "9": {"Date": " Jun 16, 2017", "Summary": "\"Full of Empty Promises\"", "Pros": "Your team becomes your family if you're there long enough. Free or half off meals depending on whether your store hits food cost. Lots of hours depending on your availability.", "Cons": "No one makes sure that employees do what they're supposed to before shift change. Promises of promotion that never come to fruition even if you have done your books. Failed occurrence system. Bend over backwards for employees that they could do without while screwing the hardworking and devoted employees. Health insurance sucks. No paid time off to full time employee under management. Biased and sexist raises."}}