{"0": {"Date": " Oct 29, 2017", "Summary": "\"Crew trainer\"", "Pros": "The pay is nice and they work with your hours", "Cons": "There is always a ton of unnecessary drama"}, "1": {"Date": " Nov 12, 2017", "Summary": "\"Cashier\"", "Pros": "Good training, opportunities for advancement", "Cons": "Low pay, don't love the uniforms"}, "2": {"Date": " Nov 12, 2017", "Summary": "\"Average Experience\"", "Pros": "Simple jobs, friendly staff and management", "Cons": "customer interaction was pretty bad, though depends on where you work"}, "3": {"Date": " Nov 12, 2017", "Summary": "\"Good first job\"", "Pros": "flexible hoursgood with minors workingfree meal every shift", "Cons": "slow room for growthlow pay"}, "4": {"Date": " Nov 12, 2017", "Summary": "\"Crew Member\"", "Pros": "You learn a lot of things", "Cons": "You get physically and mentally exhausted easily"}, "5": {"Date": " Nov 13, 2017", "Summary": "\"Good Starting Point\"", "Pros": "At McDonald's, you will find a crew that, depending on your manager, can be like a second family. In my own experience, I find work enjoyable just because of the various people that come together to make and deliver food to people while also talking and getting to know one another.", "Cons": "It is not very different each day. The job, no matter where you are, is very monotonous and uneventful. There may be an employee that gets angry and walks out, but the duties seem to get \"locked-in\" after a while and the employee can mostly just assume their station upon clocking in."}, "6": {"Date": " Nov 13, 2017", "Summary": "\"crew member\"", "Pros": "co workers were great. free meal everyday you worked. got my consistent hours every week.", "Cons": "Management went downhill after store manager left. customers were rude 90% of the time. Morning crew were never satisfied with closing cleaning."}, "7": {"Date": " Nov 12, 2017", "Summary": "\"Time Thiefs\"", "Pros": "nice people to work with", "Cons": "management adjusted hours to schedule instead of actual hours worked.promotes the idiots and not the hard workers.NO Raises"}, "8": {"Date": " Oct 28, 2017", "Summary": "\"McDonald’s Job Review\"", "Pros": "Pay was well, worked solid hours", "Cons": "Did not have the nicest coworkers"}, "9": {"Date": " Oct 29, 2017", "Summary": "\"Good place to work\"", "Pros": "Good place to work as your first job. The schedules are flexible.", "Cons": "Can go overboard on getting your schedule wrong."}}