{"0": {"Date": " Mar 7, 2018", "Summary": "\"It's an okay job, especially if it's your first job.\"", "Pros": "They will work with you most of the time on your scheduling and hours. Each store differs but they also offer either a free meal or a discounted meal, from my experience.", "Cons": "When employees won't communicate effectively, it slows down progress. Also, sometimes managers don't schedule enough workers, so when some workers call in, it makes it extremely difficult for those who are already there."}, "1": {"Date": " Mar 7, 2018", "Summary": "\"Great Highschool job\"", "Pros": "Flexible with my school and sport schedule. Meet friendly customers. Free uniforms, frequent raises, opportunity for advancements. Fun work environment.", "Cons": "Some high stress situations with rude customers, give breaks way too early in shift. Many staff do not speak english. Employee discount was taken away. Minimal pay."}, "2": {"Date": " Mar 27, 2018", "Summary": "\"WORST PLACE TO WORK!!!\"", "Pros": "None!! None, none at all.", "Cons": "8 hours standing up, 30 minute break for lunch (the only time you can ever sit down in the whole 8 hour shift), rude staff, very unprofessional atmosphere."}, "3": {"Date": " Mar 7, 2018", "Summary": "\"Cree\"", "Pros": "They are always busy so always something to do.", "Cons": "They treat crew memebers poorly"}, "4": {"Date": " Feb 20, 2018", "Summary": "\"Review\"", "Pros": "The work was very easy.", "Cons": "The scheduling was always messed up."}, "5": {"Date": " Mar 5, 2018", "Summary": "\"Not Really a pleasant place to work\"", "Pros": "Good pay, most other workers are friendly", "Cons": "Some managers can be rude, people get impatient, & using the touch screen for orders can be confusing."}, "6": {"Date": " Mar 5, 2018", "Summary": "\"It's okay\"", "Pros": "It's a good first job", "Cons": "It's just fast food; not really much to expect"}, "7": {"Date": " Mar 5, 2018", "Summary": "\"Crew trainer\"", "Pros": "Good hours, easy work, good starter job", "Cons": "Co workers, owners, no one follows proper protocol and unprofessional unqualified management"}, "8": {"Date": " Mar 6, 2018", "Summary": "\"General Manager\"", "Pros": "You work in a high-pace environment. There is always something to do. The days are full and go by quickly. They do offer good incentives for the employees, they give scholarships to any crew. They offer McdPerks so employees can get discount off everyday purchases.", "Cons": "Though the shifts go by quickly, the hours are not great. You get stuck opening in the early morning or closing late at night. The work-life balance is almost non-existent."}, "9": {"Date": " Feb 18, 2018", "Summary": "\"mcdonalds\"", "Pros": "I love working in fast food. It is a great way to meet and interact with new people everyday.", "Cons": "I was working will in school, so I couldn't get as many hours as I wanted."}}