{"0": {"Date": " Aug 10, 2017", "Summary": "\"Okay, not for everyone\"", "Pros": "great way to learn customer service, dealing with social situations, take care of responsibilities given to you, great way to meet friends and laid back environment if you do what is asked", "Cons": "lazy staff, not many people enjoy their job here, certain managers take advantage of actually being managers and staff slacking off ( mostly crew members )"}, "1": {"Date": " Aug 11, 2017", "Summary": "\"Crew Memeber\"", "Pros": "Creates great problem solving skills . Good time management skills , Creates good fast pace workers. Creates Good Communication Skills .", "Cons": "Very Stressful , Violates Availability"}, "2": {"Date": " Aug 24, 2017", "Summary": "\"Remember it is a fast food restaurant\"", "Pros": "fast past fun free food nice pay paid time off tuition reimbursement free uniforms and more", "Cons": "customers some get out of hand some times also theres a lot of ppl working at once"}, "3": {"Date": " Aug 24, 2017", "Summary": "\"Former Member\"", "Pros": "Worked with your schedule, decent pay rate if it's your first job or need some money to help out family.", "Cons": "In the one I worked at the general manager was a unrealistic, I would say, he expected some things to be done within say 20 minutes when they normally would be finished in 45 minutes even with working fast."}, "4": {"Date": " Aug 9, 2017", "Summary": "\"service crew\"", "Pros": "MacDonald is nice an good restaurants for the people and I will enjoy to work her in MacDonald.thank you", "Cons": "MacDonald is so cleanliness and beautiful restaurant of the world"}, "5": {"Date": " Aug 23, 2017", "Summary": "\"Good for High School Student\"", "Pros": "It depends on management. My gm was really good with scheduling. It's ok for a high school student. I learned to be patient. The only reason that my compensation and benefits is a three is because as a high school student growing up in a middle class family the pay pretty seemed good.", "Cons": "It was really understaffed. I regularly stayed an extra hour or two because of the amount of workers not showing up. Plus there was no overtime."}, "6": {"Date": " Sep 15, 2017", "Summary": "\"bad employment\"", "Pros": "flexable work hours friendly to a point", "Cons": "talk about employees by manager and supervisors"}, "7": {"Date": " Aug 25, 2017", "Summary": "\"Welcome\"", "Pros": "After 6 months of employment employees can qualify for scholarships", "Cons": "You always smell like a French fry and you're always greesy"}, "8": {"Date": " Aug 9, 2017", "Summary": "\"Decent\"", "Pros": "It was laid back as far as the crew workers went. if you work there you get a free crew meal.", "Cons": "Depending on the location, it can get pretty hectic."}, "9": {"Date": " Aug 9, 2017", "Summary": "\"Crew Member at McDonalds\"", "Pros": "Kind staff, enjoyable environment, decent starting pay", "Cons": "Tedious tasks, Customers are not often in a good mood, Too many rule changes that make the job even more tedious"}}