{"0": {"Date": " May 17, 2016", "Summary": "\"Good\"", "Pros": "Great food, good work environment, respectable customers and co workers, and the restaurant always stay busy from morning to night", "Cons": "With the fast pace environment you need to maintain a safe and clean work station to work and preform your daily duties"}, "1": {"Date": " May 17, 2016", "Summary": "\"I'm Lovin It\"", "Pros": "Great employee benefits for me.", "Cons": "Sometimes I couldn't finish my McFlurry in time."}, "2": {"Date": " May 17, 2016", "Summary": "\"Former worker\"", "Pros": "They offer part timeThey have flexible hours", "Cons": "They only pay you part time at the most just under the 40 hours required by law so they won't have to pay you benefits."}, "3": {"Date": " May 17, 2016", "Summary": "\"My first job ever\"", "Pros": "You have a chance to grow/be promoted.Hours start off strongBreak time is your preference, as long as you're not gone too long", "Cons": "Two out of about five or six managers were completely out of line, one liked to snap and call you \"what's-your-face\" and will also turn to other coworkers and speak in Spanish as if I don't understand that she is talking about me.Can have rude customers but that is expected with a job.I was not given a chance to grow. I assume this is because when the company sees who they want to promote then that's who all the hours go to. I started working 40 hours a week during the summer, but then only worked one day a week as I continued to work there."}, "4": {"Date": " May 18, 2016", "Summary": "\"Cashier\"", "Pros": "Free Food and Customer Interactions", "Cons": "Low wages and Smelling like fried oil all day"}, "5": {"Date": " May 18, 2016", "Summary": "\"department manager\"", "Pros": "good knowledge of managing a business", "Cons": "arent very appreciative of the work you do"}, "6": {"Date": " Jun 7, 2016", "Summary": "\"Hate this job more than anything. Always understaffed and overworked\"", "Pros": "Always get enough hours if you're good at your job and get along with the other employees. If you want a lot of hours, they'll call you in often.", "Cons": "Everyone there is in rehab and so anyone who isn't gets stuck on night shift, the customers are some of the rudest I've ever seen"}, "7": {"Date": " May 2, 2016", "Summary": "\"Area manager\"", "Pros": "Fun to work at live management", "Cons": "Things are different for all area managers"}, "8": {"Date": " May 2, 2016", "Summary": "\"McDonalds\"", "Pros": "As long as u have the knowledge and the tools you can be successful", "Cons": "Work hard and do everything that u are told to"}, "9": {"Date": " May 16, 2016", "Summary": "\"Cook\"", "Pros": "Good entry level work for you", "Cons": "Hours are ok to work there"}}