{"0": {"Date": " Mar 28, 2016", "Summary": "\"Sucks, crappy\"", "Pros": "Good French fries and free food.", "Cons": "Not worth the hassle and the time spent working."}, "1": {"Date": " Mar 29, 2016", "Summary": "\"Bad\"", "Pros": "Meeting New People. half price lunch", "Cons": "the pay sucks..managers treated you like a child"}, "2": {"Date": " Mar 13, 2016", "Summary": "\"Horrible Bosses\"", "Pros": "Seeing and meeting new people everyday. Fast paced, neat, and clean work environment. Great hours and pay for a part-time job.", "Cons": "Inconsiderate of new employees, especially ones that are starting their first job."}, "3": {"Date": " Mar 27, 2016", "Summary": "\"Nice Starter Job\"", "Pros": "Flexible hours, easy to learn, simple tasks.", "Cons": "unprofessional managers, can't call off."}, "4": {"Date": " Mar 28, 2016", "Summary": "\"Cook\"", "Pros": "Free food, don't have to do anything", "Cons": "Bad food, don't get paid anything"}, "5": {"Date": " Mar 10, 2016", "Summary": "\"Still a Great Company to Work For!\"", "Pros": "Overall benefits package, company culture, resources for development and training and the level of talent you are surrounded by. Despite what I say in the cons this still is such an amazing company to work for. Now that I've had an opportunity to work other places I've come to really appreciate what this company offered while I worked there.", "Cons": "Substantial changes in leadership have caused such a loss in direction for employees, uncertainty about their professional futures, decrease in employee morale due to layoffs."}, "6": {"Date": " Apr 16, 2016", "Summary": "\"Never get off on time\"", "Pros": "Nice people that work there", "Cons": "You never get off on time as it is written on your schedule"}, "7": {"Date": " Mar 12, 2016", "Summary": "\"Don't make career from this\"", "Pros": "Good work experience. Good training experience. Possibility to get great managerial training if you would like, and get paid for it.", "Cons": "Supposed to receive raise twice a year, that does not happen. In certain circles, like mine, people in higher positions cheat you out of your raises. They go back on their word constantly, and then blame your actions when you call them out on it. I have been cheated out of two raises, each a quarter apiece. It may not seem like much, but that adds up over the years."}, "8": {"Date": " Mar 26, 2016", "Summary": "\"Part-Time Crew Member\"", "Pros": "Very flexible hours. It is great for a student whose in a lot of clubs/volunteers as days off are easy to come by. If you work well, which isn't very hard to do, there is a pay raise every 6 months or so. Can easily pay more than the state's minimum wage. The people--the customers, the managers, the coworkers-are for the most part very nice.", "Cons": "The uniform gets very dirty very quickly, as in, this is a very messy job. You can get difficult customers. The store will be super empty and then all of sudden 20 cars and 20 people come through the drive-thru and lobby respectively."}, "9": {"Date": " Mar 12, 2016", "Summary": "\"McDonald's\"", "Pros": "I worked the Drive-thru mainly, but in my store, I was one of the few that were cross trained, meaning that I could work any position in the store. Free food, fun coworkers.", "Cons": "Sometimes really busy, sometimes coworkers were lazy. Rarely got out at the time I was scheduled."}}