{"0": {"Date": " Jan 3, 2017", "Summary": "\"Front/back\"", "Pros": "Needed a job to pay bill", "Cons": "Working every weekend and not enough hrs"}, "1": {"Date": " Jan 3, 2017", "Summary": "\"Management\"", "Pros": "I love working at mcdonalds i love getting to know your regular customers.", "Cons": "I just dont like how people abuse their power at work."}, "2": {"Date": " Jan 4, 2017", "Summary": "\"Manager\"", "Pros": "Work/Life Balance and Great Work Culture to work with.", "Cons": "Management is not clear on direction"}, "3": {"Date": " Jan 4, 2017", "Summary": "\"Its okay\"", "Pros": "Good pay for starting teens.", "Cons": "Never given enough hours needed."}, "4": {"Date": " Dec 19, 2016", "Summary": "\"great place\"", "Pros": "It has great co-workers and is a all out great place to work.", "Cons": "It gets tuff on somedays and sometimes the people you work with are not always friendly"}, "5": {"Date": " Jan 25, 2017", "Summary": "\"Manager\"", "Pros": "There's not many pros to list", "Cons": "Not being paid properly for the amount of work and my position."}, "6": {"Date": " Jan 25, 2017", "Summary": "\"Train Wreck!\"", "Pros": "The only reason anyone would work at that location is to further their social agenda.", "Cons": "Was like being in high school all over again... very unprofessional!"}, "7": {"Date": " Dec 19, 2016", "Summary": "\"Paid for college\"", "Pros": "McDonalds offers scholarships and tuition assistance for all employees. I was able to complete my under grad with very little out of my own pocket.", "Cons": "It's a high demand role and 100% varies with who you work under. I have fantastic experiences and horrible ones depending on who I was working under."}, "8": {"Date": " Dec 19, 2016", "Summary": "\"Cashier\"", "Pros": "Good company to work for, loved the customers", "Cons": "Pay could be betterRude customers here and there"}, "9": {"Date": " Dec 19, 2016", "Summary": "\"Mcdonalds experience\"", "Pros": "You learn a lot about management and you get to learn more about yourself and how you can become a better leader.", "Cons": "At my location there is not enough pay, especially for someone that is full time and a manager"}}