{"0": {"Date": " Oct 5, 2017", "Summary": "\"Head Cook\"", "Pros": "Great food discount and some bonuses", "Cons": "long hours with no appreciation"}, "1": {"Date": " Oct 5, 2017", "Summary": "\"Line Cook\"", "Pros": "Free food every shiftCool coworkers", "Cons": "Little payYou smell bad at the end of your shift"}, "2": {"Date": " Oct 6, 2017", "Summary": "\"Steady work, But the pay increases...\"", "Pros": "Steady work, reliable hours, sick days.", "Cons": "Becomes overwhelming when over relied on, pay increases are insignificant and unreliable"}, "3": {"Date": " Sep 20, 2017", "Summary": "\"Crew\"", "Pros": "Nice place . Fast pace meet new people", "Cons": "Benefits ok . Management can be clicky"}, "4": {"Date": " Sep 20, 2017", "Summary": "\"It's McDonald's, what do you expect?\"", "Pros": "It varies on the store for how co-workers communicate, but when you're on friendly terms with everyone, the job becomes much easier to manage. Each shift generally is fast-paced and requires a lot of team effort, which can be a plus if you're a high energy individual. After some seniority, you're often able to pick out your own schedule so long as you're good at your job. There was also an opportunity for a raise once every six months, which is more than other fast food restaurants. During shifts, you get a 50% off discount for food.", "Cons": "Customers, for starters. Even if you're the nicest person in the staff, you're bound to get at least one upset customer per hour. You have to grow a thick skin because managers will yell at everyone when things get frustrating. Turnovers can get crazy, which is awful because it generally means you have to either have a job lined up before you quit or have a manager's personal number for a reference or else soon enough your name gets forgotten. I had 6 managers leave all within a period of 2 months. More often than not, since McDonald's has a low hiring requirement, some of your coworkers won't due what they need to so you often end up doing their job for them on top of your own. A coworker of mine who worked therefor 13 years wouldn't do his dishes for closing, so I (who hadn't worked for them for more than a year) had to pick up after him to make sure we go home before the openers arrive."}, "5": {"Date": " Sep 20, 2017", "Summary": "\"Associate\"", "Pros": "I worked overnight which allowed for me to get the same hours every time I worked. I also had an amazing store manager who wasn't strict but still enforced the rules. He genuinely cared for his employees which lead to a better work environment.", "Cons": "I was originally supposed to be part-time but then I was scheduled about 48 hours a week so I was forced to be full-time. If you work on another shift more than likely your co-workers will be awful."}, "6": {"Date": " Sep 20, 2017", "Summary": "\"Great place to work\"", "Pros": "People are very nice who work thereLobby was always clean and organizedWould make you anything again if it was wrong", "Cons": "Things can get hectic without the right managementThe oil needs to be changed more oftenMore stable schedules would be awesome"}, "7": {"Date": " Sep 21, 2017", "Summary": "\"Pay\"", "Pros": "Fun place to work okay pay", "Cons": "Long hours fast past past low pay"}, "8": {"Date": " Sep 21, 2017", "Summary": "\"Good enviroment\"", "Pros": "very clean, very organized, family environment", "Cons": "customers are rude and grumpy"}, "9": {"Date": " Sep 21, 2017", "Summary": "\"Good work\"", "Pros": "Free lunch, good pay for basic knowledge and no education", "Cons": "Shift changes often, poor communication"}}