{"0": {"Date": " Jun 8, 2016", "Summary": "\"Great\"", "Pros": "Fun place to work, lots of new friends", "Cons": "I have no cons to report"}, "1": {"Date": " Jul 14, 2016", "Summary": "\"Ok place to work\"", "Pros": "Working at McDonald's definitely does not take a lot of brain power.", "Cons": "The pay is obviously very low but it was my very first job so I expected that."}, "2": {"Date": " Jun 8, 2016", "Summary": "\"Great Brand In. Turnaround\"", "Pros": "Great place to work with food benefits and growth opportunities.", "Cons": "Looming down sizing. Possible move down town a negative for many."}, "3": {"Date": " Jun 8, 2016", "Summary": "\"bad business\"", "Pros": "nothing good to say", "Cons": "some of the most rudest people work there"}, "4": {"Date": " Jun 8, 2016", "Summary": "\"Manager\"", "Pros": "Great job to learn about food industry", "Cons": "Bad Job To Make A living"}, "5": {"Date": " Jun 9, 2016", "Summary": "\"Works with your schedule\"", "Pros": "Works well with schedules especially if you're still a student. As long as you're a good worker the managers will appreciate you. Can easily move up and they'll still work with you're schedule.", "Cons": "You will always get those annoying fat customers in the night that will want free stuff. As long as you're nice you wont have complains. Raises take forever."}, "6": {"Date": " Jun 23, 2016", "Summary": "\"Accounting Associate\"", "Pros": "Great company to work for. Love the people", "Cons": "Not enough training. Not enough guidance from management."}, "7": {"Date": " Jun 22, 2016", "Summary": "\"Average\"", "Pros": "Work was easy. Had a lot of breaks when day was slow. Co workers were good to get along with", "Cons": "Dealing with picky customers was always stressful."}, "8": {"Date": " Jun 23, 2016", "Summary": "\"Only good if you're a high school student\"", "Pros": "McDPerks, free meals during your breaks, 50% discount, flexibility, decent pay that's a bit over the minimum (where I work at).", "Cons": "Unorganised management and structure, management won't do anything towards aggressively rude customers (despite in orientation being told managers would handle them but instead we are ignored a lot), customers are always above employee's well-being, they play the favourites game. Over where I work at, store manager never looks at the requested days off sheets and ignores them completely."}, "9": {"Date": " Jun 7, 2016", "Summary": "\"Good learning experience\"", "Pros": "Great management, although she ran a tight ship, it paid off because our store was a good one. This job was also a great lesson in customer service", "Cons": "I do not ever want to work in food service again. Also of course you get the occasional (regularly) difficult customer but this is actually good experience for the future."}}