{"0": {"Date": " Apr 26, 2017", "Summary": "\"Easy to get hired at\"", "Pros": "No pros, I did not like working here.The rudest customers ever", "Cons": "treats you like a slave and dispensable"}, "1": {"Date": " Apr 27, 2017", "Summary": "\"hate it\"", "Pros": "people you meet friendsdo whatever you want to", "Cons": "everything pay breaks took away discounts"}, "2": {"Date": " Apr 5, 2017", "Summary": "\"Crew Member\"", "Pros": "Very easy to get a position. The work is not complicated. Best for teenagers or desperate college students.", "Cons": "Usually no benefits, little room for growth, low pay, long standing hours"}, "3": {"Date": " Apr 6, 2017", "Summary": "\"cashier\"", "Pros": "great hours, and ok pay", "Cons": "customers were sometimes a pain"}, "4": {"Date": " Apr 4, 2017", "Summary": "\"Barista/Cashier\"", "Pros": "not too hard of work, employees are very kind, somerville is great, good food", "Cons": "managers are not the kindest"}, "5": {"Date": " Apr 4, 2017", "Summary": "\"Overall okay\"", "Pros": "I would say the biggest positive is the flexibility. They really do cater to your availability which other places may not necessarily do.", "Cons": "When I was hired I was put straight into a kitchen position. Which honestly was not ideal as I wanted to work in the front. However, apparently that as how my location works. You start in the kitchen and once you nail that down, you can be moved up to a cashier position. When I first started some of the managers at my location wouldn't allow me any independence. There always had to be someone mentoring me. However each manager is different because there were times I was left without a mentor, which I enjoyed. It allowed for me to learn better since I had some pressure to complete orders. Being in the kitchen can be very very stressful especially when huge orders are put in but the other employees are more than willing to help. Overall I would say it's okay but I couldn't imagine working here long term"}, "6": {"Date": " Apr 4, 2017", "Summary": "\"Business Consultant\"", "Pros": "Great People. Changing environment", "Cons": "Work-Life balance has become difficult"}, "7": {"Date": " Apr 25, 2017", "Summary": "\"Don't work here so bad\"", "Pros": "It is a job so that is good", "Cons": "crappy paysmellyrude peopleIt is not a nice place to work"}, "8": {"Date": " Apr 25, 2017", "Summary": "\"Pay is good, jobs are not\"", "Pros": "Free cafeteria food, free training, among other things.", "Cons": "Long work hours, incompetent management"}, "9": {"Date": " Apr 25, 2017", "Summary": "\"Can be a hazardous place to work\"", "Pros": "- Meet lots of interesting people- Understanding the fast food process", "Cons": "I worked the early hour grill cook shift starting at 5am and was responsible for the cooking and filling of orders while the other 2 employees from grave yard shift completed their duties for their shift and took orders. This was great at first but they gradually kept piling more duties on me as time went on and I began to question why I was suddenly responsible for the things the 8am workers should be doing since keeping up with the grill orders was overwhelming already (especially at the switch hour from breakfast to lunch)-Everytime I got sick I was talked down to for not coming into work because they couldn't get anyone to cover me since I was the only person willing to work such early hours. (despite them insisting that we should stay home if sick and NOT come to work)At one point I was so sick I ended up in the hospital, this made the managers angry instead of concerned. They demanded I call the store manager even though I was in the emergency department in intense pain and needing to undergo surgery.- Rotten management (No respect or concern for employee health or welfare)- Too many responsibilities for one person (felt like they were singling me out since I was new)- Exposed to extreme heat for long periods of time- Cramped area with too many people often times."}}