{"0": {"Date": " May 9, 2017", "Summary": "\"Bloop\"", "Pros": "It's great with time management", "Cons": "Cleaning old stains could be a hassle"}, "1": {"Date": " May 8, 2017", "Summary": "\"crew\"", "Pros": "there are some good people i work with at times, there are also the respect of there help at times may i stress", "Cons": "the managers are so rude when you do something wrong its always your fault and nothing is ever on them i have worked there for a month and two weeks now the pay rate is all over the place its never the same its always low. And the the fact that i still dont know what i am doing they are totally unorganized, and i never feel like going there because of the stress i feel."}, "2": {"Date": " May 8, 2017", "Summary": "\"horrible\"", "Pros": "great for a student, offers great flexibility if you can handle the stress of everything constantly breaking, new management constantly and employees who are crazy..", "Cons": "staff are horrible, management..a joke, pay... a joke and be prepared to get blamed by customers for everything"}, "3": {"Date": " May 7, 2017", "Summary": "\"Working at McDonals\"", "Pros": "Meet and greet new people.", "Cons": "Dealing with some angry and disrespectful customers."}, "4": {"Date": " May 7, 2017", "Summary": "\"Cashier\"", "Pros": "Fast paced work, new challenges, flexible hours", "Cons": "Bad management, environment, difficult customers"}, "5": {"Date": " May 8, 2017", "Summary": "\"Meh, it had good and bad moments\"", "Pros": "Scholarship money, some nice coworkers", "Cons": "Unequal pay, irregular training, some bad management"}, "6": {"Date": " Apr 22, 2017", "Summary": "\"Keep it calm.\"", "Pros": "The other employees and the happy moments are why working there is worth it.", "Cons": "The hours, the managers & the customers along with some other employers are a downer sometimes."}, "7": {"Date": " May 29, 2017", "Summary": "\"cook\"", "Pros": "easy to get hired. free lunches and some of the people are nice. easy location to get to", "Cons": "low pay. always busy. manager don't do anything. place is DIRTY, they bait you.. no 401k. no respect at the job."}, "8": {"Date": " May 8, 2017", "Summary": "\"crew/crew trainer\"", "Pros": "can work any flexible schedule, get in hours needed", "Cons": "no respect from managers, very stressful, have to deal with angry customers when you had no control of what happened"}, "9": {"Date": " May 8, 2017", "Summary": "\"Worse job ever\"", "Pros": "The work was fairly easy.", "Cons": "There was way too much drama."}}