{"0": {"Date": " Aug 5, 2017", "Summary": "\"It's your average fast food place. You're pretty much either busting your butt or scratching it.\"", "Pros": "Some of the employees can make the job bearable. The same applies to the customers. The pay is alright for the amount of work. All of this obviously changes from McDonald's to McDonald's.", "Cons": "Some of the employees can make the job unbearable. The same applies to the customer. The pay is awful for the amount of work. All of this obviously changes from McDonald's to McDonald's."}, "1": {"Date": " Jul 15, 2017", "Summary": "\"It's okay for a first job, but you'll want a different one quickly\"", "Pros": "good coworkersfast paced atmospheregood first joblots of hours if you ask", "Cons": "managment communications suckpay not that greatnot as flexible as they say"}, "2": {"Date": " Jun 30, 2017", "Summary": "\"Newport ky\"", "Pros": "Great pay and benefits.. Nice crew", "Cons": "Not enough help and long hours"}, "3": {"Date": " Jun 30, 2017", "Summary": "\"It was okay\"", "Pros": "Manager took my availability into account when he made the weekly schedule.", "Cons": "Some of the customers were very rude, but that's not surprising these days."}, "4": {"Date": " Jun 30, 2017", "Summary": "\"Great Benefits\"", "Pros": "Benefits are the best with this company. New hires start with 3 weeks of vacation and jumps to 4 weeks on the 5th year plus one extra week off every 5 years. You also get an 8 week paid sabbatical every 10 years. There are also summer hour Fridays.Great environment for collaboration and networking with others.", "Cons": "Career advancement can be a challenge because it can be competitive transferring to different positions in the company or getting a promotion."}, "5": {"Date": " Jun 30, 2017", "Summary": "\"Good Beginner job\"", "Pros": "Flexible hours, free meals, opportunity to move up", "Cons": "Some managers can be demanding. Fast pace can be stressful."}, "6": {"Date": " Jul 1, 2017", "Summary": "\"Crew\"", "Pros": "It's fast paced. And you'll never be bored.", "Cons": "Customers treat workers very poorly."}, "7": {"Date": " Jun 29, 2017", "Summary": "\"Good Company. Super nice\"", "Pros": "Very nice working staff, they were always happy to see each other, nice environment, and very customer oriented. Would like to work again.", "Cons": "Some of the workers had sloppy workstations, and they werent monitored by the manager, but quickly cleaned up when instructed."}, "8": {"Date": " Aug 4, 2017", "Summary": "\"not great job haha\"", "Pros": "free drinks, half off food, fun people", "Cons": "little pay, angry customers, no respect"}, "9": {"Date": " Jul 14, 2017", "Summary": "\"I HATE THIS JOB!\"", "Pros": "The only pros are wages, benefits , and hours.", "Cons": "Lack of communication and bad management ."}}