{"0": {"Date": " Jun 7, 2017", "Summary": "\"General managet\"", "Pros": "Training, teamwork fast pace", "Cons": "Overtakes your personal life hard to find work life balance"}, "1": {"Date": " Jun 7, 2017", "Summary": "\"McDonald's Crew member\"", "Pros": "Usually, Doesn't require prior experienceHours are fairly flexible, its pretty good if you're a studentTasks are not too difficult", "Cons": "Very RepetitiveCan be very stressful during busy hours of the dayPay is sub-parno insurance, or any benefits to my knowledge"}, "2": {"Date": " Jun 8, 2017", "Summary": "\"Cashier\"", "Pros": "Time goes by fast, easy training, and great job to have if you're still in school", "Cons": "Not enough hours, not a lot of teamwork"}, "3": {"Date": " May 21, 2017", "Summary": "\"McDonalds Crew member\"", "Pros": "Good Management, good place to work if you are a student. Very flexible hours. Great networking within the employees. If you need a shift covered it is very possible to get someone to cover.", "Cons": "Rules can be strict. Your required to stick to a script when you may have the capabilities to handle to situations in an appropriate manner. There are too many people working there that try to teach you how to do something. Some contradict what others have already told you."}, "4": {"Date": " May 23, 2017", "Summary": "\"cook\"", "Pros": "Super cool place to work and advance into another roll that pays even better. Employee discounts, great people, great food, great training, great customers. Tuition reimbursement, health benefits.", "Cons": "Sometimes it can be difficult working working with all of the nonstop turnover rate."}, "5": {"Date": " May 23, 2017", "Summary": "\"Director of Operations\"", "Pros": "Opportunity, Training, and business experience that no amount of formal education can provide!", "Cons": "Must be willing to \"do whatever it takes\" and \"blend\" personal life with work life."}, "6": {"Date": " Jun 28, 2017", "Summary": "\"Mcdonalds\"", "Pros": "None. Too much blame put on others. Work schedule always different. Didn't treat employees good. Not good Benefits for any full or part time employees", "Cons": "Everything. Everything is very disorganized, if you make a higher up mad they cut hours. Too many responsibilities for less pay. Sometimes have to do extra work or other people's work while they get promoted"}, "7": {"Date": " Jun 7, 2017", "Summary": "\"It can be fun & simple some days. It can be extremely stressful most days.\"", "Pros": "Lots of amazing benefits, opportunity to move up and receive great pay. Paid vacation for managers as well and paid time off for crew!", "Cons": "Not everyone is as focused which can be frustrating. Treated unfairly by higher management, and extremely overworked! Don't call HR they're not on your side."}, "8": {"Date": " May 23, 2017", "Summary": "\"cashier\"", "Pros": "great co-workers very friendly environment met people", "Cons": "Increase the salary and the number of hours an employee can work"}, "9": {"Date": " May 24, 2017", "Summary": "\"Manager\"", "Pros": "Wonderful place to work, you get to smell burgers all day long. The fries are crunchy. The sweat tea is good.", "Cons": "I have nothing bad to say."}}