{"0": {"Date": " Apr 12, 2017", "Summary": "\"Crew Cashier\"", "Pros": "Discount meals, nice cowokers, good start for HighSchool Graduate or first part time job.", "Cons": "Dealing with different people from different background."}, "1": {"Date": " Apr 26, 2017", "Summary": "\"Employment at McDonald's\"", "Pros": "They pay more than minimum wage, and they really work with your schedule if you're in school.", "Cons": "You work on your feet for an extended period of time before they allow you to take a break. Only one 30 minute break."}, "2": {"Date": " Apr 26, 2017", "Summary": "\"Swing Manager\"", "Pros": "Did work with my school schedule", "Cons": "Managers above me didn't run the store well"}, "3": {"Date": " Apr 26, 2017", "Summary": "\"Good First job\"", "Pros": "Hours were flexible, the work environment was relaxed.", "Cons": "Sometimes they seemed to work you pretty hard for a minimum wage job. As a first job or for someone living with parents/going to school and not having to pay all their expenses, the pay was realistic. I did not see how someone living on their own could make much money though."}, "4": {"Date": " Apr 26, 2017", "Summary": "\"Opportunity to grasp a \"larger picture\" concept.\"", "Pros": "Flexible scheduling. Easy job. Clear standards. Easy application and hiring process. Training is short and engaging. Management works with entry level employees.", "Cons": "At the time I was employed by McDonalds there was too much supervisor/subordinate relationships which led to unfair scheduling and positioning."}, "5": {"Date": " Apr 27, 2017", "Summary": "\"Good company\"", "Pros": "Good people and a fast placed environment", "Cons": "It's McDonald's and there isn't room for promotions"}, "6": {"Date": " Apr 11, 2017", "Summary": "\"i loved my job so much\"", "Pros": "great food and sodas that i love", "Cons": "fries were soggy a lot"}, "7": {"Date": " Apr 11, 2017", "Summary": "\"Crew Member\"", "Pros": "Time Flexibility works very well for part time status", "Cons": "Having to stay longer than scheduled sometimes"}, "8": {"Date": " Apr 11, 2017", "Summary": "\"Cook\"", "Pros": "Creates a solid foundation on time-management and communication skills as well as teamwork and team leading skills.", "Cons": "It does not provide much growth within it's employees."}, "9": {"Date": " Apr 11, 2017", "Summary": "\"Great Course\"", "Pros": "Flexible hours, fun job, great kids", "Cons": "Decent Pay, in the summer"}}