{"0": {"Date": " Mar 28, 2016", "Summary": "\"Crew Member\"", "Pros": "The Great coworkers and teachers", "Cons": "The Poor pay and hours"}, "1": {"Date": " Mar 29, 2016", "Summary": "\"Good job for school\"", "Pros": "They are very good at working with your schedule. Most of the people there are pretty laid back if it isn't during a rush. Free meals when you work.", "Cons": "Pay sucks, 3 years and not even making 10 dollars an hour. It's a simple job but not always easy, the rushes can be pretty stressful but nothing too bad."}, "2": {"Date": " Mar 29, 2016", "Summary": "\"first jo\"", "Pros": "entry level job, hours were alright, easy schedule", "Cons": "low pay, low hours, not much room for improvement"}, "3": {"Date": " Mar 29, 2016", "Summary": "\"Bad place for personal trainers\"", "Pros": "Good location and the food was good", "Cons": "No structure and no program in place"}, "4": {"Date": " Mar 29, 2016", "Summary": "\"Your Store Varies\"", "Pros": "Quick promotion at store levelHalf off foodOccasional overtimeFlexible schedulingHigh-paced environment", "Cons": "Benefits are more of a maze than a benefitManagement can varyHard to move up past shift managerCustomers/management/coworkers alike can be verbally abusiveHigh-paced environmentStressful environment"}, "5": {"Date": " Mar 13, 2016", "Summary": "\"General manager\"", "Pros": "Develop managers and lead my team. Experience interactions with different people daily. Hold my managers accountable for a job well done and a job not completed. Working in a safe environment. Puts me through tough situations but I always come out on top. Give and take direction on the correct way of doing things. I'm not only there manager I'm there for my employees when they need a helping hand on anything.", "Cons": "Dealing with angry customers, but customers needs always come first. Employees not showing up when scheduled. Having to deal with thefts."}, "6": {"Date": " Mar 13, 2016", "Summary": "\"Great!\"", "Pros": "Really like the benefits, hoping to move up.", "Cons": "Not sure about this one to be honest."}, "7": {"Date": " Apr 18, 2016", "Summary": "\"Executive Administrative Assistant\"", "Pros": "Was a good company to work for.", "Cons": "Due to company reorganization, the company has had to make some adjustments and had to lay people off."}, "8": {"Date": " Mar 28, 2016", "Summary": "\"A mess.\"", "Pros": "They had a very specific place to request time off, 50% employee meals but only immediately before or after working, some friendly employees.", "Cons": "Managers obviously don't know what they are doing, I was not given any training before being thrown into various different positions and was expected to perform as well as anyone else. First week they did not know I was supposed to come in at all, second week was not put on schedule and when I asked them they said they would \"look into it.\" Halfway through the week I called again to get scheduled. Third week they scheduled me on days I was not available. Fourth week they would not let me see schedule in person, would not answer my phone calls, and when they finally did, all they said was \"come in Wednesday at seven\" and promptly hung up - even as I was trying to ask questions."}, "9": {"Date": " Mar 28, 2016", "Summary": "\"What do you expect\"", "Pros": "Lots of teenagers worked there, making it a chill place with the right manager", "Cons": "Always understaffed in the summer and busiest days, mean customers and supervisors,"}}