{"0": {"Date": " Dec 18, 2015", "Summary": "\"McDonald's\"", "Pros": "It's fast-paced, easy to learn. The coworkers are very considerate and friendly. You are never bored, you're always busy doing something.", "Cons": "The management would not work around my college classes hours and always scheduled me when I had to be at class"}, "1": {"Date": " Dec 3, 2015", "Summary": "\"Loved it!\"", "Pros": "great people, good benefits and hours", "Cons": "understaffed, some managers liked to mico manage"}, "2": {"Date": " Dec 4, 2015", "Summary": "\"Mcdonalds\"", "Pros": "Nice People, Good Pay, Awesome People", "Cons": "no fun, Not enough money, To much work"}, "3": {"Date": " Jan 9, 2016", "Summary": "\"The most terrible job I have ever had. The people running all locations in Martinsville, Virginia should be prosecuted.\"", "Pros": "The only thing I enjoyed about working here for 7 years was receiving a paycheck. Not a good environment to work in.", "Cons": "The management is too busy running a popularity contest to do their jobs from supervisor to shift management. Also embezzling is a huge problem."}, "4": {"Date": " Dec 18, 2015", "Summary": "\"General Manager\"", "Pros": "It is easy to advance and there are great classes you learn a lot.", "Cons": "They start you at the bottom with pay."}, "5": {"Date": " Dec 18, 2015", "Summary": "\"Crew Trainer\"", "Pros": "Easy Pay, Move ahead very quick, free meals on break depends on store location, free uniform", "Cons": "Decent Pay, fast paced environment, rude customers, always complaining about overtime"}, "6": {"Date": " Dec 18, 2015", "Summary": "\"McDonals Franchise\"", "Pros": "Fast paced, different everyday, good for folks who are looking to break into a management career,excellent training program and follow through, good benefits", "Cons": "Low pay, managers are taken advantage of and expected to work long hours while paid on salary, one problem no matter how small and they will look for any excuse to terminate or demote you."}, "7": {"Date": " Dec 19, 2015", "Summary": "\"Maintenance\"", "Pros": "After a while you learn a couple of new trains if you want to work at McDonald's as a maintenance person. The customers are nice to you but never to the employees or managers.", "Cons": "You deal various types of customers. In the morning they are nice.In the evening mood change and then at night time it gets really bad. You have people who want there food done fast bu order to much food at the same time. You need allot of patience to work here."}, "8": {"Date": " Dec 4, 2015", "Summary": "\"Decent Job\"", "Pros": "Teaches you how to work hard", "Cons": "Management is a bit confused sometimes"}, "9": {"Date": " Dec 4, 2015", "Summary": "\"Part time\"", "Pros": "Benefits and breaks between work is good.Free yummy, nutritious, greasy is provided meal every shift.Uniform provided for everyone", "Cons": "Not a good place to build a career.Customers may get hostile and volatileNeed to purchase your own black shoes/sneakers"}}