{"0": {"Date": " Mar 13, 2016", "Summary": "\"Cashier\"", "Pros": "Lunch was paid for me", "Cons": "No room for advancment, rude customers,"}, "1": {"Date": " Mar 12, 2016", "Summary": "\"cashier\"", "Pros": "pros include flexible hours, free 3 items off the dollar menu, and breaks", "Cons": "having to deal with rude customers, no tipping, having to stand the entire shift"}, "2": {"Date": " Mar 13, 2016", "Summary": "\"Manager\"", "Pros": "My role has a manager ensuring that the restaurant delivers high-quality food and drink and good customer service.", "Cons": "Poor customer service, lack of communication"}, "3": {"Date": " Mar 13, 2016", "Summary": "\"Perspective of Student\"", "Pros": "Very friendly atmosphere for workers", "Cons": "Very poor upward mobility for hard workers"}, "4": {"Date": " Feb 26, 2016", "Summary": "\"cashier\"", "Pros": "Art communication working together music", "Cons": "Working alone unorganized things problems in work area"}, "5": {"Date": " Feb 26, 2016", "Summary": "\"Cook and prep\"", "Pros": "Working with the public and talking to people", "Cons": "The cap on pay raise should be higher for more opportunities."}, "6": {"Date": " Feb 27, 2016", "Summary": "\"Cashier\"", "Pros": "Great company to work for.", "Cons": "I really don't have any complaints"}, "7": {"Date": " Apr 2, 2016", "Summary": "\"Horrible place to work\"", "Pros": "They are very relax with scheduling - you can switch hours with basically anyone you want. They don't care as long as someone is working your shift.", "Cons": "-Horrible management. My supervisor is the only person who should be of superiority there.-NEVER get off on time. Always take what time you're supposed to be offf and add a minimum of 1/2 hour to that.-Open on some holidays.-Customers tend to think they're better than you since you work at McDonalds.-Coworkers are very gossipy. (At least at my McDonalds and surrounding McDonalds).-Always smell like McDonalds. Always.-Though it is \"your\" cash drawer, other people are still allowed to use it to cash out orders. So basically, if someone steals or makes a mistake in YOUR drawer, you are responsible and must pay it back."}, "8": {"Date": " Mar 12, 2016", "Summary": "\"Bad Job\"", "Pros": "there are no pros for this company", "Cons": "dont treat u like a worker treats u bad and calls you names"}, "9": {"Date": " Mar 12, 2016", "Summary": "\"crew member\"", "Pros": "they hire with zero experience, flexible scheduling", "Cons": "poor management, zero teamwork, terrible customers, promotions had nothing to do with hard work, just overall bad place to work"}}