{"0": {"Date": " Jan 17, 2018", "Summary": "\"cashier\"", "Pros": "they gave me plenty of hours", "Cons": "i wanted to move up in the company and did not have much of an oppurtunity"}, "1": {"Date": " Jan 30, 2018", "Summary": "\"crew member\"", "Pros": "flexible schedule, you get paid on time", "Cons": "its fast food you work the hours you sign up for"}, "2": {"Date": " Jan 30, 2018", "Summary": "\"Crew\"", "Pros": "Easy to work for minimum wage", "Cons": "Drama is always going to get in the way"}, "3": {"Date": " Jan 30, 2018", "Summary": "\"Line Cook\"", "Pros": "The staff is friendly and the hours fit my schedule. I liked working in a fast environment because it makes the time go by quickly.", "Cons": "I did not make a lot money working at this job. I also did not enjoy the smell of the food after working a full shift there."}, "4": {"Date": " Jan 30, 2018", "Summary": "\"Good\"", "Pros": "good place to work i love it", "Cons": "lame boss he was not nice"}, "5": {"Date": " Jan 31, 2018", "Summary": "\"It was alright\"", "Pros": "the pay was nice, and so was the work/life balance", "Cons": "the hours are pretty long, the customers suck most of the time"}, "6": {"Date": " Jan 15, 2018", "Summary": "\"Outstanding place to work and eat. We take great pride in our customers and give 100% to wow them.\"", "Pros": "Management at my store 2504 S. Orange Avenue outstanding to our guest as well as employees. Teamwork and family.", "Cons": "I enjoyed the work, Just didnt like cleaning up my mess after I overfilled the grease trap, but it was my fault. Other than that, outstanding."}, "7": {"Date": " Jan 15, 2018", "Summary": "\"Line cook\"", "Pros": "Great place to work, good place to start your life in the work force", "Cons": "Bad hours and hard to find trusted employees"}, "8": {"Date": " Jan 15, 2018", "Summary": "\"Start of a New Journey\"", "Pros": "Experience, Free Food, Friends, Relationships", "Cons": "Nothing wrong. It's all good."}, "9": {"Date": " Jan 15, 2018", "Summary": "\"Great\"", "Pros": "Loved it, great food and ice cream", "Cons": "Gained weight from eating too much food"}}