{"0": {"Date": " Jan 12, 2017", "Summary": "\"Dm3\"", "Pros": "Good benefits and insurance", "Cons": "Crappy hours, always short handed"}, "1": {"Date": " Dec 28, 2016", "Summary": "\"Fun. I worked as part of crew. Other workers are fun to work with. Great teamwork. Good first job\"", "Pros": "Good hoursWorks well with school schedulesNice co-workersGreat teamworkOK pay", "Cons": "Some costumers are difficult. Not a job for some who does not communicate well"}, "2": {"Date": " Dec 29, 2016", "Summary": "\"Manager\"", "Pros": "Every day a different challenge. Meeting new people getting to know customers and employees fast pass always something to do", "Cons": "not really cons but stepping stones. hiring to meet volume.con working on Thanksgiving"}, "3": {"Date": " Dec 29, 2016", "Summary": "\"Cashier\"", "Pros": "McDonalds has fast service, their lobby is always kept clean, trash is never overflowing, great customer service, and food is always right.", "Cons": "The McDonalds bathrooms are hardly ever clean, there is a terrible odor coming from the womens bathroom the most."}, "4": {"Date": " Jan 11, 2017", "Summary": "\"Great First Job\"", "Pros": "The ability to move up and continue on with your career.", "Cons": "Depending on the owner the store can be either difficult or easy."}, "5": {"Date": " Jan 11, 2017", "Summary": "\"shift manager\"", "Pros": "enjoyed my co workers and the fries", "Cons": "pay employees what theyre worth"}, "6": {"Date": " Jan 11, 2017", "Summary": "\"assistant manager\"", "Pros": "free fries that are tasty", "Cons": "too many fries that are tasty"}, "7": {"Date": " Jan 12, 2017", "Summary": "\"Ok...\"", "Pros": "Free food and flexible hours", "Cons": "Terrible management, need to listen to employee needs and be respectful"}, "8": {"Date": " Jan 12, 2017", "Summary": "\"Crew\"", "Pros": "Whole team was pretty nice", "Cons": "Small spaces and fast paced"}, "9": {"Date": " Dec 27, 2016", "Summary": "\"Cashier\"", "Pros": "Hours were pretty flexible and I could usually work the hours I wanted since it was open 24 hours a day so if I wanted late I could get hours then and if I wanted morning it was mine", "Cons": "Work environment was slightly intense at times and the grease smell on me all the time was a downer but a good shower is a quick fix so not a huge deal in the end"}}