{"0": {"Date": " May 9, 2017", "Summary": "\"Fast paced work environment and a great starter job\"", "Pros": "Good work experience and pay is good. It helps if there are friendly people working with you. Great started job to someone in high school.", "Cons": "Working in fast food isn't the best thing in the world, so it obviously has its cons. I would say the biggest con is the customers who are rude."}, "1": {"Date": " Apr 24, 2017", "Summary": "\"That really good\"", "Pros": "Because I can do everything about McDonald's . And I can work any positions", "Cons": "Any change everything that fine for.my I am really adaptable"}, "2": {"Date": " May 30, 2017", "Summary": "\"McDonalds I'm Hatin it\"", "Pros": "There is really nothing I enjoyed about working for these bastards except that I was forced to come out of my shell to deal with customers.", "Cons": "Customers are rude. Management has sticks up their arses. Higher ups always side with management never with regular crew and nobody listens to regular crews suggestions."}, "3": {"Date": " May 30, 2017", "Summary": "\"Team Member\"", "Pros": "Fast pace restaurant, the food is great, I lived nearby", "Cons": "They rush you, get bored fast, not many employees"}, "4": {"Date": " Apr 24, 2017", "Summary": "\"crew member\"", "Pros": "schedule fix your time, easy job", "Cons": "boring, tired when stand for long time"}, "5": {"Date": " Apr 25, 2017", "Summary": "\"Production Manager\"", "Pros": "Free meals during your shift", "Cons": "Work you to death for little pay."}, "6": {"Date": " Apr 25, 2017", "Summary": "\"issa job\"", "Pros": "good company and good envirnoment", "Cons": "bad supervisors, could never call off"}, "7": {"Date": " May 8, 2017", "Summary": "\"McDonald's Franchise\"", "Pros": "Allows a broad, diverse and in depth knowledge of all aspects of running a food business.You don't need to have a college career to advance.", "Cons": "Long hours and can be very demanding and high stress.Can be difficult to attract and retain employees."}, "8": {"Date": " May 8, 2017", "Summary": "\"Crew Member\"", "Pros": "Good team and Good salary", "Cons": "Stress ans sometimes clients can be rude"}, "9": {"Date": " May 9, 2017", "Summary": "\"Ok\"", "Pros": "Free food, flexible schedule, plenty of hours", "Cons": "Bad customers, always busy, employees keep calling in"}}