{"0": {"Date": " Jun 2, 2016", "Summary": "\"An interesting experience I would not repeat\"", "Pros": "Good hours, reasonable break times, easy work, free ice cream when they clean the machine on Sundays, interesting coworkers, and free drinks when someone changes their mind about their drink order.", "Cons": "Very vulgar coworkers, burning your hands on the fry grease, terrible pay, having to clean those terrible bathrooms, dealing with the worst customers ever, and so much more."}, "1": {"Date": " Jun 3, 2016", "Summary": "\"It's McDonald's, what did I expect?\"", "Pros": "It's a decent job if you work part time and don't plan on staying long. They seem to promote those who just do the bare minimum so easy promotions.", "Cons": "Overnight workers do not get any breaks therefore are on their feet for 8 hours running back and forth doing non-stop dishes (because the closing employees never finish theirs) and taking orders. Mostly teenage workers feels like being in high school again; the drama is ridiculous and the teens hardly make an effort to work."}, "2": {"Date": " Jun 3, 2016", "Summary": "\"Sucks\"", "Pros": "A lot of hours, able to be flexible , over timePossible if you request it", "Cons": "Fast food & low pay"}, "3": {"Date": " May 18, 2016", "Summary": "\"General Manager\"", "Pros": "401k profit match, insurance, vacation, sick days, fun, different everyday", "Cons": "So many stakeholders (supervisors, regional leadership, HR) want something different every month."}, "4": {"Date": " May 18, 2016", "Summary": "\"Manager\"", "Pros": "Good people to work with. Work with schedules", "Cons": "Pay could have been better for the positions"}, "5": {"Date": " May 18, 2016", "Summary": "\"Assistant manager\"", "Pros": "Flexible schedule , great people, good atmosphere, teaches hard work, benefits are decent, opportunities to advance", "Cons": "Hot, the work and be time consuming, cleaning never ends, rude customers, a lot of people to depend on"}, "6": {"Date": " May 18, 2016", "Summary": "\"great job\"", "Pros": "good people to work with", "Cons": "not enought hours to make ends meet"}, "7": {"Date": " May 18, 2016", "Summary": "\"certified shift manager\"", "Pros": "Run the floor, paid vacation, work with great people..", "Cons": "Lots of hours, on feet entire shift -deposit time"}, "8": {"Date": " Jun 1, 2016", "Summary": "\"Intern\"", "Pros": "Big corporation, innovation, free food from McDonalds test kitchen", "Cons": "Management too busy, just worked on intern project"}, "9": {"Date": " Jun 1, 2016", "Summary": "\"Employees are nice to work with\"", "Pros": "Good food and pay good", "Cons": "Watch out for the boss"}}