{"0": {"Date": " Jun 17, 2016", "Summary": "\"Just fast food\"", "Pros": "Easy work, fast paced, somewhat flexible schedules", "Cons": "Rude customers, constantly called in for no shows,"}, "1": {"Date": " Jun 1, 2016", "Summary": "\"cashier\"", "Pros": "the communication and diversity is great and the food is amazing as well as the employees the see to it that everyone is satisfied", "Cons": "sometimes it would be so crowded the service of how fast everyone gets there food can be improved but over all everything is stellar"}, "2": {"Date": " Jun 1, 2016", "Summary": "\"sales\"", "Pros": "free food every day i work", "Cons": "the job is tedious and boring"}, "3": {"Date": " Jun 1, 2016", "Summary": "\"Aboout\"", "Pros": "Sale skills, Communication skills, etc.", "Cons": "Retail, rude customers, not many benefits, managers aren't the kindest, slackers."}, "4": {"Date": " Jun 1, 2016", "Summary": "\"Great place to work\"", "Pros": "good hours, basic work, nice workers", "Cons": "pay, time off, poorly run"}, "5": {"Date": " Jun 2, 2016", "Summary": "\"Management Has Problems\"", "Pros": "People are nice to work with once you become a member of the team as a dedicated employee.. Work is steady and the company pays on time.. A meal discount or free meals depending upon particular store (subject to change).. Its a job in a down economy.", "Cons": "Micromanagement blames anything upon the workers, JIT inventory, supplies always run out or never get ordered, equipment is broken or does not get repaired. Company is very demanding adding more job duties than a sane person can manage, morale is very poor due to a demanding job.. No Benefits (medical insurance, 401K, etc.). Its sad when a subordinate employee has more business knowledge than managers who have been trained by the company."}, "6": {"Date": " Jun 15, 2016", "Summary": "\"Grill\"", "Pros": "Not enough hours a week", "Cons": "Good crew ppl and staff"}, "7": {"Date": " May 31, 2016", "Summary": "\"Manager\"", "Pros": "Great people to work with because it was family oriented.", "Cons": "Working there and making burgers a lot made you smell of onions all the time."}, "8": {"Date": " May 31, 2016", "Summary": "\"Retail\"", "Pros": "Love working with the public", "Cons": "Making sure everyone is happy"}, "9": {"Date": " May 31, 2016", "Summary": "\"It was just a temporary job\"", "Pros": "It made me want to work to get paid it wasn't really hard labor hours were fair bosses were vary nice I did everything to the best of my abilities", "Cons": "The co workers of mine were lazy they knew since I was the new guy they could say I need practice doing this and that but really it was so they could get more smoke breaks"}}