{"0": {"Date": " Mar 12, 2018", "Summary": "\"Food server\"", "Pros": "food co workers schedule fries burgers", "Cons": "DOnt think the pay was fair"}, "1": {"Date": " Mar 12, 2018", "Summary": "\"It's an okay start\"", "Pros": "It is true that McDonald's is very flexible in terms of scheduling and they can give you all the 40 hours. It is fast paced depending on which location you go to. You do learn a lot about what it means to work and you acquire skills that you can use throughout your life. Working with these type of people really prepares you for what you will find anywhere.", "Cons": "They management is terrible. Their managers and their general manager have no sense as to how to treat their employees. The managers themselves don't even know what they are doing and causes a stressful environment for the rest of the crew. Also the lack of breaks is another issue. A person can work a 12 hour shift and only receive one break; however, that break is a lunch break not a 15 min on the clock break. The pay is also very low to become a manager for the amount of work given and the stress."}, "2": {"Date": " Mar 12, 2018", "Summary": "\"Good Benefits\"", "Pros": "They ar offering benefits such as scholarship", "Cons": "The work schedule is not flexible"}, "3": {"Date": " Mar 12, 2018", "Summary": "\"Team Member\"", "Pros": "Discounts, and flexible work hours", "Cons": "Bad Managers and Poor Food"}, "4": {"Date": " Mar 11, 2018", "Summary": "\"McDonald's\"", "Pros": "Easy job to have - it's great", "Cons": "Lots of hours - forced to work overtime"}, "5": {"Date": " Mar 11, 2018", "Summary": "\"not good\"", "Pros": "had somewheee to work", "Cons": "not a lot of hours or pay"}, "6": {"Date": " Feb 24, 2018", "Summary": "\"Crew\"", "Pros": "Promotes customer service. Great starting point for high schooler's looking for they're first job. As for me it's a way for me to stay busy.", "Cons": "When people call out the store is short handed. But you learn to work through it."}, "7": {"Date": " Feb 24, 2018", "Summary": "\"Working there\"", "Pros": "Decent salary and positive attitude", "Cons": "Management was mean and unfair at times"}, "8": {"Date": " Mar 10, 2018", "Summary": "\"Crew experience\"", "Pros": "Flexible hours, training easy and fast", "Cons": "High turnover rates and some of the management was an issue."}, "9": {"Date": " Mar 10, 2018", "Summary": "\"Swing Manager Positon\"", "Pros": "Easy to obtain employment, work is easy to do.", "Cons": "Work is monotonous, pay is not good, managing is similar to babysitting due to age of most employees."}}