{"0": {"Date": " Sep 27, 2016", "Summary": "\"Cashier\"", "Pros": "Great experience for learning how to follow directions/ act under a high-pressure, fast paced environment.", "Cons": "Sometimes customers are hard to handle"}, "1": {"Date": " Sep 27, 2016", "Summary": "\"Ok\"", "Pros": "Something to do, somewhat flexible, if you are a good worker and have been there for a while, management is more willing to work with you.", "Cons": "The pay is ok , could be better. they offer benefits if you work a certain number of hours after a year, depending on the francisee. Only fifty percent discount on meals to employees, kitchen temperature never seems to be properly managed. I hated feeling like I was in high school with gossiping teenagers, with most adults behaving in the same manner."}, "2": {"Date": " Sep 27, 2016", "Summary": "\"Departmemt manager\"", "Pros": "Management advancement is always a possibility", "Cons": "The Views of the management can be difficult at time"}, "3": {"Date": " Sep 27, 2016", "Summary": "\"Management\"", "Pros": "Great benefits and advancement opportunities", "Cons": "Long hours that go unnoticed"}, "4": {"Date": " Sep 27, 2016", "Summary": "\"hourly job...\"", "Pros": "great people, flexible hours, fun", "Cons": "bad food, smelly, hectic, gross"}, "5": {"Date": " Sep 28, 2016", "Summary": "\"Cashier\"", "Pros": "Good length breaks. Free meals if survey is completed.", "Cons": "Management, Customers are rude. The head manager is very selfish and schedules you on the specific day you can't be there. and doesn't pay you what you were promised."}, "6": {"Date": " Sep 28, 2016", "Summary": "\"It's what you expect\"", "Pros": "It's a good first job - you know what you're getting into.", "Cons": "Not much to complain about, shifts may not be consistent"}, "7": {"Date": " Sep 28, 2016", "Summary": "\"ok\"", "Pros": "Flexible hours, good experience gain, easy training, possibility for manager position", "Cons": "Low pay, long waits until raise, poor management, OK customer service"}, "8": {"Date": " Sep 28, 2016", "Summary": "\"So so\"", "Pros": "Benefits, great work/life balance and flexibility with schedules", "Cons": "Moving offices to downtown Chicago, going through a reorganization and laying off personnel, interested only in attracting millenials"}, "9": {"Date": " Sep 6, 2016", "Summary": "\"McDonald's Corp\"", "Pros": "Great people work at McDonald's. There are a lot of opportunities for advancement. The company truly believes in career mapping.", "Cons": "There are a lot of changes going on within McDonald's. There is a broad effort to outsource."}}