{"0": {"Date": " Dec 4, 2017", "Summary": "\"Adequate\"", "Pros": "Flexible schedule, easy job, get to talk to customers. Food is good. The fries are the best. Get to tweet while working", "Cons": "Low technological developments, poor communication all around. Working on holidays. No music which is sad. Working with teenagers. Most coworkers are ungrateful."}, "1": {"Date": " Dec 4, 2017", "Summary": "\"It was a job, just a paycheck.\"", "Pros": "You are able to get dicounts on food which is nice. The dish tank has an amazing sprayer. Advancement is simple since most don't stay long.", "Cons": "There are many younger and older people that work there which were hard to work with. Management planning was poor so efficiently was bad."}, "2": {"Date": " Dec 5, 2017", "Summary": "\"McDonald’s\"", "Pros": "Flexible with hours and able to have steady amount of hours", "Cons": "Work on weekendsWork becomes repetitive"}, "3": {"Date": " Dec 5, 2017", "Summary": "\"Management\"", "Pros": "You can really learn about yourself as a person! Also if you put your whole heart into this business everyone can go far. But when you have a GM that would not help in no kind of way!!", "Cons": "But when you have a GM that wouldn't help in no kind of way! Going to higher Management was a waste of time."}, "4": {"Date": " Nov 19, 2017", "Summary": "\"General manager\"", "Pros": "Great learning and training for my filed to do anything with customer needs.", "Cons": "Away from my family and to enjoy life."}, "5": {"Date": " Nov 19, 2017", "Summary": "\"It's always fast and friendly\"", "Pros": "It's simple and easy and friendly the employee s are nice and down to esrthand not far from me to get to work also I can move up the ladder", "Cons": "I'm alittle rusty on my hamburger making where I'm from it's one of the few jobs so everyone is waiting to hear back from them"}, "6": {"Date": " Nov 19, 2017", "Summary": "\"great place to work\"", "Pros": "highly recommend for teens, great work environment", "Cons": "the wag was low and the hours were bad"}, "7": {"Date": " Nov 20, 2017", "Summary": "\"I would go back and work again!\"", "Pros": "Great crew! Loved working with them.", "Cons": "I wish the managers for more nice as the crew."}, "8": {"Date": " Dec 3, 2017", "Summary": "\"It's ok\"", "Pros": "Good food great customers , free meals", "Cons": "LOw pay , hoorrible hours , messy place"}, "9": {"Date": " Dec 3, 2017", "Summary": "\"Okay\"", "Pros": "Pays more than a regular McDonald's for crew member", "Cons": "Fast paced ,Small Space"}}