{"0": {"Date": " Jan 23, 2016", "Summary": "\"na\"", "Pros": "free food at the brake time", "Cons": "i thins there is nothing bad to say"}, "1": {"Date": " Feb 13, 2016", "Summary": "\"Crew Member\"", "Pros": "A paycheck is better than no paycheck.", "Cons": "Easy job but not a livable wage,"}, "2": {"Date": " Feb 14, 2016", "Summary": "\"grill/breakfast cook\"", "Pros": "I was bored and needed money", "Cons": "there was too much politics and bad management"}, "3": {"Date": " Jan 8, 2016", "Summary": "\"Not a career for the rest of my life, but a good job for now.\"", "Pros": "Good benefits, especially for managers. Currently undergoing a lot of changes to improve benefits for crew, including education assistance, quarterly bonuses, paid time off, and insurance for crew that have stayed for at least a year. Has always been flexible when I needed time off, as long as I let them know in advance.", "Cons": "AT LEAST ONCE, YOU CAN EXPECT TO BE TREATED LIKE A LAZY MORON JUST BECAUSE YOU WORK AT MCDONALD'S by someone who:     A) has no idea what he or she ordered, but expected you to know what he or she wanted anyway     B) holds you personally accountable for mistakes you were in no way involved in---possibly including mistakes from before you were even hired     C) can't comprehend that you are, in fact, a HUMAN, capable of making a mistake with 1 or 2 sandwiches, out of the 225 sandwiches that you made during the hourAlso, equipment breaks easily and is very expensive to repair, so may stay broken for a while, and you will have occasional coworkers who expect to only do the jobs they want to do, rather than those they were hired to do. Some stores DO NOT CLOSE for holidays (including Christmas) and McDonald's DOES NOT OFFER HOLIDAY PAY."}, "4": {"Date": " Jan 8, 2016", "Summary": "\"Easy Job\"", "Pros": "Flexible scheduling, nice managers, easy and fast training,", "Cons": "some crew members act like they are the managers and boss you around."}, "5": {"Date": " Jan 9, 2016", "Summary": "\"Crew\"", "Pros": "Good environment of the year before I", "Cons": "Nothing is better then that"}, "6": {"Date": " Jan 9, 2016", "Summary": "\"Great Place\"", "Pros": "Really understanding about scheduling and me having to do school at the same time. Always worked with me to make sure my shifts were coordinated with my class schedule.", "Cons": "Honestly, I can't really say there are any downsides besides the occasional rude customer or mess in the bathroom. For the work I did, it was great money and my bosses were great."}, "7": {"Date": " Jan 22, 2016", "Summary": "\"Ok\"", "Pros": "Good food. People were fun. Manager was nice. Kept busy most of the time. Flexible schedule. I really liked the location.", "Cons": "Not very much room to advance in the company. There seemed to be favoritism, which is never a good thing to have at a work place."}, "8": {"Date": " Jan 22, 2016", "Summary": "\"Good Entry Job\"", "Pros": "This job helped me learn how corporate america works and how hard the service industry works to make money.", "Cons": "The instruction and internal policies vary from location to location and could definitely be improved. I really wish there was also better training."}, "9": {"Date": " Jan 22, 2016", "Summary": "\"Floor supervisor\"", "Pros": "Flexible schedule. Free meal when you work. 50% discount when you don't.", "Cons": "Angry customers, stressful workload and environment. Unpleasant working conditions. Employee gossip, bullying"}}