{"0": {"Date": " Feb 2, 2017", "Summary": "\"Casheir\"", "Pros": "Good customer service practice and good serve safe oppurtunities", "Cons": "Not a good paying job and hours could get cut"}, "1": {"Date": " Jan 11, 2017", "Summary": "\"Server\"", "Pros": "Upper management support and pay", "Cons": "Little to no experience needed"}, "2": {"Date": " Jan 11, 2017", "Summary": "\"Not a good environment\"", "Pros": "People you work with are nice", "Cons": "Hours you get arent good"}, "3": {"Date": " Jan 11, 2017", "Summary": "\"Mcdonalds manager\"", "Pros": "Assistance in college tuition is nice. Scheduling is very flexible, making it easy for parents, students, etc.", "Cons": "Working for an owner/ operator is terrible compared to working for corporate. No appreciation is showed."}, "4": {"Date": " Dec 28, 2016", "Summary": "\"Great First Job\"", "Pros": "Great job to introduce you to the responsiblities involved in working for a franchise. Stressful enough to teach appreciation of hard work but the environment was never too serious.", "Cons": "New management that entered always eroded at the fun atmosphere for the sake of being more productive. People frequently move in and out of store positions, so the work environment was never really consistent."}, "5": {"Date": " Dec 28, 2016", "Summary": "\"Loved the Scholarship Program\"", "Pros": "Their fries taste amazing. and they love their people", "Cons": "you have to think a lot. you can't just show up"}, "6": {"Date": " Jan 10, 2017", "Summary": "\"drive thru\"", "Pros": "good discounts and friendly staff", "Cons": "The pay was minimum wage and not many hours"}, "7": {"Date": " Jan 10, 2017", "Summary": "\"\"Manager\"\"", "Pros": "The coworkers, free meals, free drinks, easy to learn, will hire anyone, especially those recommended by current employees.", "Cons": "Low pay, raises were trash, customers hard to deal with sometimes, mangers have circles, no vacation days, work on holidays, no future unless willing to smooch a little butt"}, "8": {"Date": " Jan 10, 2017", "Summary": "\"McDonald's\"", "Pros": "great people to work with, managers are chillpay increases every 6 monthchance for management opportunity if you stay there long enough", "Cons": "variable hours each weekget assigned to different jobs everydaysome jobs are really boring if you get drive-thru or grill"}, "9": {"Date": " Jan 10, 2017", "Summary": "\"Its fast food\"", "Pros": "Its mind numbing and sometimes fun", "Cons": "It can be dangerous and difficult at times"}}