{"0": {"Date": " May 23, 2017", "Summary": "\"Not too bad\"", "Pros": "Great staff very friendly people. It was fun and i enjoyed going to work everyday even on my days off", "Cons": "Customers were insane and angry and very disrespectful... Rude as can be... I got a shake thrown at me and i wasnt even clocked in yet"}, "1": {"Date": " Jun 5, 2017", "Summary": "\"Department Manager\"", "Pros": "Flexible schedule, meal discounts, uniform free", "Cons": "They do nit take care of the employees"}, "2": {"Date": " Jun 5, 2017", "Summary": "\"Cashier\"", "Pros": "Flexible hours. Work schedule updated a week in anticipation.", "Cons": "Very high paced work environment, even in comparison to other fast food jobs."}, "3": {"Date": " Jun 5, 2017", "Summary": "\"Crew Trainer\"", "Pros": "Able to be a leaderAble to growPay isn't bad", "Cons": "long hours so the work life balance isn't the bestpoor management"}, "4": {"Date": " Jun 5, 2017", "Summary": "\"Typical part time college job.\"", "Pros": "Always hiring and easy to gain experience.", "Cons": "After a month I was over working there."}, "5": {"Date": " Jun 5, 2017", "Summary": "\"not impressed\"", "Pros": "You get a good amount of hours", "Cons": "not accommodating to my schedule"}, "6": {"Date": " May 20, 2017", "Summary": "\"Great first job\"", "Pros": "There were many opportunities, even while I was in high school, to move up (I was promoted within 6 months of working there). The people I worked with were great and it was a fast paced environment that gave me excellent work experience.", "Cons": "The pay wasn't the greatest (minimum wage) but what else can you expect working at a fast food chain? I don't have any other cons except customers can be hard to handle sometimes!"}, "7": {"Date": " May 21, 2017", "Summary": "\"Great company\"", "Pros": "Good pay, friendly atmosphere, paid every week", "Cons": "There were no cons for me."}, "8": {"Date": " May 21, 2017", "Summary": "\"Great Beginning\"", "Pros": "Great first jobGreat first job for customer experienceOpportunities to get some decent hoursCan easily become a managerEasy jobMany people to work withMany people to meet", "Cons": "Low paySome management sucks to work withCustomers (but minor)Standing for hours"}, "9": {"Date": " Jun 26, 2017", "Summary": "\"Cashier\"", "Pros": "Easy hireLocations are everywhereFree foodDiscounts on ordersGood hoursSteady workFlexible on hours, but not for school", "Cons": "Constantly being belittledPoor management leading to an inefficiently ran store.Horrible with college, lack of administration to assist you with college hours"}}