{"0": {"Date": " Apr 12, 2016", "Summary": "\"for starters\"", "Pros": "Great service great place to grow in people skills", "Cons": "Not enough money if you have a large family"}, "1": {"Date": " Apr 26, 2016", "Summary": "\"Its fast food\"", "Pros": "Your experience will rely heavily on management and coworkers. Management is often understanding and will forgive being late if you call and let them know ahead of time.", "Cons": "The customer base for this place is completely terrible and a lot of people try to do whatever it takes to get free food or a discount. Management is often under trained. I got called in nearly everyday I had off."}, "2": {"Date": " Apr 26, 2016", "Summary": "\"Mcdonalds howard beach\"", "Pros": "Nice people to work with.", "Cons": "It gets hot and sweaty"}, "3": {"Date": " Apr 27, 2016", "Summary": "\"McDonalds review\"", "Pros": "I found working at McDonalds was an alright first job for anyone, especially if you want opportunities for moving up in the company.", "Cons": "Working hours are more often stressful than they are beneficial, and unless you are dedicated fully to part time or full time, don't expect anything major out of working casually for the company."}, "4": {"Date": " Apr 11, 2016", "Summary": "\"Good\"", "Pros": "Good company only part time, but good people.", "Cons": "Low pay, uniform and some of the employees."}, "5": {"Date": " Apr 25, 2016", "Summary": "\"its ok\"", "Pros": "There is room for growth", "Cons": "The area supervisor is very rude and have unrealistic expectationsVery low employee retention"}, "6": {"Date": " Apr 26, 2016", "Summary": "\"Meh\"", "Pros": "You have some form of money coming inYou get a food discount, if you're willing to eat it", "Cons": "Management can be a bit aggressive, it feels like they think you're incompetent unless you prove otherwise"}, "7": {"Date": " Apr 26, 2016", "Summary": "\"Meh\"", "Pros": "Working with plenty of very colorful people, not to mention some spare cash on the side of my current studies. I can't think of anything else to say.", "Cons": "People are often rude and management usually doesn't care about your needs or morals. We are told to ring up customers at more than they are supposed to pay."}, "8": {"Date": " Apr 26, 2016", "Summary": "\"Just say no\"", "Pros": "Well you got a crap ton of hours so I guess thats a pro if your super poor and don't mind still being poor but slightly less poor", "Cons": "Terrible pay, like the worst. Also there are not many open spots to take off time when you need to. Also it's basically run by high schoolers and drug dealers who can't get other work"}, "9": {"Date": " Apr 27, 2016", "Summary": "\"Part-Time Front Counter\"", "Pros": "You can sometimes get free or discounted food and it's close to home.", "Cons": "The employers are mean and it's a fast-paced, multi-responsibility, high-stress environment."}}