{"0": {"Date": " Dec 21, 2016", "Summary": "\"Employee\"", "Pros": "So far a great place to work", "Cons": "I have no cons about the job"}, "1": {"Date": " Jan 26, 2017", "Summary": "\"Bleh\"", "Pros": "Ate lots of burgers when I worked there", "Cons": "Got fat when I worked there"}, "2": {"Date": " Jan 5, 2017", "Summary": "\"cashier\"", "Pros": "free food. free uniform. Sometimes you get your weekends off. flexible schedule.", "Cons": "On your feet all the time. Managers could be jerks. Watch you when you are on breaks."}, "3": {"Date": " Dec 22, 2016", "Summary": "\"Department manager\"", "Pros": "401k, health and dental insurance, management training and certifications give you college credits that are transferable to alot of colleges in the country. Great team building skills, and communication skills are learned. I started out at McDonald's when I was 16, I am now 20 years old with great management and work experience under my belt. You truly get out of this job what you put in to it. The options for advancement are limitless and most franchise owners and corporate employees started out at store level. If you have the mentality that you can do well in anything you do, and you want to always learn new things, McDonald's is an awesome place to work.", "Cons": "Very fast paced and sometimes stressful environment. In high volume stores things are very fast paced and sometimes crew don't expect the level of difficulty"}, "4": {"Date": " Jan 4, 2017", "Summary": "\"Server\"", "Pros": "Free food if you wanted it.", "Cons": "Come on, serving food all day to people."}, "5": {"Date": " Jan 4, 2017", "Summary": "\"Crew Member\"", "Pros": "Free Meal each work day", "Cons": "1 Standing on feet all day long2 Most customers are rude3 Low pay4 Ugly uniforms"}, "6": {"Date": " Jan 26, 2017", "Summary": "\"Not loving it\"", "Pros": "Decent amount of hours, free meals,", "Cons": "They don't care about their employees, horrible GM"}, "7": {"Date": " Jan 4, 2017", "Summary": "\"Ok Time\"", "Pros": "Very nice people to work with.", "Cons": "Awful job responsibilities are given."}, "8": {"Date": " Jan 4, 2017", "Summary": "\"cook\"", "Pros": "good benefits, lots of available shifts", "Cons": "managers can be rude and demandin"}, "9": {"Date": " Dec 20, 2016", "Summary": "\"Business Technology Analyst\"", "Pros": "I like the fact they have Summer Hours", "Cons": "treatment of contractors versus employees"}}