{"0": {"Date": " Dec 20, 2016", "Summary": "\"crew member\"", "Pros": "Some of the best reason I believe to work at McDonalds is to meet new people have more responsibility .", "Cons": "Some bad reason would probably be its hard to get a job there with low job experience ."}, "1": {"Date": " Jan 2, 2017", "Summary": "\"Crew Member\"", "Pros": "Worked with school schedule. Customer service experience. Plenty of options for shifts. Management was understanding and would help find someone to fill-in for you when needed.", "Cons": "Long hours. McDonald's sucks. Coworkers are not always top tier. May have to work early mornings or late nights. The outfit for work is bad"}, "2": {"Date": " Jan 2, 2017", "Summary": "\"It's a good starter if your looking for a job or need something to do.\"", "Pros": "Customer service experienceEasy hiringFast learningBiweekly checksNothing else really", "Cons": "Nerve wreckingAnnoyingCattyGhettoInflexiblyConflicts with workersFavors some people over the other"}, "3": {"Date": " Jan 2, 2017", "Summary": "\"Shift Manager\"", "Pros": "Its a job that can help you through school and something that can carry you along the way..", "Cons": "This job is not for everyone and you must have a strong back bone to work there"}, "4": {"Date": " Jan 2, 2017", "Summary": "\"Crew Trainer\"", "Pros": "Learning more and preparing for manager in training.", "Cons": "The pay is not comensurate for the services I provide."}, "5": {"Date": " Dec 19, 2016", "Summary": "\"Lobby attendant\"", "Pros": "Nice working conditions. The other employees are nice. There was never any quables over pay. Customers were great.", "Cons": "Minimum wage. No health insurance."}, "6": {"Date": " Jan 23, 2017", "Summary": "\"nope\"", "Pros": "none at all fast food sucks", "Cons": "everyting about mcds is a con"}, "7": {"Date": " Jan 2, 2017", "Summary": "\"Mcdonalds cashier\"", "Pros": "They have really Good benefits", "Cons": "The manager is a child and has poor training skills"}, "8": {"Date": " Jan 2, 2017", "Summary": "\"My boss was always high\"", "Pros": "None really, I hated this job", "Cons": "Everyone was mad disrespectful, the employees and customers"}, "9": {"Date": " Jan 2, 2017", "Summary": "\"I have never been this miserable\"", "Pros": "free food, cool people, pretty flexible schedule", "Cons": "they never got my schedule right, didn't train me at all, management was very unorganized, little to no communication about specials going on, sometimes never got my breaks during 7 hour shifts, gross customers like to hit on me"}}