{"0": {"Date": " Jun 6, 2016", "Summary": "\"Grill manager\"", "Pros": "Free employee meal discounts sometimes 10 minute breaks", "Cons": "Shifts can be tiring and busy at hours"}, "1": {"Date": " Jun 20, 2016", "Summary": "\"Don't work Franchise-My store went from corporate to franchise. Big Deal Breaker\"", "Pros": "Corporate-very caring towards their employees. I was getting raises just for staying longer and good performance, making more money than other teens my age. Lots of benefits for managers. Wasn't much of a McDonald's eater, but we got free meals. Management wasn't shady. Friendly and diverse environment.", "Cons": "Franchise-My store was sold without notification to the previous general manager. So within a month we were under new management and new rules. I don't mind rules, we need them. But the requests that these new owners made were ridiculous, discriminatory, and just simply to be able to get us to quit. We had our same pay, but any newcomers had to start with minimum wage, and there was no promise to anyone of growth. No free meals or discounts for those it really matters to. This store was bought out by Cubans from Hialeah, who then brought more Cubans (mind you they were only in the states for about a year) to run the store. What was once diverse with EVERY type of employee was then predominately black and mainly Hispanic (I'm a Hispanic who doesn't speak Spanish). These people played shady and wouldn't pay employees on time or accordingly. Did everything to make us quit. There was no respect between anyone, managers to managers, employees to managers, and even employees to employees. Most importantly, the friendly and welcoming standard that we followed when it was corporate was no longer there. Our ratings went down, while our prices increased significantly. Very uncomfortable environment. They wanted us to sell large meals without telling customers and then give them the normal medium. I refused to play their game.I stayed for the pay and to be the only normalcy in that whole store. But enough is enough and I need to grow and get better opportunities, and most importantly be treated like a human being."}, "2": {"Date": " Jun 20, 2016", "Summary": "\"Mcdonalds slalary\"", "Pros": "its good for your first job experience.", "Cons": "some of the customers that you have to deal and are ridiculous with their attitude if you get anything wrong."}, "3": {"Date": " Jun 20, 2016", "Summary": "\"RGM\"", "Pros": "Great Training for operations and Business Management", "Cons": "Not many advancement opportunities after general manager. Bonus program could be better."}, "4": {"Date": " Jun 5, 2016", "Summary": "\"Cook\"", "Pros": "great management and opportunities for advancement", "Cons": "not enough pay for work"}, "5": {"Date": " Jun 21, 2016", "Summary": "\"Mc Donalds review\"", "Pros": "got to work with the public", "Cons": "had to cover a lot of extra shifts due to people calling off work"}, "6": {"Date": " Jun 5, 2016", "Summary": "\"Crew Member\"", "Pros": "Discounted meals, flexible hours, work well with college students, and since it's fast food you get a higher wage than other minimum wage jobs currently.", "Cons": "Gossip among workers, managers can be bad, customers freak out on you occasionally, and also getting drunk kids coming through the drive-thru late at night."}, "7": {"Date": " Jun 5, 2016", "Summary": "\"Good Company\"", "Pros": "Good job opportunity, easy money, followed rules", "Cons": "prestige may not be the best"}, "8": {"Date": " Jun 5, 2016", "Summary": "\"McDonald's review\"", "Pros": "Friendly coworkers; Good pay for a high school/college student; Flexible schedule", "Cons": "You'll find rude customers every now and then"}, "9": {"Date": " Jun 6, 2016", "Summary": "\"Cook\"", "Pros": "Get to eat some food for your hard work. Workload was busy so the day kind of just flies by", "Cons": "People have a stigma even though this job shouldn't be taken so seriously like let's all relax"}}