{"0": {"Date": " Nov 27, 2016", "Summary": "\"I just didn't like it ! They didn't treat me right :/\"", "Pros": "50% off on AnythingScholarship", "Cons": "too much work for minimum wage"}, "1": {"Date": " Nov 28, 2016", "Summary": "\"GM\"", "Pros": "Great people, staff, very fast paced.", "Cons": "Long hours, high turnover, constantly retraining. Now open everyday of the year"}, "2": {"Date": " Nov 10, 2016", "Summary": "\"Shift manager\"", "Pros": "Most of the staff were friendly. Flexible schedule", "Cons": "the pay was low, even in a management position"}, "3": {"Date": " Nov 12, 2016", "Summary": "\"Cashier\"", "Pros": "Very nice staff and people.", "Cons": "Manager was the only problem he kept pushing me to work day i clearly said i couldn't."}, "4": {"Date": " Nov 12, 2016", "Summary": "\"It is a great job, honestly.\"", "Pros": "Making people happy is what I like most about this job. I feel like it makes me happy to make people happy.", "Cons": "Stress is a major obstacle in this type of job. It can be difficult, but it is a good paying job."}, "5": {"Date": " Dec 18, 2016", "Summary": "\"Never again\"", "Pros": "Coworkers are great and nice, some customers were very nice and sweet, shift managers were all very cool and great", "Cons": "Horrible management, says they're flexible with the schedule but not true, general manager always had something negative to say, customers were very rude"}, "6": {"Date": " Nov 26, 2016", "Summary": "\"Cook\"", "Pros": "Cooking area, Great to get along with , Nice attitude, Good Behavior and ready to work", "Cons": "Cooking working on different areas"}, "7": {"Date": " Nov 11, 2016", "Summary": "\"awesome\"", "Pros": "10/10 would mcdonalds again and again", "Cons": "nothing was con everything was pro"}, "8": {"Date": " Nov 11, 2016", "Summary": "\"Work\"", "Pros": "Schedule was flexible. Some coworkers were cool. Got to meet alot of decent customers that were fun to interact with.", "Cons": "The pay wasn't great. Management was bad. Always smelt bad when leaving work Could never get smell out of uniform. Only one uniform provided."}, "9": {"Date": " Nov 11, 2016", "Summary": "\"mcdonalds\"", "Pros": "I have a job that i can make money at and not hate the job i do every day... to help my grandmother with our household bills.", "Cons": "this job is for the night shift so i will be sleeping during the day and awake all night ..... and some times their are stupid people the are disrespectful and just plain mean customers."}}