{"0": {"Date": " Feb 15, 2016", "Summary": "\"Ummmm...no\"", "Pros": "The only pro I have witnessed during my time there has been 50% off meals if you work.", "Cons": "I work at one of the busiest Mcdonald's in my area. It's a long tedious job it's great if you don't mind jogging around at 7 in the morning. I work with a bunch of Spanish speakers they constantly undermine authority and there are several families/relatives of people where I work so there is quite a bit of nepotism going on.I have witnessed a person drop a bag of fries on the ground only to pick them up and put them back in the fry machine. I also have witnessed a few ladies drop pancakes on the ground twice only to put them back in the cabinet. I have witnessed the same ladies working to make people's food without using gloves, even when told to put some on they ignore. When they do wear gloves and the rest of us are made to wash and sanitize (which you should do often) they never do. The men and women work together yet the women do not have to restock anything before leaving. They always leave on time regardless of whether someone shows up to relieve them of their shift, for the rest of us we are made to stay and wait for someone to show up.The store is constantly understaffed or people are sent home early for high labor which leaves the rest of us covering more than one department at a time but still get yet yelled at about our time management. The other day we were down two people and even though we were swamped and running around like some ant hill that had been set on fire we were still yelled at for not helping get pancakes or burritos for the person who was down prepping salads or if I big mac shows up on the screen even though we have other orders to make they yell at us that the big mac needs to be made even though it's only been 7 seconds (\"Come on, guys how long does it take to make a big mac?!?!\"Like I said management is very disorganized and hard to understand through thick accents or broken english what they are actually wanting you to do and then they treat you dumb for not understanding or they ask you to do something you haven't been trained on only to find that when you mess it up they are all over your case.Hours are supposedly flexible but I constantly hear other employees telling me about how they don't get the days off they ask for.The only part of the uniform that was provided was the shirts the rest of it you have to purchase.Overall it's a tough job with a lot to put up with for such little pay. It is the only job i've ever had that I wouldn't recommend to anyone else unless you are desperate which would probably explain the type of employees that work there. So far I haven't witnessed any drug tests or background checks so if you're a felon this is the job for you..."}, "1": {"Date": " Jan 25, 2016", "Summary": "\"Not a favorable experience\"", "Pros": "Flexible hours, free employee meal, employee discount, free uniforms", "Cons": "Very high-stress environment, lots of unnecessary drama, poor management, low pay, not much advancement opportunity"}, "2": {"Date": " Jan 10, 2016", "Summary": "\"Great opportunities for development\"", "Pros": "Always a new challenges, Working with a diverse team. There is an endless line off career opportunities through McDonald's. College tuition assistance and other great benefits. Good Pay compared to other fast food locations.", "Cons": "There is always the problem with training. Never enough managers at any location. Not enough crew at most locations. Extremely high turnover rate. Hard to motivate crew and managers to give best service. Department managers and General Manager are forced to run shifts due to low manager count, so no time for administrative opportunities and troubleshooting."}, "3": {"Date": " Jan 11, 2016", "Summary": "\"Fine for part-time\"", "Pros": "Met a lot of great people. Managers provided flexible hours while I was in school.", "Cons": "Stress levels/success of a shift is completely dependent on other shift mates/managers."}, "4": {"Date": " Jan 25, 2016", "Summary": "\"A job\"", "Pros": "Got along with the staff and management and hired quickly.", "Cons": "The food isn't that great but it's getting better, I guess. Can't get benefits fast enough but that's how it is almost everywhere it seems."}, "5": {"Date": " Jan 25, 2016", "Summary": "\"Great First Job\"", "Pros": "This is my first job opportunity and it has taught me a lot about responsibility, accountability, and customer service.", "Cons": "The pay is too low for the level of responsibility I have. I would like to see the minimum wage increased and that would also improve the talent level."}, "6": {"Date": " Jan 9, 2016", "Summary": "\"Crew Member\"", "Pros": "its a pretty good job. this was my first job. I knew a lot of people that already worked there so it was easier for me.", "Cons": "if you didn't do something right and they were in a bad mood they could send you home if they feel like doing it."}, "7": {"Date": " Jan 23, 2016", "Summary": "\"Fry cook\"", "Pros": "Fun free food burgers fries", "Cons": "Grease, bad customers unhealthy food"}, "8": {"Date": " Jan 23, 2016", "Summary": "\"Great place to work for someone who needs flexible hours\"", "Pros": "- Easy to learn job- Flexible hours & scheduling- Learn valuable customer service skills- Learn to multi-task more efficiently- Consistent", "Cons": "- Internal politics- Not much room for growth- No raises given to anyone at the location I work- Often you are expected to do the things managers should be doing while they stand around and talk- Inconsistent times for your breaks and you often have to stay later than you're scheduled for- Most importantly, in my opinion. The amount of work you do is not worth what you're paid, assuming the location you work is frequently busy."}, "9": {"Date": " Jan 23, 2016", "Summary": "\"na\"", "Pros": "free food at the brake time", "Cons": "i thins there is nothing bad to say"}}