{"0": {"Date": " Mar 2, 2016", "Summary": "\"manegment was horible\"", "Pros": "there are no pros at all", "Cons": "had the job for a little over a month and i quit because they wouldnt work with me im in school"}, "1": {"Date": " Feb 9, 2016", "Summary": "\"Awful experience\"", "Pros": "- 50% discount on everything on the menu except the value menu- Good job to start off at to get experience", "Cons": "- Co-Workers were awful and mean- I wasn't trained at all! I learned by myself and still I didn't even know what I was doing because I wasn't doing them the right way due to not being trained.- every time I asked for help or to be trained on something they would laugh at me or ignore me.- we were always short staffed"}, "2": {"Date": " Feb 9, 2016", "Summary": "\"Crew Member\"", "Pros": "You are able to experience what it is to have a first job, and I look forward to using what I learned there in the future.", "Cons": "If you do not like dealing with waves of customers coming in and out, this would not be a good place for you to work."}, "3": {"Date": " Jan 25, 2016", "Summary": "\"Crew Member\"", "Pros": "Lots of learning experience involved at a fast pace.", "Cons": "Have to keep on them about wanting to switch to service even then they probably wont switch you."}, "4": {"Date": " Jan 25, 2016", "Summary": "\"Mcdonalds career life\"", "Pros": "Great environment, flexible schedule, room for growth", "Cons": "No benefits, no overtime pay, salary is poor."}, "5": {"Date": " Jan 25, 2016", "Summary": "\"McDonald's\"", "Pros": "Easy to advance in company", "Cons": "Limited high level positions available"}, "6": {"Date": " Jan 25, 2016", "Summary": "\"I loved it!!\"", "Pros": "I worked with great people that became good friends! I enjoyed the fast paced work routine.", "Cons": "Not enough pay and no benefits"}, "7": {"Date": " Feb 8, 2016", "Summary": "\"Crew Member\"", "Pros": "Flexible for college students seeking a few extra income.", "Cons": "Schedules are not fixed and are changing on a weekly bases."}, "8": {"Date": " Jan 24, 2016", "Summary": "\"Terrible place to work\"", "Pros": "Good food, great taste, good pricess.", "Cons": "Bad for your health, but I don't care."}, "9": {"Date": " Jan 24, 2016", "Summary": "\"McDonalds\"", "Pros": "community, fun, student advancement. Customer service", "Cons": "Hot headed co-workers sometimes, as well as hot headed customers"}}