{"0": {"Date": " Mar 10, 2018", "Summary": "\"Pays\"", "Pros": "Work with friends and get paid", "Cons": "low pay and tough hours"}, "1": {"Date": " Mar 10, 2018", "Summary": "\"Good job bad pay\"", "Pros": "This is a good job", "Cons": "This is not a job I can make a living on as a manager I get paid the bare minimum. Would be better if the job paid more"}, "2": {"Date": " Mar 10, 2018", "Summary": "\"Doesn’t pay overtime\"", "Pros": "Great mission . Some staff is great", "Cons": "Only great for those fresh out of high school"}, "3": {"Date": " Feb 20, 2018", "Summary": "\"Manager\"", "Pros": "Friendly staff, great working enivorment, fun to be around other people, you get to meet new people all the time", "Cons": "Rude customers, rude managers pretty mucj the same cons that every other job have"}, "4": {"Date": " Feb 23, 2018", "Summary": "\"A good starting job\"", "Pros": "You can learn a variety of skills if you continue to PERSIST in asking management to let you. If, and I do mean if you're competent at the jobs they put you on, you will be promoted. It's that simple. Otherwise you will be stuck at the same level with no advancement. Don't be afraid, reach out and try. Getting older does not entail new skills, effort and learning does.", "Cons": "Customers, customers, customers. I've seen them order fifteen mchickens in the drive thru, complicate them by subtracting or adding ingredients, and then change their order midways! Huge orders at the drive thru happens a LOT. Special added/subracted/cooked fresh orders happens a lot too.Beyond this, sometimes working with others can be a challenge because.... some of them are in high school. Some high schoolers don't take their work seriously and play on the job. Then you have those who are older and have made mcdonalds their career. Some are nice, others... others are not, and still others are both.No matter what, if you're competent it goes a long way towards the leadership recognizing it and giving you more hours. Avoid conflicts with other workers as best you can, those who are troublemakers will be dealt with by management sooner or later."}, "5": {"Date": " Mar 9, 2018", "Summary": "\"McDonald's as a Cashier in Tennessee\"", "Pros": "Worked with my educational schedule", "Cons": "Did not pay as well"}, "6": {"Date": " Feb 22, 2018", "Summary": "\"Grill\"", "Pros": "They give you a chance", "Cons": "The pay rate could be alot better"}, "7": {"Date": " Feb 22, 2018", "Summary": "\"Crew\"", "Pros": "The reason to learn new skills", "Cons": "The hours may not reason with some people"}, "8": {"Date": " Feb 22, 2018", "Summary": "\"Sales\"", "Pros": "Awesome team to work with", "Cons": "None that I can think of"}, "9": {"Date": " Feb 22, 2018", "Summary": "\"Great for working as teen\"", "Pros": "Working at McDonald was obviously not fun but it was worth it for the experience and money", "Cons": "Everything you think would be a con"}}