{"0": {"Date": " Apr 16, 2016", "Summary": "\"sucks\"", "Pros": "PayFlexibleA lot of friendships made", "Cons": "Rude customersLow payRude managerHorrible benefitsGarbage"}, "1": {"Date": " Mar 26, 2016", "Summary": "\"Ehhh\"", "Pros": "Lots of hours if your availability is for the most part open. easy first job. not difficult", "Cons": "rude customers who have entitlement issues, bad management most of the time, nobody cares about you very much and the benefits arent all that great."}, "2": {"Date": " Mar 27, 2016", "Summary": "\"Bad location to work.\"", "Pros": "Easy job to get.", "Cons": "Franchise owned. Lower pay than corporate owned. Employees are super lazy and evening shift employees don't clean the store before they close lobby leaving people like who work the morning shift to clean up in the morning for a good 2 hours. Missing overtime pay. Hours edited to look like I am working less hours."}, "3": {"Date": " Mar 27, 2016", "Summary": "\"general manager\"", "Pros": "I prefer not to comment", "Cons": "You have to be in call all the time. If corporate managers were to come to the store, then you havr to be there no matter what. Your life circles around the job. You cannot enjoy quality time with your family because you have to work all the holidays and events, leaving you with the only one option of having to turn your family down every time. The overall life quality is very poor due to the high stress level this job brings into your life."}, "4": {"Date": " Mar 12, 2016", "Summary": "\"Management\"", "Pros": "Swing shifts, requests given, advancement", "Cons": "No breaks, under staffed"}, "5": {"Date": " Mar 25, 2016", "Summary": "\"Decent for fast food\"", "Pros": "Fast-paced job with a decent wage. Good for high school kids who are looking to earn a bit of extra money at a job that won't take up all their free-time.", "Cons": "The kitchen is sometimes very dirty and hectic but it's usually kept under control by management. Some of the co-workers are unpleasant but you'll get that anywhere."}, "6": {"Date": " Mar 25, 2016", "Summary": "\"Not what you expect\"", "Pros": "If you become a manager you get to take business classes for your training and the are actual college credits.", "Cons": "They don't pay well and don't treat their employees very well."}, "7": {"Date": " Mar 10, 2016", "Summary": "\"Cashier\"", "Pros": "Decent salary and room for growth", "Cons": "Bad work hours. Too much responsibility"}, "8": {"Date": " Apr 16, 2016", "Summary": "\"Never again\"", "Pros": "None it is one of the worst places I have ever worked. And after they fired me they got over on me for unemployment. Great job I guess for high schoolers.", "Cons": "I worked their 13 year and still didn't make over 9.50. They got upset due to the GM not having enough staff, so I couldn't do all that was needed as manager so I lost my job and then tried to say I quit mind u all this three days before Christmas and I have children."}, "9": {"Date": " Mar 25, 2016", "Summary": "\"Crew Member\"", "Pros": "50% off crew meals, co-workers can be interesting people", "Cons": "usual busy lunch rushes, customers can be rude"}}