{"0": {"Date": " Oct 12, 2017", "Summary": "\"Great First Job\"", "Pros": "Friendly coworkers and managers, flexible times", "Cons": "Greasy environments, rude customers, stands for long hours"}, "1": {"Date": " Oct 25, 2017", "Summary": "\"Former\"", "Pros": "Flexible hours especially for students and parents", "Cons": "Management could be more organized"}, "2": {"Date": " Oct 25, 2017", "Summary": "\"Overall the corporate version is wonderful to work for its the franchisee that's the issue\"", "Pros": "As long as you don't work you are safe from being fired.", "Cons": "Doing your job and getting results"}, "3": {"Date": " Oct 25, 2017", "Summary": "\"Meh... It's McDonald's...\"", "Pros": "Flexible scheduling is probably the biggest \"benefit\" for working at McDonald's. It's why lots of people work there when going to school/college. Free meals, at least for managers (it depends on if you're working for corporate or franchise). Half-price food up to a certain amount when ordering off-duty.", "Cons": "Low wages with little to no benefits, but again, it is a fast food place where almost anyone can work. Little room for growth. You can be promoted to a shift manager if you are a good worker and put forth the effort, but beyond that, it's very difficult to move up from there. Dealing with rude customers is probably one of the biggest downsides of working there."}, "4": {"Date": " Oct 26, 2017", "Summary": "\"Fast food part time job\"", "Pros": "I was able to choose my own hours and move my schedule when needed.", "Cons": "I have no cons from my time there!"}, "5": {"Date": " Oct 26, 2017", "Summary": "\"Cool First Job\"", "Pros": "flexible hours, food discount, little to roam around, not much responsibilities as you think", "Cons": "managers play favoritism and might call you to come in early or to cover shifts, filipino managers may talk about you but just think of it as you're not there to make friends but to make money!"}, "6": {"Date": " Oct 26, 2017", "Summary": "\"Decent job to earn cash, if your in the area.\"", "Pros": "Flexible hours, clean environment, good place to acquire your first job into high school.", "Cons": "Uniforms are just goofy, hot and uncomfortable. Managers seemed to be easly stressed/ annoyed. Hiring to many children."}, "7": {"Date": " Nov 15, 2017", "Summary": "\"General Manager\"", "Pros": "Large multi-billion dollar company. Opportunities to grow if your willing to stick a knife in the next persons back to help the bottom dollar.", "Cons": "Cash flow is number one and people never will be."}, "8": {"Date": " Oct 25, 2017", "Summary": "\"Okay\"", "Pros": "The job worked pretty well with my schedule. For most part, outside of main dinner hours, was pretty laid back.", "Cons": "Scheduled for days and times I was promised off upon hire. So focused on fast \"times\"that quality suffered."}, "9": {"Date": " Oct 26, 2017", "Summary": "\"okay for high school kids\"", "Pros": "free food flexible hours", "Cons": "under payedfast paced to the point of not being able to handle it"}}