{"0": {"Date": " Jan 27, 2018", "Summary": "\"Crew trainer\"", "Pros": "Discounts, some places do raffles and of you like kids lots of oppertunities to work with children.", "Cons": "Raises suck, getting rid of bonuses for crew, 3 years and i made a quarter raise every year except this year i finally made almoat 2 and its halfway through the year when I did so."}, "1": {"Date": " Jan 10, 2018", "Summary": "\"fast food chain with a clown mascot\"", "Pros": "cheap and a lot of salt on fries", "Cons": "the food is unhealthy and I hope the employees wash their hands"}, "2": {"Date": " Feb 16, 2018", "Summary": "\"Supporter of Wage Theft.\"", "Pros": "- There used to be a 50% discount on food, but even that has since been halved. Still, it's a discount.- Flexible hours.- Tasks are easy to learn.", "Cons": "- Horrendous management. Managers are often lazy, rude, and insulting. Work is often an actively hostile and toxic environment because of them. My mental health was at its lowest whilst working at McDonald's due to the poisonous attitudes of the managers. Every small mistake was openly and harshly berated.- Criminally understaffed.-Actively participates in wage theft. I was often made to come in an hour and a half before I was allowed to clock in, because they didn't want to pay for other employees to come in and open. You can't open the store with one employee in the hour they expected, and therefore forced the openers to illegally come in at three in the morning despite being unable to clock in until four-thirty.- Long hours with an illegally low number of breaks. We often worked twelve-hour shifts with nothing but a thirty-minute lunch break given to us.- No benefits. No stability.- Rude and entitled customers. Nothing more needs to be said."}, "3": {"Date": " Jan 12, 2018", "Summary": "\"mc donalds review\"", "Pros": "It teaches you how to really move fast and be focused and alert.", "Cons": "Everyone isnt so friendly, ive been working here for about 2 and a half months and everyone yells at you for everything I get we have to be fast but yelling doesn't make me wanna work yelling about an order I have isnt my fault when I have to wait on food"}, "4": {"Date": " Jan 13, 2018", "Summary": "\"Crew Member\"", "Pros": "The people work with are generally fun to be around. They make work worth it.", "Cons": "Low Wages, Inconsistent Scheduling, Fluctuation of hours weekly."}, "5": {"Date": " Jan 26, 2018", "Summary": "\"Laid back, but definitely grunt work\"", "Pros": "sometimes a fun environment and good coworkers. Understanding managers", "Cons": "you do all the grunt work and all the cleaning for atleast the first 4 months of employment because youre new"}, "6": {"Date": " Jan 26, 2018", "Summary": "\"This is an okay first job\"", "Pros": "- fast hiring- good teamwork- very organized", "Cons": "- customers can be unreasonably mean at times"}, "7": {"Date": " Jan 26, 2018", "Summary": "\"Crew Member\"", "Pros": "Nice coworkers, occasional slow times made for an easier shift.", "Cons": "Rushes can be daunting, managers always on you about customer wait times."}, "8": {"Date": " Jan 26, 2018", "Summary": "\"alright\"", "Pros": "you get a pay check", "Cons": "its pretty boring esp on long days"}, "9": {"Date": " Jan 26, 2018", "Summary": "\"Working at McDonald's\"", "Pros": "Get to meet lots of people, make people happy, always busy, making money.", "Cons": "Very stressful, rude staff/management, dirty, orders inaccurate more often than desired."}}