{"0": {"Date": " Oct 4, 2016", "Summary": "\"MCdonalds Employment\"", "Pros": "Nice Cowrkers lots of hours", "Cons": "Managers were not good"}, "1": {"Date": " Oct 4, 2016", "Summary": "\"Cashier/Food prep/Cook\"", "Pros": "Co workers are great given you're all on the same team", "Cons": "No raises. Can't move up. Denied management based on race"}, "2": {"Date": " Oct 4, 2016", "Summary": "\"McDonald's\"", "Pros": "Just okay, it's McDonald's so you're flipping burgers and shuffling fries. Management is lazy. Little room for advancement in the company.", "Cons": "Rude people rude staff rude management low pay no raises no advancements bad food dirty hygiene bad hours don't care about employees"}, "3": {"Date": " Sep 19, 2016", "Summary": "\"McDonald's is not a bad place to work and it's more than just flipping burgers.\"", "Pros": "Working at McDonald's you get a free meal everydayBenefits (Health,Dental, and vision)Paid time offWeekly pay41kEducation", "Cons": "It could be stressful and a lot of drama. Some coworkers feel like that don't have to do much and just stand around"}, "4": {"Date": " Oct 3, 2016", "Summary": "\"Fast food, it's what you expect\"", "Pros": "Employee discount on food.Flexible schedule", "Cons": "Management was spotty, some were great others not so much.High amount of work expected with low pay."}, "5": {"Date": " Oct 3, 2016", "Summary": "\"Mcdonalds full time cashier position\"", "Pros": "excellent food, great people, great deals", "Cons": "Long shifts and low pay"}, "6": {"Date": " Oct 4, 2016", "Summary": "\"Nice\"", "Pros": "Great staff. Flexible shifts given", "Cons": "Can't think of right now"}, "7": {"Date": " Oct 4, 2016", "Summary": "\"Lazy coworkers, bad location, but overall decent job.\"", "Pros": "Good first job. Learned a lot of skills here, like dealing with people and stuff. If you're looking for an okay job then work here.", "Cons": "Coworkers were rude, boss was ruder. Maybe it's just where I was located, but the customers treat you like crap too. But I guess that's business."}, "8": {"Date": " Sep 18, 2016", "Summary": "\"Department manager\"", "Pros": "Great benefits and excellent career opportunities", "Cons": "Tons of training long hours and work on holidays"}, "9": {"Date": " Oct 25, 2016", "Summary": "\"terrible\"", "Pros": "There is really nothing positive to say about the company other than it pays, but the pay is not enough, especially if your working with incompetent people.", "Cons": "-low pay-workers are bad, and the management is even worse-Everything in the store is falling apart-"}}