{"0": {"Date": " Jun 6, 2017", "Summary": "\"Cashier\"", "Pros": "Good first job for customer service.", "Cons": "Horrible place to work, managers dont care about your schedule."}, "1": {"Date": " May 16, 2017", "Summary": "\"Nice Start\"", "Pros": "Flexible scheduling, ability to level up", "Cons": "Abuse of scheduling, almost too many hours, very little compensation and wage."}, "2": {"Date": " May 1, 2017", "Summary": "\"Sandwich Maker / Grill\"", "Pros": "Nice staff to work with. Friendly and Helpful.", "Cons": "Lack of Training. Everyone has their own way, and they all train you the way that they do it. Hours are anywhere from 5:30 am to 1:00 am, never the same hours nor same day of the week that you work."}, "3": {"Date": " May 2, 2017", "Summary": "\"They have spent a lot of time developing and supporting my growth.\"", "Pros": "The development was great, I wouldn't be where I am in life with out their support. Each day is a different adventure and new and unique situations arise daily", "Cons": "It is a challenging environment in regards to working with people of all skill levels. It is a high pressure low reward environment."}, "4": {"Date": " May 2, 2017", "Summary": "\"Not a bad job\"", "Pros": "Growing wages. Flexible availability. Crew meals and discounts.", "Cons": "Fast paced. Lots of standing. Stressful."}, "5": {"Date": " May 15, 2017", "Summary": "\"Crew\"", "Pros": "Management is great, but only 2 of them.", "Cons": "Unable to work well with my hours, make people work when sick. (7050 knott ave location), threatened while working"}, "6": {"Date": " May 16, 2017", "Summary": "\"McDonalds\"", "Pros": "The managers were pretty good, and I was generally able to get along with all my coworkers as well.I worked here during high school, and they were pretty understanding about accommodating my schedule.If someone accidentally made the wrong food for an order, then the cool managers would let me take it and eat it on my break.", "Cons": "When it was busy, things tended to get rushed, hectic, and stressful.People quit all the time, so there were always a few workers that didn't know what they were doing.I was often required to stay past my scheduled shift to finish some task or another."}, "7": {"Date": " May 16, 2017", "Summary": "\"cashier\"", "Pros": "flexible and can make schedule", "Cons": "stressful, and no room for growth"}, "8": {"Date": " Apr 30, 2017", "Summary": "\"good job\"", "Pros": "Good food to eat", "Cons": "constant work on feet. standing"}, "9": {"Date": " Apr 30, 2017", "Summary": "\"A Better Job Starts With YOU\"", "Pros": "McDonald's provides thorough training for every element of the job and for every new sandwich that they introduce. Being promoted is easy if you are determined to follow procedure and learn to do your job to the fullest of your ability. In a managerial position, you have the power to promote good customer relations and ensure that your restaurant is enhancing the brand image of McDonald's. Most McDonald's are franchises and so it is not impossible meet your store owner and make suggestions for how you can improve your restaurant. Overall, there is no one aspect of a job at McDonald's that is particularly difficult and so this is a job for everyone. With many restaurants being open 24 hours, work schedules are incredibly flexible and so this makes McDonald's perfect for those looking for part-time supplemental income or students who are only available on weekends.", "Cons": "The negative stigma against all minimum wage jobs is directed towards McDonald's in particular because they are the largest fast food chain. This creates a vicious cycle of perceived job insignificance which leads to poor job performance which leads to poor job satisfaction. Unfortunately, many restaurants succumb to this influence until it becomes a part of their culture and eventually becomes obvious to customers, which then adds to the negative stigma."}}