{"0": {"Date": " Aug 8, 2017", "Summary": "\"Cashier\"", "Pros": "I can work any hours and have experience on cashier jobs", "Cons": "I have hard time standing a lot but can do"}, "1": {"Date": " Jul 2, 2017", "Summary": "\"Good Starting Job\"", "Pros": "McDonald's is a good place for those who want to work part time and go to school. They work well with your schedule.", "Cons": "I wasn't a fan of coming home and smelling like the job, but it's an honest living."}, "2": {"Date": " Jul 2, 2017", "Summary": "\"Good place for start\"", "Pros": "Lots of free food whenever you want it. Managers don't care if you eat a nugget here or there.", "Cons": "During busy hours, they really make you work. Sometimes there's only one person on grill and one on table, which makes us have to run and slide all over the place to get the food ready."}, "3": {"Date": " Jul 3, 2017", "Summary": "\"Good\"", "Pros": "My coworkers are great (for the most part)Flexible hours that work around my college scheduleThe pay is pretty good.", "Cons": "Drama is a serious issue"}, "4": {"Date": " Jul 16, 2017", "Summary": "\"Worked at mcdonalds\"", "Pros": "Worked at McDonalds for a year and a half. I ha to switch to corporate because its closer to where I stay I usually work 8 hrs or more. If not that I am very consistent to my job", "Cons": "Working at McDonalds is probably the worst thing I ever chose. Managers doesn't stay flexable with my schedule . they will lie on you if you ever had a situation they dont like because you aren't doing it the way they want it too be done even though your doing it the right way"}, "5": {"Date": " Jul 16, 2017", "Summary": "\"Grill hand\"", "Pros": "It is a fun loving work environment full of great people. It has a very relaxed work schedule and its flexibility with calling in is very good.", "Cons": "It has some risk involved such as grease burns on the hands and various other parts of the body. I have also come into question about the safety precautions involved in moving and storing produce."}, "6": {"Date": " Jul 1, 2017", "Summary": "\"good\"", "Pros": "you are able to eat free food", "Cons": "expect to have a little overtime"}, "7": {"Date": " Jul 2, 2017", "Summary": "\"Cashier\"", "Pros": "Great place to work, great people", "Cons": "Not long enough breaks, they need to be an hour"}, "8": {"Date": " Jul 2, 2017", "Summary": "\"Good\"", "Pros": "They are flexible with your schedule", "Cons": "The pay really isn't good"}, "9": {"Date": " Aug 6, 2017", "Summary": "\"Management\"", "Pros": "Flexible schedule, promotions if you are of Spanish culture", "Cons": "Favoritism, Prejudices, disrespect, poor training, and lack of direction"}}