{"0": {"Date": " May 22, 2016", "Summary": "\"Cashier\"", "Pros": "Good worker fast worker fast learner", "Cons": "Showing up late not working fast slow learner"}, "1": {"Date": " Jun 27, 2016", "Summary": "\"Afwul Place to work\"", "Pros": "The people I worked with.", "Cons": "Everything. The pay. The bosses, and the hours"}, "2": {"Date": " May 17, 2016", "Summary": "\"Major transformation underway\"", "Pros": "Valued employees are compensated to stick aroundPassion for the brandFascinating time to be at a iconic brand undergoing significant changesGreat career opportunities for employees in the digital space", "Cons": "Little willingness to innovate or try new ideasOfficers manage to the interests of the executive team, not to the good of the businessLimited job security if you're not in Digital"}, "3": {"Date": " Jun 5, 2016", "Summary": "\"OK\"", "Pros": "Good starter job for someone inexperienced", "Cons": "Not for the long term"}, "4": {"Date": " May 16, 2016", "Summary": "\"Not that bad.\"", "Pros": "I liked working there because they are very flexible with your schedule. I never had a problem with adjusting my schedule or asking for days off. I also liked working there because the tasks are not too complicated. I know this may sound crazy to others, but I really did enjoy providing good customer service. Seeing the happy faces in others made me feel happy.", "Cons": "Sometimes.....there was some crazy customers that came out of the nowhere. Sometimes when the job got really busy we were not given breaks till after several hours."}, "5": {"Date": " May 21, 2016", "Summary": "\"Positive Experience\"", "Pros": "Good first job, gain experience in customer service", "Cons": "Can get a little hectic during rush periods"}, "6": {"Date": " Jun 4, 2016", "Summary": "\"Manager\"", "Pros": "Good experience in a fast paced environment. Excellent setting to get your feet wet in a management setting. You can learn a lot about how a business is ran from this position", "Cons": "If servicing customers isn't a passion of yours then this job will be rather unrewarding. Ungrateful people can make the job frustrating when you are short staffed and doing everything you can."}, "7": {"Date": " Jun 4, 2016", "Summary": "\"It's A Job\"", "Pros": "Usually like the people that you work with and managers pretty friendly", "Cons": "Low wages, they toy around with the hours often so not much stability there which is nerve racking."}, "8": {"Date": " Jun 4, 2016", "Summary": "\"Job\"", "Pros": "Gave consistent hours where I lived.", "Cons": "Stressful environment only because of my situation."}, "9": {"Date": " Jun 5, 2016", "Summary": "\"My Experience at McDonald's\"", "Pros": "Managers were nice, could get anything I wanted off the menu, customers were alright", "Cons": "Supervisors had nasty attitudes, customers were sometimes disreapectful"}}