{"0": {"Date": " May 25, 2016", "Summary": "\"Team Member\"", "Pros": "-flexibility with hours-wasn't hard work", "Cons": "-poor management-too many people not enough hours"}, "1": {"Date": " May 4, 2016", "Summary": "\"Starting Job Only\"", "Pros": "Learn to develop a work ethicManagers tend to listen to Crew", "Cons": "FavoritismHour Cutting due to over employment"}, "2": {"Date": " Apr 18, 2016", "Summary": "\"Good Entry level Job\"", "Pros": "Food DiscountPay is above minimum wage", "Cons": "You have to be really fast and Multi-tasking at the same time."}, "3": {"Date": " Apr 19, 2016", "Summary": "\"Manager\"", "Pros": "I have great customer service skills,self motivated, I've been a shift manager for 4 years,I can multi task", "Cons": "Don't have non I love to work for this company"}, "4": {"Date": " Apr 19, 2016", "Summary": "\"Manager\"", "Pros": "Free nuggets and shakes. Scheduling flexibility. Hot girls come in sometime but that is okay I guess. Decent benefits.", "Cons": "I didn't get to eat as many fries as I wanted. Also I didn't get $15 and hour like they're pushing for right now."}, "5": {"Date": " May 2, 2016", "Summary": "\"Cook\"", "Pros": "The pro of working here is a lot of hours and decent breaks. Plus the employee discount is nice.", "Cons": "They overwork people sometimes and some of the managers don't respect theit employees."}, "6": {"Date": " May 3, 2016", "Summary": "\"Crew member\"", "Pros": "Hours, and making great relationships with new people!bi really believe they hire people with great personalities and therefore make working here a lot easier.", "Cons": "Pay and being called in to work out the blue. I think if they would do things like this it would make coming to work the next day a lot easier if you don't come when they called."}, "7": {"Date": " May 3, 2016", "Summary": "\"Asst Manger\"", "Pros": "Depends on the location and store Manager determines the workplace environment", "Cons": "Not organized, too MANY WOMEN IN ONE PLACE"}, "8": {"Date": " Apr 17, 2016", "Summary": "\"Overall good experience.\"", "Pros": "I liked the flexibility of hours that McDonalds offered. The pay was not that bad and the work was not overwhelmingly excruciating.", "Cons": "The pay could be better as well as maybe the number of hours that you are supposed to work, or the days."}, "9": {"Date": " May 23, 2016", "Summary": "\"Cashier\"", "Pros": "The are none that I can think of.", "Cons": "Customers are rude and management was unorganized."}}