{"0": {"Date": " Sep 27, 2016", "Summary": "\"Crew Member\"", "Pros": "I worked at night so it was way more chill than day because it was mostly drive thru. + My team was amazing, great managers at night. but the managers in the day was beyond horrible. Ended up cursing one out and got fired.", "Cons": "Horrible management in the day"}, "1": {"Date": " Sep 12, 2016", "Summary": "\"Amazing\"", "Pros": "I've learned so much! I love my 6 figure salary and the ability to grind up my employees in the back room (We use them for patties!) !", "Cons": "None at all what so ever!"}, "2": {"Date": " Sep 27, 2016", "Summary": "\"Restaurant manager\"", "Pros": "Benefits and 401k match are great", "Cons": "Ops Mgrs are very selfish. They don't care how they appear to sound not only to you but your peers and those around you! Very disrespectful."}, "3": {"Date": " Sep 27, 2016", "Summary": "\"Disapointing\"", "Pros": "good pay, good people and free food", "Cons": "selling junk, need to work more on providing healthy food"}, "4": {"Date": " Sep 11, 2016", "Summary": "\"It was ok\"", "Pros": "half off food and good manager and great pay during summer", "Cons": "attitudes with the customer and lack of some employers wont clean"}, "5": {"Date": " Sep 11, 2016", "Summary": "\"McDonald's\"", "Pros": "Fast Paced EnviromentFriendly staffYou will learn good cutomer service skills", "Cons": "Pay is Bi-WeeklyRude CustomersI personally dislike working in the back register position for drive thru"}, "6": {"Date": " Sep 11, 2016", "Summary": "\"Great starter job\"", "Pros": "Offers free meals with your shift.Great hours.Fun crew members", "Cons": "Employees are wishywashy about coming in for their scheduled shifts"}, "7": {"Date": " Sep 11, 2016", "Summary": "\"Mcdonalds Review\"", "Pros": "Flexible with scheduling and you get a free lunch every shift. Along with free uniforms and meet friendly people.", "Cons": "Hours you earn per week are pretty all over the place"}, "8": {"Date": " Sep 11, 2016", "Summary": "\"McDonald's\"", "Pros": "Great to work with customers", "Cons": "Some customers are tough to deal with"}, "9": {"Date": " Sep 12, 2016", "Summary": "\"alright for students\"", "Pros": "flexible schedule , work with school schedule", "Cons": "uniform required , no benefit at all"}}