{"0": {"Date": " Jul 11, 2016", "Summary": "\"mcdonald;s op manager\"", "Pros": "great environment, flexible hours, flexible scheduling, compensation", "Cons": "Fast paced, low education workforce, low motivated employees"}, "1": {"Date": " Jul 11, 2016", "Summary": "\"Stephon King\"", "Pros": "I am a very hard worker I well show up to work early all time I have great people skills good team work", "Cons": "really don't have any cons"}, "2": {"Date": " Jul 24, 2016", "Summary": "\"Former Employee Review\"", "Pros": "The environment was decent. Some co-workers were friendly and food perks is always a positive.", "Cons": "Schedule was a bit frustrating. Customers were rude and would get away with it. I had a customer scream at me in front of everyone the second day I was there. Training could be better. Managers constantly screaming at you can get a little frustrating as well."}, "3": {"Date": " Jul 24, 2016", "Summary": "\"MCDS.\"", "Pros": "Flexible schedule. Good benefits.", "Cons": "Limited hours, managers are too stuborn"}, "4": {"Date": " Jul 25, 2016", "Summary": "\"Manager\"", "Pros": "Very flexible schedule if in school or college", "Cons": "Requires weekends and holidays the hours are iffy and no incentives to being a \"valued\" employee"}, "5": {"Date": " Jul 5, 2016", "Summary": "\"Kitchen department head\"", "Pros": "I really loved my job and It provided me with the foundation. And the training the coaching to become a good manager", "Cons": "I feel a real con at my job was the upper management"}, "6": {"Date": " Jul 9, 2016", "Summary": "\"Assembly\"", "Pros": "Good people good work environment", "Cons": "Lack of communication very disorganized"}, "7": {"Date": " Jul 10, 2016", "Summary": "\"Nice job\"", "Pros": "Good people to work with", "Cons": "Constantly running, not enough time for a break, small pay."}, "8": {"Date": " Jul 23, 2016", "Summary": "\"excellent\"", "Pros": "I worked with people everyday and I am a people person.", "Cons": "There's always a challenging customer."}, "9": {"Date": " Jul 7, 2016", "Summary": "\"As a Crew Member...\"", "Pros": "Meeting new people and being able to put a smile on their faces. Always opportunities for advancement.", "Cons": "Messy, people quitting left and right, putting the wrong people as \"leaders\", employee training for service (contact with customers) needs major work. People don't listen and they do whatever they want."}}