{"0": {"Date": " Mar 22, 2016", "Summary": "\"Mickey ds\"", "Pros": "Not much rough place to work", "Cons": "Tough job, difficult customers, no stability"}, "1": {"Date": " Mar 7, 2016", "Summary": "\"Easy, repetitive job\"", "Pros": "Love the grill team! love working grill", "Cons": "Other workers lazy, inexperienced"}, "2": {"Date": " Mar 7, 2016", "Summary": "\"Fantastic place to work!\"", "Pros": "Very challenging environment. Demanding company to work for, but you are rewarded handsomely for your time.", "Cons": "Overall attitude is positive, but when it is negative, it is really bad. That doesn't happen often."}, "3": {"Date": " Mar 7, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Although entry level jobs obviously aren't the greatest, there are decent store management jobs. The hours are extremely flexible. You have opportunities for very quick career advancement with the high turnover rate there. They will give people chances who normally wouldn't get hired by an employer.", "Cons": "Pay can vary greatly depending on what franchisee you have. You may get called in to work very often depending on how busy it gets. You are always busy."}, "4": {"Date": " Mar 8, 2016", "Summary": "\"Great\"", "Pros": "Good food, good team and the training was quick and easy.", "Cons": "If you don't like people, this ain't the job for you. High intensity."}, "5": {"Date": " Mar 21, 2016", "Summary": "\"Interesting\"", "Pros": "It was fast paced and you can move up in the company. You are never bored and I love my regular customers", "Cons": "Being a manager is like babysitting. They started hiring 14 year olds again, which is ok, if they realized it was a job not a playground. Not enough pay for management"}, "6": {"Date": " Mar 22, 2016", "Summary": "\"its okay at times\"", "Pros": "Good pay, flexible hours, flexible workspace", "Cons": "everything else the managers the crew and the working enviorment"}, "7": {"Date": " Mar 22, 2016", "Summary": "\"maintenance worker\"", "Pros": "good hours over 40 plus", "Cons": "hard work all day long"}, "8": {"Date": " Mar 6, 2016", "Summary": "\"As great as you make it!\"", "Pros": "A lot of room for growth. Love the people I work with. Has good benefits, including tuition assistance, and a lucrative bonus program.", "Cons": "Sometimes work 50+ hours without compensation. Sometimes help is hard to find because some people think McDonald's is a \"joke job\""}, "9": {"Date": " Mar 7, 2016", "Summary": "\"It is what it is\"", "Pros": "Easy, not much effort, very flexible with you hours", "Cons": "Low pay, sometimes can be annoying with customers."}}