{"0": {"Date": " Mar 1, 2017", "Summary": "\"Cree Member\"", "Pros": "Friendly co-workers and a good place for leaders", "Cons": "Hard to get noticed (for management)"}, "1": {"Date": " Mar 1, 2017", "Summary": "\"Not As Bad As You Think\"", "Pros": "No job experience Required! That's one of the best reasons. Another one is that there are a lot of opportunities to advance within the company.", "Cons": "Your crew dictates how well your shift goes, so if you have a bad crew you can have a really bad day."}, "2": {"Date": " Mar 15, 2017", "Summary": "\"It's an okay job\"", "Pros": "The half off discount is cool if you actually like the food there.", "Cons": "The schedule is not set and sometimes I go from getting 15+ hours a week to getting 8."}, "3": {"Date": " Mar 16, 2017", "Summary": "\"Good coworkers, but frustrating clients.\"", "Pros": "My coworkers are very friendly. They know the struggle of being fast, and try to succeed with the clients expectations. They're more friendly to their coworkers than they are with their actual costumers, and it makes me feel they will always have my back.", "Cons": "Some clients are impaciente with their food, and some occasions they even try to out smart us to get free food. Ex: \"I didn't order this cheeseburger, but is ok. I'll take the double cheeseburger that I 'ordered' and take this cheeseburger, since is 'your' mistake.\""}, "4": {"Date": " Mar 16, 2017", "Summary": "\"it was a job\"", "Pros": "Cool people, could work more if i needed too", "Cons": "none, its what i expected"}, "5": {"Date": " Mar 16, 2017", "Summary": "\"Review\"", "Pros": "Flexibility, good work life balance", "Cons": "Terrible pay, not enough hours, management only promotes when someone has left a position otherwise using people to cover shifts and positions"}, "6": {"Date": " Feb 28, 2017", "Summary": "\"Accountant\"", "Pros": "All the free burgers you can eat.", "Cons": "I was stealing mayonnaise on the side."}, "7": {"Date": " Mar 1, 2017", "Summary": "\"grate place to work\"", "Pros": "grate hours and pay and people", "Cons": "hard rush hours and lack or space"}, "8": {"Date": " Mar 1, 2017", "Summary": "\"fries\"", "Pros": "fries, burger, coke, sprite, soda", "Cons": "garbage, seat, soft, soggy, trash"}, "9": {"Date": " Apr 5, 2017", "Summary": "\"Cashier\"", "Pros": "Easy money, great for first job", "Cons": "Not a lot of hours"}}