{"0": {"Date": " Nov 29, 2016", "Summary": "\"Drive Thru\"", "Pros": "Free lunch after 4 hours of work", "Cons": "Smelling like fast food all the time"}, "1": {"Date": " Nov 29, 2016", "Summary": "\"Team member\"", "Pros": "Teach you to work with different mood swings", "Cons": "Sometimes to busy but I enjoy it"}, "2": {"Date": " Jan 3, 2017", "Summary": "\"McDonald's cashier\"", "Pros": "I would only recommend this job to full time students that need to make money on the side. Free lunch...", "Cons": "Horrible hours, management, new employees everyday....."}, "3": {"Date": " Jan 4, 2017", "Summary": "\"Awful Experience\"", "Pros": "The people working with you were overall really nice.", "Cons": "The manager scheduled me for times I couldn't work, and then I got in trouble when I couldn't show up. Not fair."}, "4": {"Date": " Nov 28, 2016", "Summary": "\"i dont know what this means\"", "Pros": "I love interacting with people, and getting to know the people that come in everyday.", "Cons": "Some of the down sides of working here is that I didn't get that many hours."}, "5": {"Date": " Nov 29, 2016", "Summary": "\"part time\"", "Pros": "easy work to do there", "Cons": "you go home smelling like mcdonalds"}, "6": {"Date": " Nov 29, 2016", "Summary": "\"crew member\"", "Pros": "fast and easy work and full time was great", "Cons": "when other people don't complete their job"}, "7": {"Date": " Dec 12, 2016", "Summary": "\"Crew\"", "Pros": "Free Meals on half break, able to have flexabile hours only if you put it in employee Availablity book. Get to work with customers to help them learn what better deals there are to help them save money.", "Cons": "put in back drive through all the time and not trained in other areas in the store. as well as having to listen to people complain about there problems and put others down which is causing alot of tention in the work invirament, coworkers doughting each others possions and underminding there work that is being performed without discussing it with them personally..and another thing listening to faul language is not buisness ediquate and verry unatractive.. You dont get 6 months revew as you were told you would."}, "8": {"Date": " Dec 12, 2016", "Summary": "\"Good Stepping Stone\"", "Pros": "Learned a lot about Management and scheduling. It was hard with the constant turn over to maintain customer service", "Cons": "it's a Fast Food Place. You need to be aware of the realities, but franchisers are the ones who decide on the environment. So the better the franchise the better the environment for staff"}, "9": {"Date": " Dec 12, 2016", "Summary": "\"Okay\"", "Pros": "Work was as I expected, Decent colleagues, Good Company Culture, Some Flexibility, Kind Managers, and I had a good experience in general.", "Cons": "I believe that my salary was low for my work, and I would appreciate better benefits than those that I received."}}