{"0": {"Date": " Apr 28, 2016", "Summary": "\"Just a job\"", "Pros": "Co-workers, free meals, keeps you busy", "Cons": "Stress, crazy customers, unpredictable schedule"}, "1": {"Date": " Apr 28, 2016", "Summary": "\"Global Learning and Development manager\"", "Pros": "good benefits, good networking in other countries than USA", "Cons": "high hierarch, too many layers to make decisions, the customer suffer because wait too long for the benefit of the change.You have no voice if you have no power. No innovation"}, "2": {"Date": " Apr 28, 2016", "Summary": "\"Interesting to say the least\"", "Pros": "Exciting new change from being a general manager in retail to working in fast food. I loved getting people to smile everyday.", "Cons": "Under staffed and too many call outs do to lack of loyalty with in the restaurant. And zero appreciation for the extra things you do"}, "3": {"Date": " Apr 29, 2016", "Summary": "\"Job Review\"", "Pros": "Easy workgood experiencemake good friendsgood hours", "Cons": "Stuck at 7.25 in most locationshard to be promoted"}, "4": {"Date": " Apr 13, 2016", "Summary": "\"Worked for Mcdonalds\"", "Pros": "It doesn't take long to move up from crew member to crew trainer to make more money. Fun environment to work in when you have a cool crew.", "Cons": "Its very fast paced environment almost constantly. This job isn't for you if you are to sensitive and get your feelings hurt easily because some of the customers can be really rude for no reason. No matter if you are given a raise or not you will never be paid for all the work it takes to run the restaurant."}, "5": {"Date": " May 19, 2016", "Summary": "\"Depressing and Ghetto\"", "Pros": "free meals, basic skills, decent hours", "Cons": "unprofessional management, rude customers, unhealthy environment"}, "6": {"Date": " Apr 28, 2016", "Summary": "\"Long hours, little pay.\"", "Pros": "You get good solid work experience and learn how to work with people and how to work productively under pressure.", "Cons": "I got injured with a faulty fryer and they barely covered my treatment, and expected me back at work the next day."}, "7": {"Date": " Apr 29, 2016", "Summary": "\"mcdonalds\"", "Pros": "great place to work. great people. great food.", "Cons": "got burnt by the fryer"}, "8": {"Date": " Apr 13, 2016", "Summary": "\"McDonald's Crew\"", "Pros": "Friendly work environment, good manager, easy to keep pace in", "Cons": "Low salary, not lots of benefits"}, "9": {"Date": " Apr 27, 2016", "Summary": "\"Crew Member\"", "Pros": "Structured in a black and white manner you know what to expect each day pretty much. same ol.", "Cons": "Your manager could make your time on the clock hell on earth."}}