{"0": {"Date": " Jan 3, 2017", "Summary": "\"U.S. Business Lead\"", "Pros": "People create the business culture, and McDonald's Corp. is a customer-centric business focused on achieving success for Franchisee's, and company success.", "Cons": "I traveled for 19 years, and at times the travel was challenging but managable."}, "1": {"Date": " Jan 3, 2017", "Summary": "\"Crew member\"", "Pros": "The hours and the people", "Cons": "Not enough communication and alot of favoritsam"}, "2": {"Date": " Feb 9, 2017", "Summary": "\"Department Head\"", "Pros": "Great pay and benefits friendly environment great place for high school kids to gain work experience.", "Cons": "No structure or policy enforcer sometime not properly staffed"}, "3": {"Date": " Jan 18, 2017", "Summary": "\"McDonald's\"", "Pros": "It was a quick and easy job. No experience was necessary. You just had to apply for the job online then walk into the store and tell the manager you applied and your name is on the website application.", "Cons": "Starting at 4am, not finishing work until 2am, getting sent home half way through your scheduled work hours was common, and never getting a pay raise even if you train new employees, which should give you a $.25 raise by McDonald's standards."}, "4": {"Date": " Jan 19, 2017", "Summary": "\"Its not worth it\"", "Pros": "Discounts on Food. Best for kids or adults wanting extra money while attending school or need a second job.The location manager didn't know how to interview so it was easy for me to get a second and the second location manager didn't know either and I was hired. They basically asked questions, I gave answers and it was done. So don't worry about the interview, just show up and answer the questions and get hired.and", "Cons": "Pay is not competitive. Trainers, shift supervisors, department managers only make $.50 - $3 more than employees.If not all, over 90 percent of McDonalds are franchised. So owners vary and its hard to transfer if you want to got to a location not under your owner. Quality of the hiring process has weakened because store managers and owners don't have the management experience to properly interview candidates."}, "5": {"Date": " Jan 3, 2017", "Summary": "\"Assistant Manager\"", "Pros": "Easy, Fun, Fast Paced, Friendly", "Cons": "Lot of Energy Required, Extremely Rude People"}, "6": {"Date": " Jan 3, 2017", "Summary": "\"Marketing Manager\"", "Pros": "Good people to work with", "Cons": "Lack of direction was extremely difficult to navigate"}, "7": {"Date": " Jan 3, 2017", "Summary": "\"Manager\"", "Pros": "Room to move up in the business", "Cons": "Not like it use to be"}, "8": {"Date": " Jan 4, 2017", "Summary": "\"Cook\"", "Pros": "I would like a job that keeps me busy and has a good pay and maybe there would be room for advancement.", "Cons": "None that i know of"}, "9": {"Date": " Jan 17, 2017", "Summary": "\"Former worker\"", "Pros": "They were always willing to work with scheduling", "Cons": "They didnt manage people all the tme"}}