{"0": {"Date": " Jul 6, 2017", "Summary": "\"Great first job!\"", "Pros": "Great first game experience. Teaches you how to work as a team to accomplish goals.", "Cons": "Management can micromanage and cause interference. Of course this depends on which store."}, "1": {"Date": " Jul 6, 2017", "Summary": "\"Great\"", "Pros": "Loved the coworkers, felt like a family.", "Cons": "Bad salary and bad management"}, "2": {"Date": " Jul 7, 2017", "Summary": "\"!!!!\"", "Pros": "Fast paceCareer OpportunitiesChallengingRewardingThis job has taken my work ethic to a whole new level", "Cons": "On some days, my list of pros, is also be my list of cons."}, "3": {"Date": " Jul 20, 2017", "Summary": "\"Manager\"", "Pros": "Quick to move up in company, meet new people, try new products", "Cons": "Pay, insurance, lots of work if working late night"}, "4": {"Date": " Jul 20, 2017", "Summary": "\"starting job\"", "Pros": "Was able to build customer communication skills.They worked with your schedule.", "Cons": "Management had a lot of favoritism, so the workers who weren't on their good side or a favorite within the higher ups would get blamed for most of the mistakes of others."}, "5": {"Date": " Jul 21, 2017", "Summary": "\"Flexible\"", "Pros": "The hours at this job were very flexible, coworkers were very helpful!", "Cons": "At times I stayed later than expected because someone had called off from work."}, "6": {"Date": " Jul 5, 2017", "Summary": "\"Crew Trainer Work Pay Rate\"", "Pros": "The pay rate at McDonald's is good. The best job to start off with to get experience in the work force. While I was there I earned $7.75 per hour.", "Cons": "The only cons I had was being the only one in the kitchen at times when it was busy."}, "7": {"Date": " Jul 6, 2017", "Summary": "\"Cashier\"", "Pros": "I am out going works well with other also i am well to learn new tasks", "Cons": "It would be different for me i have not worked at a grocery store in a while but no i can adapt to change if i need to"}, "8": {"Date": " Aug 10, 2017", "Summary": "\"Janitor\"", "Pros": "My toilet was always clean", "Cons": "Other employees didn't care about the toilet"}, "9": {"Date": " Aug 11, 2017", "Summary": "\"My Experience at Maccas\"", "Pros": "Nice and friendly people", "Cons": "Rushed environment to work in"}}