{"0": {"Date": " Feb 15, 2016", "Summary": "\"high school work\"", "Pros": "it will keeps you very busy", "Cons": "its not the best pay"}, "1": {"Date": " Jan 26, 2016", "Summary": "\"Enterprise Architect\"", "Pros": "Small, agile teams empowered to set policy and drive progress. Quite a bit of opportunity to focus on things you find important.", "Cons": "Heavily outsourced, almost to a detriment. Very little knowledge kept as consultants and partners come and go."}, "2": {"Date": " Feb 13, 2016", "Summary": "\"Crew\"", "Pros": "Friendly staff and awesome discount", "Cons": "Horrible area to be located at"}, "3": {"Date": " Feb 13, 2016", "Summary": "\"Decent pay\"", "Pros": "If you work at Mcdonald's, make sure you move up to the assistant manager position. It's more pay for doing a little less work. Decent benefits.", "Cons": "Long hours and very tiring. I would not do it again if I could go back in time. Customers are the worst and rudest people who look down at you for working at Mcdonald's."}, "4": {"Date": " Jan 29, 2016", "Summary": "\"Intern\"", "Pros": "I met some amazing people through my internship that I'm still friends with today. You have access to top-level executives, learn about an amazing brand, work on a collaboration project to present to management", "Cons": "I knew people who worked alone and not with other interns. It's much better when you're together, to ask for help and bounce ideas off of one another."}, "5": {"Date": " Mar 5, 2016", "Summary": "\"Worst Job Ever\"", "Pros": "50% discount. That is all.", "Cons": "Abusive atmosphereHigh turnoverforced to stay lateNo recognition or performance reviews"}, "6": {"Date": " Jan 29, 2016", "Summary": "\"cashier\"", "Pros": "The pros about working their is meeting new people and that you know the money they get for charity goes to a good cause.", "Cons": "The cons about the job is that sometimes the people you work with sometime dont help. and sometimes you feel like you are doing everything your job and others."}, "7": {"Date": " Jan 29, 2016", "Summary": "\"Professionalism and Hospitality\"", "Pros": "Decent hours as well as days off, flexible with schooling schedules. Polite co-workers.", "Cons": "Slightly stressful environment, shifty hours."}, "8": {"Date": " Jan 30, 2016", "Summary": "\"crew\"", "Pros": "*They have excellent pay.*The coworkers are fantastic at what they do.*The morning as well as all other customers make me smile with so much generosity.", "Cons": "*The hours were not enough for me"}, "9": {"Date": " Jan 30, 2016", "Summary": "\"Fast service\"", "Pros": "Get to interact with my different people. Help the customers with what they need. Service is decent compared to other places.", "Cons": "Minimum wage is kind of low. The employees who put in the work should be rewarded fairly. Disrespectful employees should also be put in check."}}