{"0": {"Date": " Feb 24, 2018", "Summary": "\"Maintenance/ janitor\"", "Pros": "I started to work at mcds on july 21 2016, i have done everything from crew to maintenance, its a great start in the workforce and there very flexible with your life schedule.", "Cons": "Working at mcds is very stressful especially for my position , the pay is not very well its minimun wage . You will never be appreciated there for ypur hard work."}, "1": {"Date": " Feb 24, 2018", "Summary": "\"Good Entry Level Job\"", "Pros": "Flexible scheduling and room for growth. There's ample opportunities for enhancing skills like time management, money handling, problem solving skills. I always enjoy making customers smile during a simple interaction so it's an excellent job to hone your customer service skills.", "Cons": "High crew turnover, minimal appreciation, and rude customer interactions. There is often a noticeable split between individuals who at least want to do a good job and those who just want to make it through a shift alive. As an employee who went up the ranks, there were many times where I felt like I was unappreciated, despite working extremely hard to make sure the store was functioning and that customers were receiving the highest level of service."}, "2": {"Date": " Feb 25, 2018", "Summary": "\"Nice entry level job\"", "Pros": "Very good for someone looking to build work experience.", "Cons": "None come to mind ."}, "3": {"Date": " Feb 25, 2018", "Summary": "\"It's okay\"", "Pros": "I loved my awesome coworkers.", "Cons": "I don't like customer service"}, "4": {"Date": " Feb 25, 2018", "Summary": "\"Not really\"", "Pros": "free meals I guess .", "Cons": "Not really part time ."}, "5": {"Date": " Feb 9, 2018", "Summary": "\"Crew Member\"", "Pros": "Good Pay, Nice Breaks, Always Have Something To Do, Good Discounts.", "Cons": "Can’t Think Of Any Really."}, "6": {"Date": " Feb 9, 2018", "Summary": "\"Crew member\"", "Pros": "Very great first time experience, learns to multi task and Patience.", "Cons": "Low pay unfair with hire pay"}, "7": {"Date": " Feb 10, 2018", "Summary": "\"I need this!!\"", "Pros": "I will be going back to school in the fall to finish up. I have taken alot of classes. Lots of science medical field", "Cons": "I just need someone to give me a chance"}, "8": {"Date": " Feb 10, 2018", "Summary": "\"Fry Cook\"", "Pros": "the food tastes really good", "Cons": "the pay is really low"}, "9": {"Date": " Feb 10, 2018", "Summary": "\"Crew Member\"", "Pros": "Great pay along with great management", "Cons": "Organization within in the staff was not coherent"}}