{"0": {"Date": " Oct 15, 2017", "Summary": "\"Some good, some bad\"", "Pros": "Very lenient in terms of working around my school hours and generally easy to catch on to.", "Cons": "Some of the other employees were difficult to work with (that's a subjective issue, nonetheless). It also got a bit difficult at times to deal with \"hangry\" customers with a smile and patience, but the customer is ALWAYS right...even when they're not."}, "1": {"Date": " Oct 15, 2017", "Summary": "\"McDonalds\"", "Pros": "Very flexible. Easy to move up.", "Cons": "No incentive for employees to work harder than they want."}, "2": {"Date": " Oct 15, 2017", "Summary": "\"Decent\"", "Pros": "Flexible hours, free meals , great people/ customers. Pay can be decent. I can't think of much else to add.", "Cons": "I think that there is the same find as any job. Job can be very stressful, people can be very rude"}, "3": {"Date": " Oct 15, 2017", "Summary": "\"Too much for little money\"", "Pros": "None that I can think of. That says enough.", "Cons": "They make the poor desperate people take up the shifts others don't want or bail on last minute. They change schedules on the spot. The managers harass and play favorites. 3rd and Vermont btw. Awful."}, "4": {"Date": " Oct 16, 2017", "Summary": "\"Cashier\"", "Pros": "Good full time hours were worked", "Cons": "Hard to advance to the next level"}, "5": {"Date": " Sep 30, 2017", "Summary": "\"Great starter job\"", "Pros": "There is room for advancement, and if you have good management, it's great to work there.", "Cons": "The owners are usually tight wads and don't want to pay for upgrades that are needed."}, "6": {"Date": " Sep 30, 2017", "Summary": "\"I flipped the burgers\"", "Pros": "Got free big mac sauce", "Cons": "Had to pay for it"}, "7": {"Date": " Sep 30, 2017", "Summary": "\"Crew\"", "Pros": "Working here teaches you great customer service skills along With time management punctuation and detail", "Cons": "Somethings always broke managers have nasty attitudes pay is horrible."}, "8": {"Date": " Sep 29, 2017", "Summary": "\"Mc donalds\"", "Pros": "Working as a team and always having a smile on your face", "Cons": "Not getting out at the time you were scheduled and sometimes getting rude New employees"}, "9": {"Date": " Oct 13, 2017", "Summary": "\"Good co-workers, high stress customers\"", "Pros": "Easy job to get without previous experience", "Cons": "Customers are extremely rude and impatient"}}