{"0": {"Date": " Nov 20, 2016", "Summary": "\"An ok job\"", "Pros": "Fast paced, love working with variety of different people, always something to do.", "Cons": "I work 50 hours a week away from home and I dont get to see my children, doesnt pay enough"}, "1": {"Date": " Nov 4, 2016", "Summary": "\"Mc Donalds Maintenance Work\"", "Pros": "Steady day in day out work.", "Cons": "Low pay, lazy staff, more custodial cleaning after crew at times than a true maint work"}, "2": {"Date": " Nov 4, 2016", "Summary": "\"Great company\"", "Pros": "Flexible Schedules3rd shift offers times to sit aroundGreat pay ($9/hr)Probably work about 2/3rds of the time.Easy job", "Cons": "Promotions come with poor pay raiseMinimal opportunities for promotion on 3rdPoor coworkersEquipment breaks down a lot"}, "3": {"Date": " Nov 4, 2016", "Summary": "\"The Job was Ok\"", "Pros": "Great Coworkers and Service. The pay was ok.", "Cons": "Management was not the best and injuries happened a lot."}, "4": {"Date": " Nov 4, 2016", "Summary": "\"Good\"", "Pros": "Is was good, not bad. they pay but sometimes the pay not great other times nuggets so yeah.", "Cons": "i gained at least 150 pounds while at mcdonald's. i just ate so much food man, it's pretty gross."}, "5": {"Date": " Nov 4, 2016", "Summary": "\"Bleh\"", "Pros": "Tends to be a cheaper resturant. not the best of places. could use work...", "Cons": "no benefitsno hourssucksdisgustingfeel like greaseshoes get coated in grease"}, "6": {"Date": " Nov 5, 2016", "Summary": "\"cashier\"", "Pros": "Great environment and the people you work with is friendly and there for the same reason.", "Cons": "nothing really. You apply for what get. Don't really expect much more."}, "7": {"Date": " Nov 16, 2016", "Summary": "\"crew memner\"", "Pros": "friendly staff, free food, motivated manager", "Cons": "hours, customers, long hours, small space"}, "8": {"Date": " Nov 18, 2016", "Summary": "\"Its okay\"", "Pros": "Free food it pretty cool", "Cons": "work load is high. No sitting down"}, "9": {"Date": " Nov 3, 2016", "Summary": "\"McD's\"", "Pros": "easy to get hired, fast moving workplace, nice coworkers, free meals, managers are good with working around busy school schedules", "Cons": "it can get overwhelming at peak hours, some customers can be difficult to work with, it can be hard standing for hours, minimum wage"}}