{"0": {"Date": " Feb 25, 2017", "Summary": "\"Good place to start\"", "Pros": "It's a great place for your first job, teaches you how to work individually and in a team, and teaches you how to deal with stressful environments. Additionally, the various positions allow you to learn your strengths, weaknesses, and overall limitations. It's pretty easy to move up in the ranks as well (if that's what you want) since turnover is generally pretty high in the fast-food industry.", "Cons": "Being a minimum wage job obviously isn't great, especially if you're not a dependent or at least have to provide for most of your living costs. You often will have to do undesirable tasks like cleaning after someone's child or doing equipment maintenance, and upset and/or unreasonable customers are simply unavoidable."}, "1": {"Date": " Feb 26, 2017", "Summary": "\"Contrast between shifts\"", "Pros": "Afternoon and evening shift is really fun people to work with, everyone has a unique personality. For the most part, they perform their jobs with dedication, and they help each other out.", "Cons": "Morning shift is sloppy, paying little regard to teamwork, consistency, or even food safety. They leave supplies insufficiently stocked and leave immediately upon mere sight of their replacement on the next shift."}, "2": {"Date": " Feb 10, 2017", "Summary": "\"Department manager\"", "Pros": "The crew is awesome and most try for best service possible", "Cons": "Management lacks and doesn't really try to coach crew ...just discipline"}, "3": {"Date": " Mar 18, 2017", "Summary": "\"Terrible Place to Work\"", "Pros": "Ability to work lots of hours.", "Cons": "No cocnern for employee well being."}, "4": {"Date": " Feb 25, 2017", "Summary": "\"dept manager\"", "Pros": "The company has great benefits. I have moved up from a crew member to first assistant", "Cons": "The training is non exsistant, its learn as you go. I am often overworked and never have to time to get my duties accomplished"}, "5": {"Date": " Feb 25, 2017", "Summary": "\"Good for High School Students\"", "Pros": "Great co-workers and most managers", "Cons": "With the \"customer is always right\" attitude, no matter how mean, rude, or incorrect the customer is, the managers side with the customers."}, "6": {"Date": " Feb 10, 2017", "Summary": "\"back in the days when employees worked\"", "Pros": "worked with schedule, opportunity to grow", "Cons": "other employee work habits declined"}, "7": {"Date": " Feb 11, 2017", "Summary": "\"Crew\"", "Pros": "Fun steady work like my coworkers", "Cons": "Low pay no benifits late hours"}, "8": {"Date": " Feb 11, 2017", "Summary": "\"I like McDonalds because the customers are nice\"", "Pros": "They have the best customers they treat u with respect and always have ur ready right", "Cons": "Working at the cashier, learning the peoples orders, memorizing all that i have to do at McDonalds"}, "9": {"Date": " Feb 24, 2017", "Summary": "\"Great first job for students\"", "Pros": "- Flexible shifts- Free meal- Pay checks every 2 weeks- No difficult tasks", "Cons": "- Managers tell you different things, like one tells you to always count your register, other tells you can skip it.- Homeless people, mentally ill people - you never feel safe. Security comes only couple days a week.- Mean people that feel yell at you for no reason."}}