{"0": {"Date": " Jan 7, 2018", "Summary": "\"Mcdonald's Hours\"", "Pros": "Some customers were very nice to talk to.", "Cons": "The hours and the shifts they gave me."}, "1": {"Date": " Jan 7, 2018", "Summary": "\"Grill cook\"", "Pros": "there are not any pros", "Cons": "do not work at mcdonalds"}, "2": {"Date": " Jan 7, 2018", "Summary": "\"Pretty bad job\"", "Pros": "You got a free burger every shift where I worked", "Cons": "-Don't let you go to the bathroom-Don't let you get water often enough-Fire you if you work more than 40 hours in one week(overtime)-Will try to make you do work for free"}, "3": {"Date": " Jan 8, 2018", "Summary": "\"Wow\"", "Pros": "Currently working for them I can honestly say It's never a boring day. From the moment you come in there is something to do and helping people is always a plus", "Cons": "Working for them has been terrible, I need the job but would not eat there. It's very dirty and unhealthy"}, "4": {"Date": " Dec 17, 2017", "Summary": "\"McDonald auburn mall\"", "Pros": "After nine months you get school grants. High school diploma is free for employees. Good is mostly prepared fresh.", "Cons": "Auburn mall store has had complaints on customer service, good prep, and wrong orders. This store is very unprofessional and rude to people."}, "5": {"Date": " Dec 18, 2017", "Summary": "\"Crew\"", "Pros": "It is close to my house", "Cons": "The cash drawer is so low it really hurts my back to bend to reach it."}, "6": {"Date": " Dec 2, 2017", "Summary": "\"Good first job\"", "Pros": "Gained experience for future jobs so thats pretty nice. Because i got a job at another (nicer) company only because i had experience", "Cons": "It's a bad job and from my experience and friends bad management"}, "7": {"Date": " Dec 1, 2017", "Summary": "\"Grill/ customers service cashier\"", "Pros": "Dealing with all whole lot of peoples.", "Cons": "Not having enough to deal with lonesome."}, "8": {"Date": " Jan 6, 2018", "Summary": "\"crew member\"", "Pros": "they gave us very good hours when we were on there good side, but when we mad them mad we had no days on the schedule.", "Cons": "everything was filthy, managers were unprofessional, the staff could never work together without someone taking it personal and catching an attitude"}, "9": {"Date": " Dec 16, 2017", "Summary": "\"Not quite a 'equal opportunity employer'\"", "Pros": "Good paycheck (provided you get enough hours), Free food on break", "Cons": "Not real sensitive to employees asking time off for anything (including doctors appointments), don't like to fill out incident reports, are not caring to employees with special needs (including mental disabilities)"}}