{"0": {"Date": " May 4, 2017", "Summary": "\"General Manager\"", "Pros": "Better your people skills and stay busy meeting new people in the process", "Cons": "Customers do get a little to out ta control with complaints"}, "1": {"Date": " Jun 8, 2017", "Summary": "\"Worst employment I have had\"", "Pros": "I got started out making $9.25 hr", "Cons": "The only person that was not only allowed but also qualified to maintain the store well enough for it to stay in business was the maintenance guy, which happened to be the job I had. I was the only maintenance guy working at that specific location."}, "2": {"Date": " Jun 8, 2017", "Summary": "\"cook\"", "Pros": "theres good people to work with", "Cons": "it was horrible to work there"}, "3": {"Date": " Jun 9, 2017", "Summary": "\"The owners of this franchise do not respect they employees and wont pay what you deserve to be paid.\"", "Pros": "They will work with you on schedules. But thats about all there is a couple managers that are good but the rest are worthless.", "Cons": "They have Low pay and theres No respect for employees.Everyone gets treated different and they arent very professional at all."}, "4": {"Date": " May 18, 2017", "Summary": "\"Cook\"", "Pros": "Food was super easy to prepare. Good environment", "Cons": "No career progression. To many issues with co workers and poor management"}, "5": {"Date": " May 3, 2017", "Summary": "\"Cashier\"", "Pros": "Free foodStaff is friendlyManagement is very understanding", "Cons": "Only get items from dollar menu"}, "6": {"Date": " May 4, 2017", "Summary": "\"Everyone's nice\"", "Pros": "Working milkshake machine and working with wonderful coworkers that are so nice to me and help me if I am confused", "Cons": "The pay is not very high. Sometimes the customers can be disrespectful and if you mess something up they are not very convincing"}, "7": {"Date": " May 17, 2017", "Summary": "\"Good Starter Job\"", "Pros": "Good way to start your career", "Cons": "Not much advancement opportunity better to get another job outside"}, "8": {"Date": " Jun 7, 2017", "Summary": "\"Not the best\"", "Pros": "50% off meals during the break.", "Cons": "Terrible management, treats employees poorly."}, "9": {"Date": " Jun 7, 2017", "Summary": "\"Crew member\"", "Pros": "Not one pro about mcdonalds. Really needs to get their act together. Low money. High stress. Management was horrible and petty.", "Cons": "Low pay, management sucks. Ice cream machine is always broke. No room for advancement with as many people as they hire. No hours."}}