{"0": {"Date": " Jun 26, 2017", "Summary": "\"Morning cashier\"", "Pros": "None. Maybe I'm not allowed to write less than five words.", "Cons": "Few hours. Grumy customers. Strict dress code."}, "1": {"Date": " Jun 24, 2017", "Summary": "\"McDonald's\"", "Pros": "-Flexible hours-Ability to move up-Lax atmosphere", "Cons": "-Poor management, depending on the manager on shift-Equipment always down-Small raises"}, "2": {"Date": " Jun 25, 2017", "Summary": "\"Wasn't as bad as you'd expect, but obviously not a dream job lol.\"", "Pros": "Easy, you learn how to deal with a lot of types of people, good pace of work - wasn't crazy unmanageably busy, but was never horribly slow, and they really work well around your availability.", "Cons": "It's McDonalds. You deal with a lot of strange people and difficult customers at times. Refilling the ketchup machine was disgusting. The uniforms are awful. And you smell like fast food always."}, "3": {"Date": " Jun 25, 2017", "Summary": "\"Very stressful, fast paced work but very rewarding if you work for a corporate location.\"", "Pros": "Benefits. Health insurance 401k with company match and guaranteed hours. I like the fact that I get paid holidays and a lot of vacation time.", "Cons": "Less than great crew. The talent is just not there. Long hours with unrealistic expectations. Upper management can be ridiculous with micro management."}, "4": {"Date": " Jun 8, 2017", "Summary": "\"Good first job experience\"", "Pros": "-Good first job experience-Good for high school students-Flexible scheduling", "Cons": "None, pretty good place for your first job"}, "5": {"Date": " Jun 23, 2017", "Summary": "\"A Great Stepping Stone\"", "Pros": "Great way to get customer service experience", "Cons": "You always smell bad and it gets hot"}, "6": {"Date": " Jun 23, 2017", "Summary": "\"Crew Member\"", "Pros": "able to choose my shift", "Cons": "stressful at times managers can be very rude , customers are always rude."}, "7": {"Date": " Jun 23, 2017", "Summary": "\"Okay first job\"", "Pros": "-free food-okay pay in some locations-flexible hours-good discount", "Cons": "-low standards-rude workers-rude customers-not so great food"}, "8": {"Date": " Jun 23, 2017", "Summary": "\"Great learning experience\"", "Pros": "Very straight forward application process. I got called to come in for an interview and answered straight forward behaviour interview questions. Call back the next week for job offer.", "Cons": "This place has some great people to work with and learn from.Some people they hire have poor food handling and hygiene."}, "9": {"Date": " Jun 24, 2017", "Summary": "\"Okay I guess??\"", "Pros": "Nice environment, nice people, nice time.", "Cons": "Angry customers and not always a good time."}}