{"0": {"Date": " Feb 23, 2016", "Summary": "\"owner of the resteraunt\"", "Pros": "Great atmosphere great people great customers", "Cons": "poor pay poor training could make the job better"}, "1": {"Date": " Mar 8, 2016", "Summary": "\"Entry Level\"", "Pros": "There was minimal heavy lifting and the crew was okay. The hours were somewhat flexible and it was a good entry level job.", "Cons": "Management was quick to criticize employees and the customers were not always the best. The pay was also pretty low."}, "2": {"Date": " Mar 8, 2016", "Summary": "\"Can't Complain To Much\"", "Pros": "Honestly, customer service is a great first job. I've been doing cashier, so it's almost too easy. I did big \"unofficial jobs\" before so this is long overdue, but the cons teach you how to survive.", "Cons": "The usual. Seems to really depend on managers. Everyone at the franchise I'm at is talking about leaving. I had a guy mess up my drawer I'm 99% sure on purpose. But I really don't blame the employees (who do need to learn when to leave their mouth shut.)"}, "3": {"Date": " Mar 8, 2016", "Summary": "\"Wasnt the best\"", "Pros": "you got to meet a lot of new people who are young and lively", "Cons": "constantly getting dirty, rude customers, pressure"}, "4": {"Date": " Mar 9, 2016", "Summary": "\"Mickey D's\"", "Pros": "You can get some great experience. Benefits were mediocre but they were more than willing to work with your school schedule or if you had another job.", "Cons": "The hours were horrible. It is not your typical 9-5 job. Sometimes working overnight or early early in the morning. The pay could be way better."}, "5": {"Date": " Feb 23, 2016", "Summary": "\"Dishwasher\"", "Pros": "worked hard and did job", "Cons": "didn't get enough hours to work"}, "6": {"Date": " Mar 8, 2016", "Summary": "\"Crew trainer\"", "Pros": "Good for a first job", "Cons": "Management was not helpful at all"}, "7": {"Date": " Feb 22, 2016", "Summary": "\"Good first job\"", "Pros": "My coworkers and managers were really fun to work with. It didn't feel like I was working because we were all laughing so much.", "Cons": "The customers could be rude and yell and we as employees had to take it and make the customer happy even if it wasn't our fault."}, "8": {"Date": " Feb 22, 2016", "Summary": "\"Cashier\"", "Pros": "Good first job. It is fast food so you cant keep high standards.", "Cons": "Scheduling was difficult. Often didn't know your schedule until the day of."}, "9": {"Date": " Mar 7, 2016", "Summary": "\"Swing manager\"", "Pros": "Raise every 6 months, free meal", "Cons": "A lot of stress not enough crew overnight, and favoritism from the store manager"}}