{"0": {"Date": " Nov 12, 2017", "Summary": "\"Cashier\"", "Pros": "Free Food and great community", "Cons": "Minimum Wage and sometimes rude customers"}, "1": {"Date": " Dec 20, 2017", "Summary": "\"Don't do it\"", "Pros": "There are no pros to working here", "Cons": "Everything its just plan terrible"}, "2": {"Date": " Dec 20, 2017", "Summary": "\"They don't Care about you\"", "Pros": "there are no pros to working here", "Cons": "there are so many I'd be here all day"}, "3": {"Date": " Nov 28, 2017", "Summary": "\"Swing Manager\"", "Pros": "Was able to take on a manager position while in college. Worked for a franchise. Franchise owner's are great, but obviously it's McDonald's. The pay isn't going to be great and that's expected.", "Cons": "The worst co-workers are more terrible to deal with that bad customers. Did not like how much time was spent having to deal with bad coworkers."}, "4": {"Date": " Nov 29, 2017", "Summary": "\"McDonalds Reveiw\"", "Pros": "Education and health care benefits, stable income, and customer service experience.", "Cons": "Disappointed management, they treat you like your easy to replace, and they do not care about their employees."}, "5": {"Date": " Nov 14, 2017", "Summary": "\"Cook\"", "Pros": "Made some easy money. good hours", "Cons": "Very little up side besides making money"}, "6": {"Date": " Nov 13, 2017", "Summary": "\"A Great First Job\"", "Pros": "It is an easy first job. Most everyone is friendly and the tasks given are easy.", "Cons": "Some of the people aren't the greatest to work with and it is hard to deal with some customers at times."}, "7": {"Date": " Nov 14, 2017", "Summary": "\"Worked as cooked.\"", "Pros": "Gain experience working in a fast-paced environment as part of a team. Learn how to hold down a job, and develop the people skills needed for basically every career out there.", "Cons": "Could be quite stressful at times. Didn't always deal with people in their best moods. Some people were better teamplayers than others."}, "8": {"Date": " Nov 27, 2017", "Summary": "\"cashier\"", "Pros": "your co workers are friendly , you also will get 40 hrs or more every 2 weeks.", "Cons": "Some managers are not as professional as they should be ."}, "9": {"Date": " Nov 27, 2017", "Summary": "\"Manager\"", "Pros": "Always plenty of room to grow and advance", "Cons": "Working with too many immature employees"}}