{"0": {"Date": " Sep 18, 2016", "Summary": "\"I mean like \"meh\"\"", "Pros": "It's a really easy job and it has flexible hours.", "Cons": "Customers can get annoying and it doesn't pay much."}, "1": {"Date": " Sep 18, 2016", "Summary": "\"I worked at the Finance office in Columbus, OH.\"", "Pros": "Great Benefits. Great perks at one time. Bonuses given out in March. Working with the people was fantastic. If you worked there more than 10 years you got a sabbatical.", "Cons": "Too much work at one time. Need to communicate more effectively with their employees. They need to care more about the people that work for them."}, "2": {"Date": " Sep 18, 2016", "Summary": "\"Okay for after school job\"", "Pros": "Your Coworker become like your family", "Cons": "The customers are rude and disrespectful"}, "3": {"Date": " Sep 19, 2016", "Summary": "\"Fighting the Stigma\"", "Pros": "There are some opportunities for advancement in the company if you work hard, are determined, and can learn new things fairly quickly.", "Cons": "Customers think you're a moron because you work there, and some of them let you know it. They think it's incredibly easy working at McDonalds, having never worked there themselves often times."}, "4": {"Date": " Sep 3, 2016", "Summary": "\"Management\"", "Pros": "Chance to earn extra money by passing mystery shops, and promoting a manager who stays for 3months or bringing in mangers", "Cons": "Can become overwhelming, customers can become very irate, and be very rude"}, "5": {"Date": " Sep 3, 2016", "Summary": "\"cool\"", "Pros": "fast food good taste big mac", "Cons": "hard chemicals meh wow no"}, "6": {"Date": " Oct 9, 2016", "Summary": "\"Did whatever they wanted of me.\"", "Pros": "Interesting and dynamic atmosphere, ish.", "Cons": "Everything about the whole place."}, "7": {"Date": " Oct 10, 2016", "Summary": "\"Too much work for such little pay\"", "Pros": "Nothing good about working there", "Cons": "Everything, rude customers, cleaning if it's slow"}, "8": {"Date": " Sep 18, 2016", "Summary": "\"Department Manager\"", "Pros": "Easy to move up.", "Cons": "Highest turnover I've ever seen. People hate it here. People are worked like its a higher paying construction job but for minimum wage. The owner thinks there are enough people but when all of them started this month, how productive is your team?"}, "9": {"Date": " Sep 18, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Easy workSome nice managers", "Cons": "If you are new everything is piled onto you.Moping up spills"}}