{"0": {"Date": " Jan 13, 2016", "Summary": "\"Food Associate\"", "Pros": "Met great coworkers through working here for a year part time. Cheap food even when working and was able to balance work and life well being part time.", "Cons": "Although coworkers were good, the management was micrimanaging and would schedule when I was not available to work."}, "1": {"Date": " Dec 28, 2015", "Summary": "\"Patience\"", "Pros": "Great way to learn patience.", "Cons": "Invest in comfortable foot wear before hand."}, "2": {"Date": " Dec 29, 2015", "Summary": "\"Best Job Ever\"", "Pros": "Friendly EmployerVery hygienicEasy going hours", "Cons": "There are absolutely no cons"}, "3": {"Date": " Jan 11, 2016", "Summary": "\"Either working on fries or drive through window\"", "Pros": "It was fun and fast paced.", "Cons": "Um I would just have to say rude customers."}, "4": {"Date": " Feb 1, 2016", "Summary": "\"review\"", "Pros": "You meet new people daily, you receive half off of employee meals.", "Cons": "You are paid the bare minimum, but are required a lot of responsibilities."}, "5": {"Date": " Jan 12, 2016", "Summary": "\"None\"", "Pros": "Friendly, caring, helpful team and management", "Cons": "Salary could be better compared to other facilities"}, "6": {"Date": " Dec 27, 2015", "Summary": "\"All about my Experiences with McDonald's\"", "Pros": "I love meeting people and making people Smile", "Cons": "I have never had a Con out side of me having to take time off for Surgery"}, "7": {"Date": " Dec 28, 2015", "Summary": "\"Manager\"", "Pros": "Overall a good job, worked my way up from crew to manager. Made a lot of friends and enjoyed work most of the time.", "Cons": "The pay is barely liveable and usually you have to do at least two overnights a week. You're also first to get chewed out if anything goes wrong"}, "8": {"Date": " Dec 28, 2015", "Summary": "\"Easy\"", "Pros": "-the processes are very easy to learn and the education is standardized-there is room for internal growth-clean environment", "Cons": "-not as flexible with work schedules-sometimes understaffed, work load gets unevenly distributed and can get frustrated as an employee"}, "9": {"Date": " Jan 10, 2016", "Summary": "\"Manager\"", "Pros": "They have great benefits especially if your a business major student they will pay 75% of your tuition. If you're a high school student they will work around your school schedule. Over all if you're a student they pretty much take care of you.", "Cons": "Management at this company sucked. It's a good place to learn a lot about going into management but the pay sucked. The work don't match the pay at all. Your lucky if you have a great general manager but if you don't your going to be over worked and not enough pay."}}