{"0": {"Date": " Mar 24, 2016", "Summary": "\"Outstanding\"", "Pros": "Opportunities are unlimited for growth in the company. Good for a person who likes to engage with the public and also who enjoys traveling.", "Cons": "Many hours are spent in this business. The turnover is high. Nevertheless a good starting point for most high school and college students to make a little cash."}, "1": {"Date": " Apr 7, 2016", "Summary": "\"okay place to work\"", "Pros": "Work around schedule, always something to do, Fast paced environment, alwys meeting new employees and customers", "Cons": "Management can be less than friendly during stressful situations, dirty, high turnover, train new employees and they quit a couple weeks later"}, "2": {"Date": " Apr 6, 2016", "Summary": "\"Ok\"", "Pros": "Able to move up good benefits", "Cons": "Not much on cons it was ok"}, "3": {"Date": " Apr 6, 2016", "Summary": "\"5 years, I did my best, no promotion, 15 cents in raises, No I'm not staying. Sorry, not sorry.\"", "Pros": "Flexible hoursAdvancement ops for the seriousflexible schedule", "Cons": "Corporate and franchise are vastly differentHard to get a raiseWork with high school and college students"}, "4": {"Date": " Apr 6, 2016", "Summary": "\"Not bad for a first job\"", "Pros": "If you're an entry-level crew, it's probably one of the easiest jobs to have. The hours are flexible (the store I work at is 24/7), the benefits are nice (free meal every time I work, Christmas parties that hand out gift cards and Kindles), and you can easily end up making friends with your coworkers. Corporate stores have great HR teams to handle any complaints and the training classes are fun and have great snacks; they also pay a dollar over minimum wage, which isn't bad.", "Cons": "There are many rude customers, and shifts are frequently understaffed. If you move up into management, you will be expected to work extra shifts without any prior knowledge. Upper management seems to have a large turnover rate (we have had 4 different GMs in the past 6 months). The store can be very disorganized and there is a severe lack in communication."}, "5": {"Date": " Apr 7, 2016", "Summary": "\"Flexible schedule, easy job, customers make it not as good\"", "Pros": "the schedule was flexible, coworkers were fun to be around, really easy to understand everything on the counter and in the grill area as well", "Cons": "dish duty is gross haha, smelling like stale grease, rude customers are the worst part of the entire job and people who come through the drive through acting like jerks and smoking"}, "6": {"Date": " Mar 22, 2016", "Summary": "\"Shift Manager\"", "Pros": "Great way to involve on leadership and customers service skills, setting goals for your team is always a great way for success, such as sales.", "Cons": "Could be a bit stressful, but that's anywhere you work at."}, "7": {"Date": " Mar 22, 2016", "Summary": "\"Very good for fast food joint\"", "Pros": "Management was overall very nice, and on top of work, scheduling was very fair and worked around my schedule at school", "Cons": "There were some co workers that weren't the easiest to get along with. There were some instances where I had to work late"}, "8": {"Date": " Apr 27, 2016", "Summary": "\"Worst job I've ever had\"", "Pros": "there is no good reason to work here. the people that work here are only here because there is nothing else in the area", "Cons": "way under staffedno raise or promotion unless you're related to the bossvery poor treatment from managers and customersyour boss decides what you will work"}, "9": {"Date": " Apr 27, 2016", "Summary": "\"cashier\"", "Pros": "no reason no good salary", "Cons": "but enviroment low salary no growth"}}