{"0": {"Date": " Feb 21, 2016", "Summary": "\"Easy first job\"", "Pros": "Almost anyone can get hired. The work is easy and if you work at a busy one, then the time flies by.", "Cons": "Coworkers and customers can be belittling at times. And its fast food so it isn't the grandest of places to be working."}, "1": {"Date": " Feb 22, 2016", "Summary": "\"Careless\"", "Pros": "Pay rate is good. Very flexible schedule.", "Cons": "Very careless and reckless. Do not appreciate the hard work. They are not fair with everyone and the raises are not fair either."}, "2": {"Date": " Feb 6, 2016", "Summary": "\"Lobby attendent\"", "Pros": "It is a paying job, it keep you busy and you can talk to the costumer.", "Cons": "You on your feet a lot of time and you have to keep an eye on the trash can and the drink station too."}, "3": {"Date": " Feb 7, 2016", "Summary": "\"Assisstant Manger\"", "Pros": "I think all kid should work at McDonald s as a first job so they first exaperrance", "Cons": "Short hours to some who wont to work"}, "4": {"Date": " Feb 7, 2016", "Summary": "\"Your work experience may vary depending on what store/franchise you go work for. Some are bad. Some are good.\"", "Pros": "Good first job. Helps me with the finances while I'm still in school. Made some pretty good friends and a well dedicated team on some days", "Cons": "Not recommending to make it a career unless you're trying to go for corporate or some sort of high management position."}, "5": {"Date": " Feb 21, 2016", "Summary": "\"McDonalds Cashier\"", "Pros": "Great Benefits and great opportunity to move up in the company to management positions in corporate McDonalds. Would recommend. Tough to break out of local work.", "Cons": "Greasy. The company sometimes has a bad reputation as an easy place to work or a place to work only as a backup."}, "6": {"Date": " Feb 20, 2016", "Summary": "\"Cashier\"", "Pros": "Coworkers were friendlyDecent community to work for", "Cons": "Occasional hobo in the area would enter McD"}, "7": {"Date": " Feb 5, 2016", "Summary": "\"Fun, interesting, hard at times but I made it\"", "Pros": "Learning how to be patient with customers.Great teamworkFast working paceKeep your work place cleanbe efficientkeep your cool", "Cons": "Rude people and people who will want to be cheap about things. Stand your ground.Know how to talk to others."}, "8": {"Date": " Feb 6, 2016", "Summary": "\"Helped make decent money while I was still in school\"", "Pros": "Great experience. A good foundation of work ethics and working with good people around.", "Cons": "You have to deal with all the negative attitudes, Such as customers."}, "9": {"Date": " Feb 19, 2016", "Summary": "\"Good\"", "Pros": "Good food with pretty good discount.", "Cons": "The customers were very rude and not understanding."}}