{"0": {"Date": " Jan 6, 2016", "Summary": "\"mcd\"", "Pros": "good food to eat there", "Cons": "low pay can\"t afford nothing"}, "1": {"Date": " Jan 6, 2016", "Summary": "\"Sr. Hamburger Handler\"", "Pros": "I handled hamburgers. it was ok. Sometimes I got to eat pickles if they were going bad but most of the time you only get tomatoes.", "Cons": "I wanted to be promoted to french fries but never really got the chance. I really wish they had promoted me, now im at Burger King in the same job position."}, "2": {"Date": " Jan 6, 2016", "Summary": "\"McDonald's in all of its glory\"", "Pros": "Free food each shift, half hour breaks. Opportunity for advancement, I was promoted to Crew Trainer within 7 months of working there.", "Cons": "Customers are god awful. Will fight with you, cuss at you and you ave to stand there and take it because the McDouble isn't on to dollar menu. Managers are 50/50, either the worst or the worst or actually enjoyable o be around at times. Scheduling is the worst. I was told that my availability, \"Doesn't matter\""}, "3": {"Date": " Jan 7, 2016", "Summary": "\"It's ok\"", "Pros": "Extra money (I was in college)", "Cons": "Slow paced environment, management acts like employee friends rather than their superior"}, "4": {"Date": " Jan 7, 2016", "Summary": "\"It's not that hard. Customers are rude, but there are some great people you get to know. Good experience.\"", "Pros": "They are very flexible with your schedule, though you may not get the hours you want. Easy to pick up shifts.", "Cons": "Little to no training for new crew members or for current crew when new products/apps are introduced to our business. Management doesn't realize how much you do. You are \"just another replaceable employee\"."}, "5": {"Date": " Jan 7, 2016", "Summary": "\"First Level management\"", "Pros": "good health benefits and training", "Cons": "Long Hours and cranky sutomers"}, "6": {"Date": " Jan 7, 2016", "Summary": "\"Department manager\"", "Pros": "Good benefits ..... ...... .... . .....", "Cons": "Not flexible wit hours...... ........ ...... ..... .."}, "7": {"Date": " Jan 6, 2016", "Summary": "\"Mcdonald's\"", "Pros": "Flexible, simple, easy going at times", "Cons": "Low paying, rude customers, not worth working there if you don't plan on being a manager."}, "8": {"Date": " Jan 6, 2016", "Summary": "\"pros and cons\"", "Pros": "offers room to move up, benefits, and a easy learning environment", "Cons": "fast pace is good but they had unrealistic expectations, work schedule was too varied, and management saw flaws more then rewarding for excellence"}, "9": {"Date": " Jan 6, 2016", "Summary": "\"not to be\"", "Pros": "get to meet different people although very briefly.", "Cons": "smell of oil alotnot great paynot respected job"}}