{"0": {"Date": " Mar 28, 2016", "Summary": "\"Crew Member\"", "Pros": "It opens a lot of doors for future employment.", "Cons": "Sometimes it can be very warm in the kitchen."}, "1": {"Date": " May 2, 2016", "Summary": "\"Crew member\"", "Pros": "Good people, good learning experience.", "Cons": "No appreciation, no raises, management doesn't train well and they don't keep to their word. Hours suck"}, "2": {"Date": " May 2, 2016", "Summary": "\"PLACE SUCKS\"", "Pros": "None, worst job ever. I hated going toward and you will hate it too. Managers are dumb, people you deal with are dumb", "Cons": "EVERYTHING! you work with imbeciles, managers are rude, customers are rude. DO NOT work here. PAY SUCKS AS WELL"}, "3": {"Date": " Apr 12, 2016", "Summary": "\"Crew\"", "Pros": "Free mealsReviews every six monthsEasy to move upFlexible hoursMake your own schedule", "Cons": "Lack of leadershipManagers put all work on crewTerrible schedulingManagement don't listen to crew membersOne uniform given"}, "4": {"Date": " Apr 12, 2016", "Summary": "\"cashier\"", "Pros": "It okay to working it friendly place.", "Cons": "They work u like a dog"}, "5": {"Date": " Mar 27, 2016", "Summary": "\"Great first job expeience for a manager. Ive learned a lot of different responsibilities that will help with future jobs\"", "Pros": "Flexible hours, good starting pay, offered benifits if i wanted to take them up.", "Cons": "Had a lot of problems with other managers not keeping up with what they had to get done. However that could just be my location"}, "6": {"Date": " Apr 10, 2016", "Summary": "\"Sucks\"", "Pros": "You basically choose your hours and get to work when you want as long as you want. So long as your not a minor.", "Cons": "Annoying low life workers that don't know how to work as a team"}, "7": {"Date": " Apr 11, 2016", "Summary": "\"it was ok at the time\"", "Pros": "the staff showed respect for each other and the customer", "Cons": "the management always switched employees shifts around and never notified them of the change"}, "8": {"Date": " Apr 11, 2016", "Summary": "\"Hard working\"", "Pros": "Fast learner , respectful, outgoing, responsible, and good communication skills.", "Cons": "Weakend eye sight, fast talker , and forgetful."}, "9": {"Date": " Apr 11, 2016", "Summary": "\"Not the worst\"", "Pros": "Flexible scheduling, nice coworkers (mostly), discount on food (if you like McDonald's...)", "Cons": "Low pay, ugly uniforms, rude customers, smelly"}}