{"0": {"Date": " Jun 1, 2016", "Summary": "\"Terrible\"", "Pros": "Flexible HoursEasy To get a job there", "Cons": "ManagementPay rateno full time position"}, "1": {"Date": " Jun 1, 2016", "Summary": "\"They never call.\"", "Pros": "The branch I worked at paid a dollar above minimum wage. That's it.", "Cons": "They never tell you when you're supposed to work. They post the schedule when most of their employees aren't there."}, "2": {"Date": " May 10, 2016", "Summary": "\"Hate it\"", "Pros": "You can basically do whatever you'd like on the job. You work with nice people.", "Cons": "You don't get to move up. It is very hard to have upward mobility. Competition is fierce at every McDonald's ."}, "3": {"Date": " Apr 25, 2016", "Summary": "\"Its not bad as people say it is\"", "Pros": "You make Friends ,schedule is great .You get experience. You get to interact with a variety of people.", "Cons": "When it gets busy, its hell. People are rude and mean. Pay is low"}, "4": {"Date": " May 9, 2016", "Summary": "\"Good work unrewarded\"", "Pros": "They are Somewhat flexible with schedule", "Cons": "Not much pay, new owners reduced starting pay to minumum wage. No reward to getting promoted, they don't pay enough to compensate for experience and the added responsibility required.Low morale"}, "5": {"Date": " May 9, 2016", "Summary": "\"working\"", "Pros": "It was my first job", "Cons": "I did not like working there"}, "6": {"Date": " May 9, 2016", "Summary": "\"Okay company\"", "Pros": "Easy to get a job. You will meet great coworkers.", "Cons": "Long hours in your feet, rude people. Simply a job, not a career. It's like a place that slowly sucks your soul out."}, "7": {"Date": " May 9, 2016", "Summary": "\"yes\"", "Pros": "Good experience i learnt alot of thing", "Cons": "the pay is low , managemt"}, "8": {"Date": " May 10, 2016", "Summary": "\"Not Too Bad\"", "Pros": "Fun work environment, everything about the job was simplified as much as possible. Hours were fairly consistent as well which is important.", "Cons": "Although the hours were consistent, sometimes they were a bit strenuous depending what shift you were given. Good for part time though."}, "9": {"Date": " May 10, 2016", "Summary": "\"Crew trainer\"", "Pros": "Lots of fun working there it is a good working place good customers I like all of my managers that I work with", "Cons": "Care more about the customers"}}