{"0": {"Date": " Oct 19, 2016", "Summary": "\"working at mcdonalds\"", "Pros": "the working schedule is very flexible and mangers are very understand of the employies", "Cons": "hours can be long and stressful when it get busy. you have to learn to deal with angry and in patience customers."}, "1": {"Date": " Oct 17, 2016", "Summary": "\"Awesome\"", "Pros": "Great place to work for", "Cons": "Nothing to say at all honestly"}, "2": {"Date": " Nov 22, 2016", "Summary": "\"Horrible company. Treated bad by management. Expected too much and treated bad.\"", "Pros": "Paid lunch meals, that's about it", "Cons": "Treated badly, expected to do more than what was discused during interview,"}, "3": {"Date": " Nov 22, 2016", "Summary": "\"Cashier and everything but handle safe and schedule hours\"", "Pros": "None but that you get paid", "Cons": "Managers abuse you. And abuse their authority."}, "4": {"Date": " Nov 2, 2016", "Summary": "\"Worst Experience Ever\"", "Pros": "The only pro i could think of is the discounted food other than that everything else is terrible.", "Cons": "Employees act like manager.Managers act like supervisors.If you are a male then you are expected to do every job but the one you applied for.Supervisor is almost always overly aggressive for no reason.Pay is bad."}, "5": {"Date": " Oct 31, 2016", "Summary": "\"mcdonaLDS\"", "Pros": "working there is really annoying", "Cons": "low pay and not really fun"}, "6": {"Date": " Oct 31, 2016", "Summary": "\"Good people, good learning experience\"", "Pros": "-Really easy to get shifts changed or take time off-My store manager and shift managers were easy to work with-Very easy to get a job there-Food safety protocols were easy to follow; Instructions were readily available", "Cons": "-Rush hours were consistently busy (Mostly on weekend lunches)-Had to decide whether to be a cook or counter/order taker; Only managers were cross-trained-Employee discount on food was only 30%; No free food-Very short breaks; 15 minutes for breaks, 30 minutes for lunch"}, "7": {"Date": " Oct 31, 2016", "Summary": "\"Crew member\"", "Pros": "Lots of potential benefits you can get. You can always find hours. Typically flexible with their hours. Always something new everyday and it's always interesting", "Cons": "If you request anything later than what they prefer you will not get it. You have to request everything early and keep reminding the manager(s)."}, "8": {"Date": " Oct 17, 2016", "Summary": "\"Intern Review\"", "Pros": "Taste tests, free foundation drinks and coffee", "Cons": "Bad public reputation, and not much opportunity for growth"}, "9": {"Date": " Oct 16, 2016", "Summary": "\"Cashier\"", "Pros": "Discount meals, good training, nice company, good location, nice to meet new people, flexible hours, good experience, nice management, builds character", "Cons": "Rude customers, not always friendly coworkers, work holidays, not many breaks, lower pay than usual, smelling like the food, average"}}