{"0": {"Date": " Mar 29, 2018", "Summary": "\"Cashier\"", "Pros": "Work was very fun, lots of new people to meet.", "Cons": "Managers were not good, or help the crew"}, "1": {"Date": " Mar 29, 2018", "Summary": "\"Fantastic Company\"", "Pros": "They have processes to make everything go right and they do it well at any location across the world.", "Cons": "Pay isn't the best as it's fast food, but they promote quickly."}, "2": {"Date": " Mar 28, 2018", "Summary": "\"Fine\"", "Pros": "Easy Work, nice people to work with", "Cons": "Poor Pay and long hours"}, "3": {"Date": " Mar 28, 2018", "Summary": "\"food prep\"", "Pros": "not very difficult, once you learn the basic routine it is not hard at all. mainly running grills and deep fryers.", "Cons": "very busy, very manualdepending on the day and shift it is very busy and can be hectic depending on how many people you have working with you"}, "4": {"Date": " Mar 28, 2018", "Summary": "\"Easy Work\"", "Pros": "Really helps you to gain conversational skills.", "Cons": "Management is not that great."}, "5": {"Date": " Mar 27, 2018", "Summary": "\"amazing\"", "Pros": "McDonald's allows you to create your schedule and it's really flexible. a good job if you're doing sport and school.", "Cons": "No cons about the working experience at McDonald's, it's a good first job for a student. don't really teach how to do everything."}, "6": {"Date": " Mar 27, 2018", "Summary": "\"Good\"", "Pros": "Great work balance Great pay Good People", "Cons": "Long Boring No young people Fattening Lack of benefits"}, "7": {"Date": " Mar 27, 2018", "Summary": "\"McDonald’s manager\"", "Pros": "Great work environment free meals great pay", "Cons": "It wasn’t all that bad"}, "8": {"Date": " Mar 27, 2018", "Summary": "\"Crew Member Review\"", "Pros": "Nice people, some good customers, every day is busy", "Cons": "have to deal with a lot of BS from customers, and pay is not as much as I had wanted"}, "9": {"Date": " Mar 28, 2018", "Summary": "\"Mixed Bag\"", "Pros": "Fellow co-workers can be a great resources. Super helpful with training, and always willing to work with you on scheduling and training", "Cons": "Customers can be a bit rough, especially during the rush hours. You're required to get it right and be quick at the same time, which sometimes doesn't go well."}}