{"0": {"Date": " Jul 18, 2016", "Summary": "\"Manager\"", "Pros": "Not many. They need to come up with new stratagies to keep employees", "Cons": "Pretty much everything. No benefits. Pay sucks"}, "1": {"Date": " Jul 3, 2016", "Summary": "\"Good Work Experience\"", "Pros": "Flexible schedule, and nice employees.", "Cons": "Angry customers, smelly food, uninteresting work."}, "2": {"Date": " Jul 3, 2016", "Summary": "\"cashier\"", "Pros": "Friends, night time was ok", "Cons": "disrespectful.. they push you it took me yearssss to get paid what I did."}, "3": {"Date": " Jul 3, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Great Coworkers, decent pay for teeneagers", "Cons": "Scheduling, manager's pick favorites, separation between races within the workplace"}, "4": {"Date": " Jul 17, 2016", "Summary": "\"Cashier\"", "Pros": "A good place to work starting out, depending on the person it can teach you a lot about the fast food business. I worked cooperate mostly until our location was bought by franchise. Cooperate is ran a lot smoother than franchise in my opinion. I'm not a big fan of the way management ran the store when it became a franchise.", "Cons": "For the most part the job was easy and enjoyable but it becomes stressful if your a person who likes to take things slow, it is a \"fast-food\" restaurant and all the multi-tasking ( 3, 4, sometimes 5 things at a time) can be overwhelming."}, "5": {"Date": " Jul 18, 2016", "Summary": "\"ok\"", "Pros": "Flexible hours and easy work", "Cons": "People are rude management is a mess"}, "6": {"Date": " Aug 7, 2016", "Summary": "\"My overall experience\"", "Pros": "It gave you a basic experience within a fast food family oriented resturaunt", "Cons": "You have to deal with idiotic and disrespectful clientele"}, "7": {"Date": " Jul 18, 2016", "Summary": "\"Department Manager\"", "Pros": "They are really flexible with schedules.", "Cons": "They do not train well or do they really care about their employees"}, "8": {"Date": " Jul 2, 2016", "Summary": "\"My first job experience.\"", "Pros": "Kind manager staff. Other employees are easy to talk to. Not too stressful. Broad range of experience due to working multiple roles.", "Cons": "Dependent on the number of employees, work schedules and hours will fluctuate, for better or for worse."}, "9": {"Date": " Jul 3, 2016", "Summary": "\"Not Too Bad\"", "Pros": "Time flexible;work more, get more;employment discount;", "Cons": "ur schedule would be suck cos only been offered around 25 hours, and ur working hours not promise cos they keep hiring new people even though there are bunch of people in the small kitchen....get call off so so often, one time I only worked 1.5hrs then got send home but my schedule was 7 hours that day.....not everything on the employee instruction are true, it says you get free drink during work, instead, only water...."}}