{"0": {"Date": " Nov 8, 2016", "Summary": "\"Swing Manager\"", "Pros": "Love very much the crew members.", "Cons": "This is a very stressful job."}, "1": {"Date": " Nov 23, 2016", "Summary": "\"cook\"", "Pros": "easy job tasks and funny people to work with (may vary)", "Cons": "hard at times because management sucked!!! that was the worst part about working there"}, "2": {"Date": " Nov 8, 2016", "Summary": "\"Mangement\"", "Pros": "Great experience working with crew and custome", "Cons": "The ability to work many hours"}, "3": {"Date": " Nov 9, 2016", "Summary": "\"It was okay\"", "Pros": "The wage is fine and the workers are pretty nice.", "Cons": "Depending on the area the costumers can be very rude."}, "4": {"Date": " Nov 22, 2016", "Summary": "\"shift manager\"", "Pros": "They help further your education by sending you threw college and taking courses on line. Over all they help you gain skills.", "Cons": "The McDonald's I worked at the owner did not have very good people skills. They crew and manager seemed to be more focused on personal issues then the business."}, "5": {"Date": " Nov 22, 2016", "Summary": "\"Ups and downs.\"", "Pros": "Easy to climb the ladder and get experience. Easy and yearly raises. Gain knowledge of food sales and costs applying it to any job further down the road would be beneficial.", "Cons": "Not dedicated to their people. Other managers will be given more opportunity then others, not actually using their equal opportunity saying. My current Gm thinks of himself more than his crew."}, "6": {"Date": " Nov 22, 2016", "Summary": "\"My summary\"", "Pros": "Good to work as a team to be able to get thing done in time to have money for your needs to be taken care of in the real life.", "Cons": "There is nothing bad about them"}, "7": {"Date": " Nov 7, 2016", "Summary": "\"Caitlin Mbaku\"", "Pros": "I would like to start my new job experience and saving up from working can go a long way when I'm trying to go to college in 3 years if I don't get a scholarship.", "Cons": "Yes some of my free time will no longer Available but it's worth it and it's time to grow up and make responsible choices that work is more important than my free time"}, "8": {"Date": " Nov 7, 2016", "Summary": "\"Love Burgers\"", "Pros": "Burgers are awesome. Sometimes the fries are cold. Everyone wants to play around instead of make food and serve customers.", "Cons": "Fat accumulating around hips and bum."}, "9": {"Date": " Nov 7, 2016", "Summary": "\"McDonalds job\"", "Pros": "I have nice people skills,its also hard to make me angry .want to have teamwork.want to test my skills to see if ill be good for my first JobI", "Cons": "One downside is that it will be my first job .I have experience working with someone BECAUSE I player football and basketball,but not job wise"}}