{"0": {"Date": " Oct 3, 2016", "Summary": "\"Corporate Manager\"", "Pros": "Some interesting work and great people.", "Cons": "Current leadership has put a premium on artificially inflating the stock price by unnecessarily over cutting G&A. Yes, McD's has 2x the G&A of their competition but with 4x the EPS, where's the problem?"}, "1": {"Date": " Oct 4, 2016", "Summary": "\"Not enough pay\"", "Pros": "Free food, occasional friendly customers", "Cons": "Only minimum wage. Raises do not happen as often as they suppose to."}, "2": {"Date": " Sep 19, 2016", "Summary": "\"McDonald's\"", "Pros": "Great opportunities for management. Flexible with your schedule.", "Cons": "Some employees aren't very hard workers. Some employees don't care about their job."}, "3": {"Date": " Oct 2, 2016", "Summary": "\"Fast paced work, team oriented\"", "Pros": "If you have good co workers it makes life a lot easier.", "Cons": "Night shifts suck because everyone comes right when the bars close, other then that is slow and boring."}, "4": {"Date": " Oct 2, 2016", "Summary": "\"Great\"", "Pros": "Flexible Hours for Part Time Worker", "Cons": "Customers can be rude to the employees quite frequently."}, "5": {"Date": " Oct 2, 2016", "Summary": "\"Shift manager\"", "Pros": "McDonald's provides stability fast pace environment and quarterly bonuses they ask provide free food", "Cons": "It can be repetitive low wages unappreciated full of headaches and disrespect towards the workers"}, "6": {"Date": " Oct 2, 2016", "Summary": "\"It was a job\"", "Pros": "It was a good starting job, would not work at there for the rest of my life. Not a hard job, occasionally good coworkers", "Cons": "Coworkers wouldn't show up, management was horrible at times: screaming at you for following the rules, not knowing how to do their jobs, and taking credit for your hardwork"}, "7": {"Date": " Oct 2, 2016", "Summary": "\"company experience\"", "Pros": "great experience and learn a lot about customer service", "Cons": "They need work more on how team work should do."}, "8": {"Date": " Oct 2, 2016", "Summary": "\"Cashier\"", "Pros": "Good work environment, people, and overall team players for the most part.", "Cons": "Selling people body weight due to the human lack of self control."}, "9": {"Date": " Oct 2, 2016", "Summary": "\"Bad\"", "Pros": "Good hours flexible free food when working", "Cons": "Crazy poor management rude customers"}}