{"0": {"Date": " Mar 22, 2017", "Summary": "\"Service Crew\"", "Pros": "good people, flexible schedule, free lunch", "Cons": "over worked, weird hours, not enough breaks"}, "1": {"Date": " Mar 7, 2017", "Summary": "\"Best job for going through college\"", "Pros": "Nice payGood benefitsGood options for advancement", "Cons": "Some managers are meanOccasional issues with coworkers"}, "2": {"Date": " Mar 7, 2017", "Summary": "\"Maintenance/Cook\"", "Pros": "Flexible Schedule, advancements available, very clean workplace", "Cons": "Customers can be rude like any fast food job"}, "3": {"Date": " Mar 8, 2017", "Summary": "\"Awesome\"", "Pros": "Wonderful coworkers, exceptional higher ups, incentives, and a crew of team players", "Cons": "Grease. Heat. Rude customers from time to time. PEAK."}, "4": {"Date": " Mar 8, 2017", "Summary": "\"I'm a manager at Burger King for 4 years.\"", "Pros": "Because I like the company and work with the customer . I already worked for mcdonal before, and I did not continue working because I moved to another city.", "Cons": "Try to make McDonald's better than it already is now and bring my experience to make mcdonal the best,and make the best customer service."}, "5": {"Date": " Mar 8, 2017", "Summary": "\"Employee\"", "Pros": "Works well, best employee there is", "Cons": "N/A Nothing to say/add :)"}, "6": {"Date": " Mar 8, 2017", "Summary": "\"Crew Person\"", "Pros": "Fun fast work environment co-workers were cool.", "Cons": "Some customers are just plain out rude I think they think we are robots not real people."}, "7": {"Date": " Mar 23, 2017", "Summary": "\"Grunt Work and (often) Rude Customers\"", "Pros": "If you're looking for a job with flexible hours, McDonald's is for you.Some locations will pay you >$8.00 an hour, but the one I work at is a Franchise so I only get paid $7.55/hour- there is always room for a raise though.Time can pass by pretty quickly when you are busy.", "Cons": "Customers will be super rude to you for no reason, especially if the place is busy and they are impatient.It's easy to get distracted during rush hour, which can make everything get messed up or put out of order.At least at where I work, we constantly have people trying to get free food for stupid reasons and the managers are often no where to be found when we need them."}, "8": {"Date": " Mar 7, 2017", "Summary": "\"Cashier\"", "Pros": "Fellow Coworkers were great. The job was easy enough for a part time student to make money. Hours were Flexible and McDonalds food is pretty good", "Cons": "The rush hours could be hectic and, felt understaffed. Managers were poor. Needed more Training"}, "9": {"Date": " Mar 7, 2017", "Summary": "\"Good place\"", "Pros": "* Nice people* Nice hours", "Cons": "* Low pay* Not enough hours"}}