{"0": {"Date": " Dec 16, 2015", "Summary": "\"Need Better Management of Store Operations\"", "Pros": "For a crew member at a fast food chain, it was actually not a bad place to work. It was fast-paced and certainly not monotonous.", "Cons": "Store operations were often overly complicated and cumbersome. Also could use more modern equipment. Our computer system crashed a bit too often, forcing us to run the store without computer systems for sometimes up to 20-30 minutes at a time."}, "1": {"Date": " Dec 18, 2015", "Summary": "\"McDonald's Review\"", "Pros": "I loved working with the employees there. I was able to meet interesting people and learned alot on the job.", "Cons": "Some times the schedule that I had had some conflicts."}, "2": {"Date": " Dec 18, 2015", "Summary": "\"GRRRRATE\"", "Pros": "Free food, drinks, easy, high pay, flexible hours, tips, big bonus, nice people. just really great. made 10$ a hour working part time", "Cons": "Not really any cons besides floors get so dirty so fast and bugs sometimes die in the back and get in some of the food so we have to throw it away."}, "3": {"Date": " Dec 18, 2015", "Summary": "\"Great Place to Work!!\"", "Pros": "McDonald's has a fun and thriving environment. I have made new friends and gained valuable acquaintances. While the job is simple, you learn a lot along the way.", "Cons": "All of what I have to say about McDonald's is positive! There is nothing wrong with the environment."}, "4": {"Date": " Jan 24, 2016", "Summary": "\"Awful !\"", "Pros": "Most co-workers are relatively nice.", "Cons": "Everything else....mainly low pay and a lot of work to be done"}, "5": {"Date": " Dec 18, 2015", "Summary": "\"Crew\"", "Pros": "Cool people. Morning, lunch, dinner rush. Lots going on.", "Cons": "Bad pay, almost no raises. and graveyard was worst pay,"}, "6": {"Date": " Dec 18, 2015", "Summary": "\"Stressful job with few perks but reasonable pay for a college student paying bills.\"", "Pros": "Most of the people who work here are actually incredibly nice.", "Cons": "Long stressful shifts, sometimes incompetent higher level management and loads of rude customers talking down to you."}, "7": {"Date": " Dec 19, 2015", "Summary": "\"Review\"", "Pros": "Friendly people and fast paced", "Cons": "There is nothing really bad about it"}, "8": {"Date": " Dec 17, 2015", "Summary": "\"Awesome\"", "Pros": "I got to eat a lot of free fries.", "Cons": "I went home smelling like grease."}, "9": {"Date": " Dec 17, 2015", "Summary": "\"crew member\"", "Pros": "I just truly need a job to support my family and McDonald's is the best place to apply for.none never had disappointed me to work at any restaurant.", "Cons": "Never had any downsides on this matters"}}