{"0": {"Date": " Aug 21, 2016", "Summary": "\"A Good Place to Work (Once you reach a certain level)\"", "Pros": "Offer a great benefits package (or at least they used to) which includes 90% tuition reimbursement for salaried management staff.", "Cons": "It's a thankless job... Absolutely thankless."}, "1": {"Date": " Aug 6, 2016", "Summary": "\"Grill Cool\"", "Pros": "Some of the best people I've ever worked under.", "Cons": "None at all. Great place to work."}, "2": {"Date": " Aug 7, 2016", "Summary": "\"Crew trainer\"", "Pros": "I really love working with people meeting people every day.", "Cons": "Some of the downsides I've personally have had has been having to trying to train new crew members and don't like me and have tried to discriminate me. But i don't let that get to me i come to work and help people out and its hard sometimes but i love working with people."}, "3": {"Date": " Sep 11, 2016", "Summary": "\"Cook\"", "Pros": "Leaving the store, and stealing food.", "Cons": "Job blows a fat one, They made me dress up as Ronald and a small child threw a chicken nugget at me. Degrading"}, "4": {"Date": " Sep 12, 2016", "Summary": "\"Worst Franchise to work for\"", "Pros": "there are none to be shared.", "Cons": "Franchise owned, and most corrupt business practices I have ever worked for in my life."}, "5": {"Date": " Aug 6, 2016", "Summary": "\"Cashier/Drive-Thru\"", "Pros": "Work in a team environment. Great opportunity to work on customer service.", "Cons": "Managers can be slack. At times as a crew member you end up acting as a manager due to lack of direction."}, "6": {"Date": " Aug 20, 2016", "Summary": "\"Shift Manager\"", "Pros": "Schedule, Free Meal, Benefits, Easy", "Cons": "Pay, Schedule, Managers, Benefits, Lack of crew"}, "7": {"Date": " Aug 5, 2016", "Summary": "\"General Manager\"", "Pros": "Flexible schedule, careers opportunities, benefits and compentation", "Cons": "24/7 hours of operations, high turn over,"}, "8": {"Date": " Aug 5, 2016", "Summary": "\"Marketing Manager\"", "Pros": "Benefits, security, support and resources. Usually a stable environment. Solid working conditions and the tools to get the job done across all disciplines.", "Cons": "Slow to adapt, too many layers, franchisees are too involved in non-operations decisions. Workload continues to increase across the board."}, "9": {"Date": " Aug 5, 2016", "Summary": "\"It's alright.\"", "Pros": "four hours of free pay if you're not late or have rescheduled in a month$15 for every A if you're in schoolCan help with college tuitionPay is good, lots of hours", "Cons": "long shifts, but i mean it just means more pay"}}