{"0": {"Date": " Aug 27, 2017", "Summary": "\"Work\"", "Pros": "Great hours and grea work environment", "Cons": "No respect and doesn't know how to treat employees fairly."}, "1": {"Date": " Sep 9, 2017", "Summary": "\"Good and Bad\"", "Pros": "Great entry level experience. high school or part time supplemental", "Cons": "work with a lot of people who \"don't care\" or have poor work ethics"}, "2": {"Date": " Sep 9, 2017", "Summary": "\"McDonalds\"", "Pros": "Worked around my schedule well. Work was fast paced. It was good for a high schooler.", "Cons": "Management was a joke. No advancement or raise in the year I worked there. Super high turnover for a reason"}, "3": {"Date": " Aug 25, 2017", "Summary": "\"Great for fast food\"", "Pros": "Great 1st job for a high school kid, very flexible with schedule and easy to get hired, pay is average minimum wage", "Cons": "Minimum wage, hard work, takes a lot of patience to get through the training but if you give it time , it gets better"}, "4": {"Date": " Sep 10, 2017", "Summary": "\"crew worker\"", "Pros": "It's a job that you are almost certainly able to get, they will take pretty much anyone. And the people are good, you all bond under the unnecessary duress and unsatisfactory working circumstances.", "Cons": "the unnecessary duress and unsatisfactory working circumstances."}, "5": {"Date": " Aug 22, 2017", "Summary": "\"Good worker\"", "Pros": "It's very clean.very good good & drinks.I plan on furthering my education soon.", "Cons": "Some of them managers think just cause they have a tire n a shirt on think they can talk to us crewmembers any kind of way & that's not right."}, "6": {"Date": " Sep 8, 2017", "Summary": "\"Decent place depending on coworkers\"", "Pros": "- Easy to get hired- Easy job, just fast paced enough to make time go by quick- I had great coworkers, but YMMV", "Cons": "- Stressful if you work at a busy location- If your coworkers suck, your life will suck"}, "7": {"Date": " Sep 8, 2017", "Summary": "\"It's an oaky first job.\"", "Pros": "Working at McDonald's you can get raises very quickly and it's really easy to learn the positions. You can also get promoted fairly easily and it's a fast paced job and everyday you encounter something different.", "Cons": "They don't really give you a lot of opportunity to grow and learn, and they really don't care about the employees. They tend to hire too many people and that can negatively effect you're hours. And they don't expect you to stay long and you can tell."}, "8": {"Date": " Sep 8, 2017", "Summary": "\"Don't work there\"", "Pros": "Management training gives you college credits", "Cons": "Low pay, not appreciated as a person, very stressful"}, "9": {"Date": " Aug 24, 2017", "Summary": "\"Cook\"", "Pros": "Got to cook lots of burgers.", "Cons": "Fish fillets are not my thing."}}