{"0": {"Date": " Jun 29, 2017", "Summary": "\"Not too bad\"", "Pros": "easy work, friendly people, can be fun", "Cons": "low pay and not much room for improvement"}, "1": {"Date": " Jun 29, 2017", "Summary": "\"Okay part time.\"", "Pros": "Seriously not a bad job with flexibility if you need one while you're in school.", "Cons": "Customers can be really degrading."}, "2": {"Date": " Jun 29, 2017", "Summary": "\"Good job\"", "Pros": "Challenging environment. Great people. Location.", "Cons": "Changes frequently. Pay not the best."}, "3": {"Date": " Jun 29, 2017", "Summary": "\"Given me everything I have, but always some very good with some very bad.\"", "Pros": "Very decent benefitsVery flexible to accommodate schoolingSome of the best wages without a degreeCustomer interaction is rewardingIf there is a decent person above you the training system is second to none.Lots of opportunities in the restaurant for advancement up until GM level.Most cases at lower leadership levels,you are the only thing between you and promotion. You can move as fast as you can learn/demonstrate.", "Cons": "Bad wage in relation to responsibilitiesBad work/life balanceFeel bad for taking time off.Politics are very prevelant and determine promotions at higher than restaurant level. (Who you know scenario)"}, "4": {"Date": " Jul 13, 2017", "Summary": "\"Meh\"", "Pros": "Manager meal, overtime, 10% discount when not working", "Cons": "Drama, bad management, no sick days"}, "5": {"Date": " Jul 14, 2017", "Summary": "\"Fine, good summer job for me\"", "Pros": "Good Co-workers, Solid Pay, Flexible Schedule", "Cons": "Smelly at times, minimum wage"}, "6": {"Date": " Jul 14, 2017", "Summary": "\"cashier\"", "Pros": "discount on food, fast-paced environment made time go fast", "Cons": "management was poor, long hours"}, "7": {"Date": " Jun 29, 2017", "Summary": "\"High School Job\"", "Pros": "They had a really flexible schedule.", "Cons": "Working with teenagers, and dealing with the public."}, "8": {"Date": " Jun 29, 2017", "Summary": "\"Cashier\"", "Pros": "Good starting job if you need money.", "Cons": "Third shift is hard due to hours."}, "9": {"Date": " Jul 14, 2017", "Summary": "\"Franchises are rough\"", "Pros": "Free meal if you are a manager or manager in training. Heavy discount if you are a crew member. I worked at a franchise, not a corporate store.", "Cons": "Never given full time; purposely keep you under full time hours. Pay is low and raise promises are not kept."}}