{"0": {"Date": " Mar 15, 2016", "Summary": "\"McDonalds bad company\"", "Pros": "Meet new people, Working with Food.", "Cons": "Pay and some mangers are rude and disrespectful"}, "1": {"Date": " Mar 15, 2016", "Summary": "\"nice\"", "Pros": "Great coworkers, good shifts, nice atmosphere I really don't know what else to put here. I think I have summed it up already", "Cons": "Scheduled hours not always good. That is my only con, so 20 words I'd just too much."}, "2": {"Date": " Feb 29, 2016", "Summary": "\"cashier\"", "Pros": "they gave you free foodd", "Cons": "no respect among the management"}, "3": {"Date": " Apr 6, 2016", "Summary": "\"Crew Member\"", "Pros": "Free Meals, and new learning opportunists.", "Cons": "Breaks not given, and they withheld my paycheck. Poor management, and if you got burned they would tell you to put mustard on it instead of writing every incident down."}, "4": {"Date": " Mar 15, 2016", "Summary": "\"Crew trainer\"", "Pros": "Free food that was litterally it", "Cons": "Under appreciative management.they don't care"}, "5": {"Date": " Feb 29, 2016", "Summary": "\"No one wants to work\"", "Pros": "You will get a lot of hours.", "Cons": "No one wants to work a lot of people call off. Managers dont work hard either."}, "6": {"Date": " Feb 29, 2016", "Summary": "\"Overall good\"", "Pros": "Great opportunity to move up. Lots of educational opportunities. A large company that actually cares about you.", "Cons": "There are moments when it is insanely busy. But overall it is a great experience."}, "7": {"Date": " Feb 29, 2016", "Summary": "\"Great place for starting\"", "Pros": "Fantastic place for starting out your resume; easy to move up for hard workers. Generally a young workforce, which keeps things entertaining. Fast paced; never boring.", "Cons": "Store-level management varies greatly in effectiveness and attitude. General lack of formal education in managers. Customers can be trying."}, "8": {"Date": " Mar 12, 2016", "Summary": "\"Cashier/Crew Member\"", "Pros": "Customer Satisfaction, personal dedication and I am reliable", "Cons": "Surrounded by miserable coworkers, to many on phones and standing around"}, "9": {"Date": " Mar 14, 2016", "Summary": "\"Need a job\"", "Pros": "It's a job, so I can get money to pay my bills. I do Crew and Maintenence. There's nothing special about., just a job.", "Cons": "The job suck, it as always sucked. Even when I worked at McDonalds in 93, it sucked then, and sucks now."}}