{"0": {"Date": " Aug 5, 2017", "Summary": "\"Ok part time job\"", "Pros": "Good managersGood environmentgood experiencegood side job", "Cons": "little payequipmentcommunication was not good"}, "1": {"Date": " Aug 5, 2017", "Summary": "\"Cashier\"", "Pros": "Learn a lot of customer service and communication skills", "Cons": "The higher up workers aren't respectful"}, "2": {"Date": " Aug 5, 2017", "Summary": "\"You will either love working at Mcdonald's or hate it.\"", "Pros": "It was fun working with my peers. Time would fly by during rushes. Being able to challenge myself and improve my ability to multitask was a great feeing of accomplishment.", "Cons": "Having to deal with rude customers was the most frustrating thing ever. When something was done wrong in the grill area customers blamed anybody they laid their eyes on. Not having proper training was disappointing."}, "3": {"Date": " Aug 6, 2017", "Summary": "\"Overall good experience\"", "Pros": "Friendly staff and managersManage breaks accordinglyMost Mcdonalds offer free meals while workingFlexible hours and ability to request days off", "Cons": "It pays minimum wage and offers little to no tips fromCustomersYou will meet a lot of rude customers"}, "4": {"Date": " Aug 19, 2017", "Summary": "\"Cashier\"", "Pros": "Easy working the cash register", "Cons": "Angry customers and low pay"}, "5": {"Date": " Aug 19, 2017", "Summary": "\"Cook\"", "Pros": "Easy job anybody can start right away.", "Cons": "Fast work environment not for people that can not handle pressure."}, "6": {"Date": " Aug 20, 2017", "Summary": "\"Manager\"", "Pros": "Room to develop in company . Fast pace environment. Learn outstanding customer service.", "Cons": "Great company. Do not get paid on time."}, "7": {"Date": " Aug 4, 2017", "Summary": "\"Great coworkers\"", "Pros": "Great hours, the food is always changing and you get at least one free meal Per shift. It was busy but the time went by fast", "Cons": "No real cons, other than I wish I could create my menu item and have a store contest to see who's was the best"}, "8": {"Date": " Sep 9, 2017", "Summary": "\"Terrible place\"", "Pros": "None at all in this forsaken place", "Cons": "It's terrible and low paying"}, "9": {"Date": " Aug 19, 2017", "Summary": "\"You gotta do what you gotta do\"", "Pros": "I would say the people I got to work with because I met some very nice and some very odd people while working, I don't regret my experience but I did leave the job because it was more awful than good.", "Cons": "The customers walk all over the employees, I feel as if most people don't like that."}}