{"0": {"Date": " Dec 5, 2017", "Summary": "\"Poor Managment\"", "Pros": "The only pros to this place are my coworkers. Most are great", "Cons": "Cons are there us no cooperation here. Nobody talks to anybody to know what is what in daily operations. Manageres dont know how to talk to employees without yelling or being nadty"}, "1": {"Date": " Dec 6, 2017", "Summary": "\"MANAGER\"", "Pros": "We get whipped if we do our job right. :D", "Cons": "The people are really nice. We also get good pays. D:"}, "2": {"Date": " Dec 6, 2017", "Summary": "\"Why\"", "Pros": "The Kids are sooo bad", "Cons": "The Mangers are hot trash on a stick"}, "3": {"Date": " Nov 14, 2017", "Summary": "\"first job\"", "Pros": "fun crewgood stepping stone for a high school student ,i learned how to have a job", "Cons": "little pay for relentless workcustomers were often times rude"}, "4": {"Date": " Nov 14, 2017", "Summary": "\"What you expect\"", "Pros": "easy fast easy low hours", "Cons": "its what you expect so yeah"}, "5": {"Date": " Nov 14, 2017", "Summary": "\"McDonald’s crew member\"", "Pros": "Very friendly environment, easy to learn and to make new friends. Scheduling is usually very very flexible and they let you work when you can.", "Cons": "Rude coworkers, sometimes the customers become unruly over nothing. Clientele and location sometimes determine the quality of the store and that puts a damper on things."}, "6": {"Date": " Nov 14, 2017", "Summary": "\"Cashier\"", "Pros": "Food, good employees to work with sometime", "Cons": "Everything, poor management, lack of care for workers"}, "7": {"Date": " Oct 30, 2017", "Summary": "\"McDonalds\"", "Pros": "Flexible work schedules is a huge reason to work here and over time is amazing when you work closing shifts.", "Cons": "Most of the time we are under staffed during the mornings and nights and things get crazy where one person may be on grill and table at the same time."}, "8": {"Date": " Oct 31, 2017", "Summary": "\"Crew Member\"", "Pros": "The work is simple, the hours are flexible, and they give raises every six months.", "Cons": "While simple, the work can be stressful during the food rushes throughout the day."}, "9": {"Date": " Oct 31, 2017", "Summary": "\"Shift Manager\"", "Pros": "Great experience in management and business", "Cons": "Not as much experience as I’d like"}}