{"0": {"Date": " Sep 8, 2016", "Summary": "\"D.O\"", "Pros": "Great place to work. Having a lot of fun", "Cons": "None. All that the promise has came true."}, "1": {"Date": " Sep 9, 2016", "Summary": "\"Nice part time job\"", "Pros": "Plenty of people are working with you so you get all kinds of personality, which is something I enjoy.", "Cons": "Like most restaurants or any job for that matter, dealing with people can be a pain."}, "2": {"Date": " Oct 14, 2016", "Summary": "\"People Manager-Department Manager\"", "Pros": "Fast paced, Easy to move up, Overtime", "Cons": "Other employees often dont show up. Mcdonald's attendance policy allows for a call in a few hours before shift and it is considered excused. Doesn't pay crew much so often get the people no one else will hire, depending on owner (because most are independently owned) you may or may not have to follow ACTUAL mcdonald's corporate policies and procedures. I had an owner who was by the book especially on food saftey and transfered to one who didn't follow them..even the general manager wouldn't wear gloves sometimes when handling food. Little appreciatation, discrimination, favortism, lots of sexual talk, lazy workers and some lazyness in management, unrealistic expectations"}, "3": {"Date": " Oct 14, 2016", "Summary": "\"Looking for a new job.\"", "Pros": "Customer service experience. Team work experience and time management. Cashier experience, working as a team and solving problems with in employees and customers.", "Cons": "Company was unstable, and people and employees were a bit rude and disrespectful. Experience was not what I expected."}, "4": {"Date": " Oct 15, 2016", "Summary": "\"Worst job ever\"", "Pros": "It's pretty easy to learn everything. Coworkers are nice and very helpful. It's easy to make friends.", "Cons": "People are rude because they expect that you're rude, cleaning the bathrooms is a hot mess, I went in once to find underwear soaked in pee with a pad attached to it. It's really a stressful job."}, "5": {"Date": " Sep 8, 2016", "Summary": "\"Cashier, runner\"", "Pros": "When I worked there years ago I did enjoy it. Worked at night, great workers, a couple managers were iffy but it was never a big issue.", "Cons": "My last year they got rid of most of the workers and got new management which were rude. When I got hired they said piercings were fine but when the new management came in they didn't introduce themselves and just told me I can't wear what I usually do.No benefitsHad one raise for the two years working there, wasn't a lot."}, "6": {"Date": " Sep 22, 2016", "Summary": "\"mcdonalds\"", "Pros": "Loved my employees and sone of the shuft leaders.", "Cons": "Managment team sucked and they suck at promoting."}, "7": {"Date": " Sep 22, 2016", "Summary": "\"Crew Member\"", "Pros": "Always something to do, very flexible,", "Cons": "Shifts feel like they last forever, very low pay,"}, "8": {"Date": " Sep 22, 2016", "Summary": "\"It is what it is\"", "Pros": "They have a good training program", "Cons": "It is not a very inspiring job"}, "9": {"Date": " Sep 23, 2016", "Summary": "\"Good place for young people to work\"", "Pros": "Opportunity to get plenty of hours if you want them", "Cons": "Workers do not make enough money"}}