{"0": {"Date": " May 16, 2016", "Summary": "\"McDonald's review\"", "Pros": "It's a pretty good job for starting out teenagers.", "Cons": "My McDonald's in particular doesn't work with you much and some managers are rude."}, "1": {"Date": " May 16, 2016", "Summary": "\"Fast paced, Pays well, HR unresponsive\"", "Pros": "It's a simple job for what it is.(Cashier/Grill/Drive through/Fries)Flexible hours.Perfect for a high school or college kid.Many different age groups under one roof.Incentives.Bonuses.Benefits.Paid training.Weekly pay.Room for growth.Great pay for first or part-time job.", "Cons": "Employees always calling out.Management having split personalities.Unrealistic deadlines for VIP visits.Short breaks after working long hours.No respect for holidays.Always on the lookout for a crazy manager when they're off the clock.Calls/Problems reported to HR (by employees) went unanswered.Quick to respond/fix a problem with a customer complaint. . . But not for an employee."}, "2": {"Date": " May 29, 2016", "Summary": "\"They work with rough schedules but can be Physically & mentally draining though.\"", "Pros": "It's a 24hour store so there are lots of shifts to fit into. The earlier shifts usually have older workers which helps. Very helpful when learning new tasks, they can teach you first hand, have you watch a video or you can read about it.", "Cons": "Obviously the public is mostly VERY hateful towards fast food workers & you have to have a thick skin. It can be dangerous, I fell a month ago & am still nursing a sprained wrist. The chemical sanitizers can be rough on the skin & floors even while wearing good shoes can be slick."}, "3": {"Date": " May 30, 2016", "Summary": "\"Good and bad in everything.\"", "Pros": "Willing to work with you. Generally good management. Easy to learn processes and quick references posted everywhere if you need help. Free meals. Opportunities for extra hours or overtime.", "Cons": "Other employees calling off/no-shows making shifts short of people often. Rarely fully staffed. Breaks missed/overlooked. Cash handling procedures stated in orientation/training are not followed on the floor."}, "4": {"Date": " May 30, 2016", "Summary": "\"It's aight\"", "Pros": "Flexible hours where ok for the most part", "Cons": "They want your life to be around them"}, "5": {"Date": " May 14, 2016", "Summary": "\"General Manager\"", "Pros": "Quality workforce, advancement opportunities, wonderful benefits", "Cons": "open 24 hours a day 365 days a year ."}, "6": {"Date": " May 15, 2016", "Summary": "\"Business Analyst\"", "Pros": "Vacation, free unlmited drink bar, fun atmosphere", "Cons": "Salary, horrible work life balance, horrible managment"}, "7": {"Date": " Jun 19, 2016", "Summary": "\"Don't work here.\"", "Pros": "Food discounts. The coworkers are awesome. Not really anything else I can say that is good about this company. Don't go work for them.", "Cons": "Demanding work. Long hours. No consistency. Managers are rude and don't care. They mess with your pay. I have been missing hours on paycheck and it took them almost 6 weeks to get those hours to me. It wasn't just a couple of hours, it was 25 hours(over half of one weeks pay). If you are lucky(or unlucky) to make it to management get used to being told you are messing up constantly and that your running your shift like crap. The standards you have to meet are so unrealistic it isn't even funny and there is no room for human error even if your understaffed. The managers think they are the best thing to walk the earth, especially the shift managers. The higher managers are a little bit cooler(with the exception of my area supervisor). Be ready to be constantly put down and told you are not good enough."}, "8": {"Date": " May 30, 2016", "Summary": "\"I felt used.\"", "Pros": "I can't think of one good reason to work for them besides I met some wonderful people", "Cons": "I have been working for 9 months with no raise and in very hot conditions."}, "9": {"Date": " May 27, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Great Team Work I'm Order To Meet Customer Needs.", "Cons": "Occasional Lack Of Supplies. Lack Of Employees On The Overnight Shift."}}