{"0": {"Date": " Aug 17, 2017", "Summary": "\"How it is to be a employee of mcdonalds Georgetown\"", "Pros": "It's a pretty easy job and your co-workers are pretty nice", "Cons": "The general manager isn't good to you it's super busy"}, "1": {"Date": " Aug 2, 2017", "Summary": "\"Cook\"", "Pros": "Its good work environment and good atmosphere", "Cons": "You don't get to pick your hours different manager different working environment"}, "2": {"Date": " Aug 2, 2017", "Summary": "\"Great First-time Job\"", "Pros": "Free lunch meal, develop great starting skills such as communication, multitasking, hard manual labor, and teamwork.", "Cons": "Busy shift all day, may be stressful, sometimes rude customers, sometimes overworked."}, "3": {"Date": " Aug 16, 2017", "Summary": "\"Crew Trainer\"", "Pros": "Greet customers that understand what’s going on.", "Cons": "Not enough staff to work with."}, "4": {"Date": " Aug 1, 2017", "Summary": "\"It was a pretty good job\"", "Pros": "I got some free food.", "Cons": "I didn't get much money."}, "5": {"Date": " Sep 7, 2017", "Summary": "\"General Manager\"", "Pros": "Free meals, paid vacation, ran my own store", "Cons": "Horrible salary, didn't always get days off and that happened a lot, expected to work and not leave until the job was done even if it went from opening the store to closing without leaving the building, and didn't get paid overtime even though we agreed after a certain number of hours per week I would get paid for overtime"}, "6": {"Date": " Sep 7, 2017", "Summary": "\"rerererererer\"", "Pros": "Over tiem and work as much as your want", "Cons": "Didnt like managment and supervisoers"}, "7": {"Date": " Aug 16, 2017", "Summary": "\"It's ok\"", "Pros": "The people you work withThe flexibly of the hours especially for a college student.If you show potential early on you can move up", "Cons": "The customer is not always right but we always have to say they are.Being a manager sucksEasy place for nepotism to take place."}, "8": {"Date": " Aug 17, 2017", "Summary": "\"Reviewing a Job to Apply for Another One I Guess\"", "Pros": "Decent Pay, and flexible hours", "Cons": "Low hours, uncomfortable working conditions"}, "9": {"Date": " Aug 1, 2017", "Summary": "\"Ok\"", "Pros": "Free food and discounts and good management", "Cons": "The pay is not what I would like"}}