{"0": {"Date": " Jul 18, 2016", "Summary": "\"Manager\"", "Pros": "It was a very good job and would go back", "Cons": "The food smelled to good and it was also good"}, "1": {"Date": " Aug 23, 2016", "Summary": "\"Crew Member\"", "Pros": "There were no pros for working this position. An 8 hour shift felt like 45 hours and the managers were all too upset with themselves for letting their lives come to this that they just yelled most of the time instead of actually managing.", "Cons": "I think I covered every thing in the pros section on accident but I don't feel like deleting it so I can add on here. They hire anyone and everyone which often led to situations that were not desirable. Most workers were (and this might be hard to believe) not qualified for the positions."}, "2": {"Date": " Aug 1, 2016", "Summary": "\"Time to get me a new job\"", "Pros": "*Some managers(not all) give you free food(anything you want)* fun times with other crew members*sometimes if lucky we get a few customers and we just have do basic cleaning and stocking.*some mangers are down to earth and will let you hear music with headphones as long as your doing your job.* A lot of room for learning cashier, grill cook, dish washer, and other positions,(the more you learn the more hours probably get)*once there for more than 8 hours a day , every hour overtime is payed $15/hr", "Cons": "*Place gets really hot, especially in the kitchen and dishwash area*Poor management*seems like I always have to stay extra just because theirs no one else at a certain time.*they don't hire enough people, gets so busy sometimes, and they still expect me to finish stocking and cleaning everything in my area for morning breakfast. not enough time... too busy since we're in downtown.*no real benefits*get burned alot cleaning grills.* they over order their stocking , and they miss order a lot too lol.* the way they do things don't work due to busyness, and it makes my job harder, talk abnout pressure to complete people's orders and beat the clock to clean grills, mop, sweep and stock and cook , and the orders never stop."}, "3": {"Date": " Aug 2, 2016", "Summary": "\"Hard Work. Low Pay.\"", "Pros": "It's a job where you will get hours.Opportunities to get into management if you work hard.Scheduling can be flexible depending on your manager.", "Cons": "Low Pay.On your feet all day.Extremely fast paced.Supervisors don't treat employees with respect. The job you are asked to do for the pay they give you is absurd."}, "4": {"Date": " Jul 18, 2016", "Summary": "\"Great job for students\"", "Pros": "It's easy to learn the job. This job is ideal for people looking to study and have some extra income.", "Cons": "Some customers are mean. You have to deal with really crazy people. It can be frustrating and stressful."}, "5": {"Date": " Jul 31, 2016", "Summary": "\"Job\"", "Pros": "I liked it alright, Tim and Patty are excellent franchisers and run a tight ship. Fast food simply wasn't for me.", "Cons": "Very fast paced. Yelling on occasion. Cleaning pee in the play place."}, "6": {"Date": " Jul 16, 2016", "Summary": "\"Great\"", "Pros": "It was a great experirnce", "Cons": "Bothing to add to this for a con"}, "7": {"Date": " Jul 30, 2016", "Summary": "\"Good first job\"", "Pros": "Move up easyNot hard workFlexible hours", "Cons": "The McDonald's I worked at was horribly managed and a lot of the time coworkers missed a shift or was late because management kept changing the schedules."}, "8": {"Date": " Jul 15, 2016", "Summary": "\"Swing Manager\"", "Pros": "Learn to deal with people", "Cons": "You have to deal with people"}, "9": {"Date": " Jul 15, 2016", "Summary": "\"Worker\"", "Pros": "good atmosphere good vibes good burgers", "Cons": "too much running around all the time"}}