{"0": {"Date": " Mar 27, 2018", "Summary": "\"Experience\"", "Pros": "Socializing with customers is nice when they are friendly", "Cons": "Difficult work hours at times, sometimes it gets very busy"}, "1": {"Date": " Mar 26, 2018", "Summary": "\"good\"", "Pros": "they were nice to me", "Cons": "not flexible hours working here"}, "2": {"Date": " Mar 26, 2018", "Summary": "\"Crew Trainer/Assistant Manager\"", "Pros": "Pretty consistent 40 hours and Mandatory corporate raises every 6 months of 15 cents to 50 cents.", "Cons": "Company treats workers as disposable, little to no recognition of hours/time requested off, no acknowledgement of preferred shifts even if stated prior to starting employment there, extremely passive aggressive workplace even from upper management, managers do not take accountability for their actions and will blame lower level employees."}, "3": {"Date": " Mar 27, 2018", "Summary": "\"Crew Member\"", "Pros": "The crew get really close and it becomes fun to work with people you like. My GM was super friendly and understanding. The job is a good place to make money when you need something temporary and they will give you TONS of hours (if you need the cash).", "Cons": "Upper management i.e. Supervisors, owners etc. are some of the worst people. They are extremely condescending and do not give crew members of managers chances to grow. The process of McDonalds is extremely narrow and you have to say everything EXACTLY right or you will get yelled for it, for example I said \"have a nice day\" instead of \"thank you\" to a customer, and a supervisor yelled at me for that. It's corporate culture is intimidating and rough, if you don't get your numbers you fail."}, "4": {"Date": " Mar 27, 2018", "Summary": "\"Cook\"", "Pros": "Good hours, nice people, and good benefits.", "Cons": "Hard work, dirty environment, and bad customers."}, "5": {"Date": " Mar 26, 2018", "Summary": "\"Poor Management\"", "Pros": "Easy to get hired, Customer service experience", "Cons": "management would rather see sale than see you succeed"}, "6": {"Date": " Mar 26, 2018", "Summary": "\"Decent Summer Job for High School\"", "Pros": "Pretty easy, repetitive work, had good co-workers", "Cons": "Didn't get a lot of hours, had pretty poor managers"}, "7": {"Date": " Mar 10, 2018", "Summary": "\"Working here is definitely an experience I'll remember forever\"", "Pros": "I had prior job zero experience and a sophomore in high school and they accepted me right away. The staff is one of a kind they're like a second family to me and they always support you in and out of work.", "Cons": "Usually get some extremely picky customers or some rude customers that give you a hard time for no reason even if your just trying to help."}, "8": {"Date": " Mar 25, 2018", "Summary": "\"cook\"", "Pros": "co-workers can be really friendly", "Cons": "manager was treated us poorly and lunch rush was stressful"}, "9": {"Date": " Mar 26, 2018", "Summary": "\"Hard work\"", "Pros": "Crew was friendly and nice30 minute breaksOccasional down time", "Cons": "Fast-paced at times with very little down time"}}