{"0": {"Date": " Dec 6, 2017", "Summary": "\"Cool job to work for\"", "Pros": "The easy ,lazy work for money was cool.", "Cons": "This is a job for immature teenagers."}, "1": {"Date": " Nov 21, 2017", "Summary": "\"Good place\"", "Pros": "Paid vacations, able to take days off in emergency situations, pay, loyal customers", "Cons": "Having to work short handed if someone calls in, rude customers, not enough time to get duties completed."}, "2": {"Date": " Dec 5, 2017", "Summary": "\"Cook\"", "Pros": "Good place to work at friendly people", "Cons": "It was a little frustrating about hours"}, "3": {"Date": " Dec 5, 2017", "Summary": "\"my experience at mcdonalds\"", "Pros": "great payflexibilityovertimefast-paced work environment", "Cons": "poor managementrude coworkerspacked linesdirty restroomsshort staffedlimited work benefits"}, "4": {"Date": " Dec 5, 2017", "Summary": "\"Crewmember\"", "Pros": "Flexible, work ethic, strong communication skills, and concept", "Cons": "rude customers, no management, bad manager"}, "5": {"Date": " Dec 6, 2017", "Summary": "\"Overall Company\"", "Pros": "The customers are very sweet.", "Cons": "They don't give out breaks.The pay sucks!They ask you to do a lot but don't want to pay you for all the work you put in.The general mangers attitude sucks!Not good at training new employees."}, "6": {"Date": " Nov 20, 2017", "Summary": "\"maintenance\"", "Pros": "because i love to see a smile on the people faces knowing they are eating at a clean establishment .", "Cons": "the people with the way they respcet the establishment , and getting along with the staff"}, "7": {"Date": " Dec 5, 2017", "Summary": "\"Don't work there unless you're in high school\"", "Pros": "You get paid and only a select couple of managers are actually good.", "Cons": "Managers treat me like garbage, safety risks are off the charts ESPECIALLY in the kitchen, they screw me over with my hours, and they expect us to do like a million things at a time. Never working here again after I quit. Also, they pick favorites and be nice to them and be rude to the people they don't like"}, "8": {"Date": " Dec 6, 2017", "Summary": "\"I worked  there enough for one life time to know how it runs.\"", "Pros": "They take most people over here with no job experience. Great way to get your foot in the door of having job experience.A Free crew meal each time you work & 50% off crew discount last I worked there.A 30min break every day you work.Meeting various people at workPay raises if you have you examples of how much hard work you're putting in.People there are nice once you get used to them.", "Cons": "Not everything is done when you get there at times which puts you behides almost every time for management, you and others when it comes time to head home.Areas aren't stocked when you get there which puts stress on you to get it done fast with customers coming in.Having to come in the morning each weekend to see the dinner trashed and low cleaning supplies.Pretty short payed breaks 5min aleast each day.Lack of  or too fast pace hands on training. No written guide to study. Need more learning resources.(quitting) High turn over rates they don't remember your name unless you work there quite awhile.Dealing with customers at times who always want the cheapest deal and get anger at you. For not giving it to them when you don't know.Holiday rushes that burn you out at the end.Overworked for what you are payed for as with most fast food places.Employees have a dark sense of humor at  times since they're overworked.Management normally outside way too long taking a break. When we get a lunch rush or need #s to overide a order.Management has their breaking points during stressful situations."}, "9": {"Date": " Dec 4, 2017", "Summary": "\"Okay\"", "Pros": "Really fun and overall happy.", "Cons": "Very very stressful and kind of gets annoying."}}