{"0": {"Date": " Jun 2, 2016", "Summary": "\"Review\"", "Pros": "Great co workers, easy shifts, easy job", "Cons": "Can be stressful, coworkers call off a lot."}, "1": {"Date": " Jun 2, 2016", "Summary": "\"Best Job I've Had.\"", "Pros": "- Great coworkers.- A majority of pleasant clientele.- Amazing management.- Close training.- Free food and drink during your shift.", "Cons": "- Lots of work.- Minimum Wage."}, "2": {"Date": " Jun 2, 2016", "Summary": "\"Fun\"", "Pros": "Friendly people to work with, great customer service, food is yummy, happy to come to work each day.benefits are excellent", "Cons": "Nothing I can really think of it this time, other than getting up really early in the morning and working really late sometimes"}, "3": {"Date": " Jul 8, 2016", "Summary": "\"Stress stress and more stress\"", "Pros": "Very flexible schedule that works really well with school. If you are willing to put in the effort it is relatively easy to move up into shift position.", "Cons": "A lot of in store drama, Very high expectations from upper management, upper managment plays a lot of mind games, and pay is not high enough for amount of pressure that is put on you."}, "4": {"Date": " Jul 9, 2016", "Summary": "\"Crew member\"", "Pros": "Pays the bills and rent", "Cons": "No room for advancement orignally hired for mgt position but partiality plays a major role."}, "5": {"Date": " Jun 17, 2016", "Summary": "\"Cashier\"", "Pros": "Management was very friendly and paid good attention to us.", "Cons": "Could pay more money, co workers did not care for work"}, "6": {"Date": " Jun 17, 2016", "Summary": "\"OK source of income and resume filler as a teen\"", "Pros": "- job experience available to teenagers- flexible work hours- possibility for raises every few months or so- employee discounts on food- can sometimes be a friendly environment", "Cons": "- customers who get angry with you for price changes even though you don't control them- standing for up to 8 hrs a day with only a 15-30min break in between- coworker drama can get pretty intense- minimum wage"}, "7": {"Date": " Jun 2, 2016", "Summary": "\"Great company. Great in school job.\"", "Pros": "Good work environment. Good pay", "Cons": "I now hate mcdonalds alot"}, "8": {"Date": " Jun 2, 2016", "Summary": "\"It's a job\"", "Pros": "I love the policy and procedures at McDonald's how every you get stuck working with people who can't follow the basics and food quality suffers. Management don't want to offend people so they don't say anything and it continues.", "Cons": "If you work they will work you to death"}, "9": {"Date": " Jun 16, 2016", "Summary": "\"Crew\"", "Pros": "It Was Very Fast Paced", "Cons": "The Staff Was Not Dedicated"}}