{"0": {"Date": " Dec 2, 2016", "Summary": "\"DONT WORK HERE\"", "Pros": "Good moneyDay goes by fastEasy job", "Cons": "Don't care about collegePeople in the company are incredibly jealous of everyoneSupervisors only listen to gmsNo one appreciates anyone"}, "1": {"Date": " Nov 10, 2016", "Summary": "\"Department Manager\"", "Pros": "Very flexible schedule, you meet quite a few people through this job as the turn-over rate tends to be high for these kinds of jobs., discounted food for crew members and free food for managers, plenty of opportunities to advance within the job, on-the-job training is fantastic and highly detailed.", "Cons": "It is to be expected that the pay for working in a fast food restaurant leaves much to be desired, however the work load expected of the senior managers and even such manager-trainees is heavy and many feel they are not compensated well enough. Work holidays without holiday pay (mandatory for managers)"}, "2": {"Date": " Oct 26, 2016", "Summary": "\"Working there\"", "Pros": "You get to meet a lot of different people. I got to help out people which I love.", "Cons": "You encounter all kinds of people. Everybody has their days so you have to be mindful of that"}, "3": {"Date": " Oct 27, 2016", "Summary": "\"Cashier\"", "Pros": "Great with employees. They also have great work parties. They are about their employees.", "Cons": "If your really good at the job they will try to keep you past your schedule."}, "4": {"Date": " Nov 9, 2016", "Summary": "\"Okay\"", "Pros": "Busy a lot rude people", "Cons": "Manager strict yelled some time"}, "5": {"Date": " Nov 9, 2016", "Summary": "\"Great Starting Point\"", "Pros": "This job prepared me for many others that I never would have expected. Experience at McDonalds is pretty valued by employers because it shows dedication and discipline.", "Cons": "The job isn't always clean, and I recieved my share of burns from grease or other hot surfaces."}, "6": {"Date": " Nov 10, 2016", "Summary": "\"good first job\"", "Pros": "Food discounts, flexible schedule, no advanced skills really needed, pretty easy to get a job there. Good first job for a teen.", "Cons": "Many employees have bad attitudes, managers are on a power trip, and day versus night shift is a complete opposite experience."}, "7": {"Date": " Oct 25, 2016", "Summary": "\"GREAT\"", "Pros": "GREAT experience, where do I even start", "Cons": "Nothing bad to say. Life is great."}, "8": {"Date": " Nov 30, 2016", "Summary": "\"It Has the Highest Turnover Rate in the Country for a Reason.\"", "Pros": "- Easy tasks- Negotiable Hours- Opportunities for Rapid Advancement", "Cons": "- Busy work- Rude customers- Incompetent Staff and Management"}, "9": {"Date": " Nov 10, 2016", "Summary": "\"Meh\"", "Pros": "Good people, good first job", "Cons": "Too much grease, cloths will smell"}}