{"0": {"Date": " Feb 22, 2016", "Summary": "\"Mcdonalds Experience\"", "Pros": "You get a discount on food.", "Cons": "You have to deal with horrible customers"}, "1": {"Date": " Feb 22, 2016", "Summary": "\"Alright, not the best, but its a service job\"", "Pros": "Flexable hours for shifts, worked well with being with college and being able to work over breaks.", "Cons": "Hours are cut during \"slow\" times over the year which causes workers to have to perform several tasks at the same time in order to please customers."}, "2": {"Date": " Feb 22, 2016", "Summary": "\"Crew Trainer\"", "Pros": "The fast pace generally keeps things from being too boring. No real qualifications needed to get the job. If you don't like a coworker, you probably won't have to wait long until they've quit (unless it's a manager).", "Cons": "Pretty much everything else qualifies as a con."}, "3": {"Date": " Feb 22, 2016", "Summary": "\"McDonalds was great\"", "Pros": "You have the ability to grow within the companyYou learn different task and its fast pace", "Cons": "Some of the head leaders are real rude, but still be focused"}, "4": {"Date": " Feb 22, 2016", "Summary": "\"McDonalds\"", "Pros": "They are very flexibleGood discounts", "Cons": "Employees get sometimes unnoticedlow pay"}, "5": {"Date": " Feb 22, 2016", "Summary": "\"just ok\"", "Pros": "Lots of responsibility fast pacedlearned a lot", "Cons": "cliquesmanagers ridiculing and talking about employees where others can hearneed better training"}, "6": {"Date": " Feb 23, 2016", "Summary": "\"They're Fine\"", "Pros": "Increased wages as if recently.", "Cons": "You get blamed for things that are beyond your control such as the full breakfast menu not being available all day. That's a national thing, not stores."}, "7": {"Date": " Feb 23, 2016", "Summary": "\"Shift manager\"", "Pros": "Mcdonalds has a great training program so it's a great first job if you need to gain experience. It's fast paced and can be fun to work sometimes.", "Cons": "It can be stressful with little reward. The pay is not great, but everybody knows that. I could honestly say a lot more but it really depends on your store and what you make of the job."}, "8": {"Date": " Mar 15, 2016", "Summary": "\"Cashier\"", "Pros": "Benefits, Coworkers, pay, flexibility for students.", "Cons": "Rude management, rude customers, dirty environment."}, "9": {"Date": " Mar 15, 2016", "Summary": "\"N/A\"", "Pros": "They help with your education", "Cons": "They hire too many young people"}}