{"0": {"Date": " Aug 8, 2017", "Summary": "\"717 East Broadway, Horrible place to work. Americas Worst First Job\"", "Pros": "Flexible schedule, easy tasks, half off food for crew and free for management", "Cons": "Rude management team, disrespectful crew, very low pay, uneducated employees, discrimination, picking favorites, unfair discipline, EXTREMELY UNPROFESSIONAL"}, "1": {"Date": " Jul 18, 2017", "Summary": "\"Crew Member\"", "Pros": "A few nice people. Easy to learn.", "Cons": "Miscommunication between managers and employees. Too much rude behavior by other crew members."}, "2": {"Date": " Jul 18, 2017", "Summary": "\"Basic job if you wanna learn\"", "Pros": "I guess the only pro was to learn basic customer service", "Cons": "Very little pay, hard to become management"}, "3": {"Date": " Jul 3, 2017", "Summary": "\"Good job at Florida Orlando\"", "Pros": "Flexible schedule, friendly people, opportunities", "Cons": "Rotating management, availability only at night shift"}, "4": {"Date": " Jul 3, 2017", "Summary": "\"wonderful\"", "Pros": "i like it because i always want more and they always try to work with your schedule also they have benefits you just need to asks", "Cons": "deal with mad customers and always try not to take so personally when you have mad costumers if you look on the eyes and havr smile you will be good"}, "5": {"Date": " Jul 3, 2017", "Summary": "\"Ayyylmao\"", "Pros": "Fun, Cool Co-workers, Free Food", "Cons": "Rude Customers, Fast Paced, Rushes"}, "6": {"Date": " Jul 17, 2017", "Summary": "\"mcdonald's experience\"", "Pros": "Great starting out job to open your eyes and show you kinda how the fast food system works.", "Cons": "No flexible schedule, Not enough money for the work they want to be done, Sloppy management, no real punishment for problem employees."}, "7": {"Date": " Jul 17, 2017", "Summary": "\"Good for HS\"", "Pros": "Flexible hours and fun depending on team", "Cons": "OverworkedHectic place to workLow Pay"}, "8": {"Date": " Jul 17, 2017", "Summary": "\"bad\"", "Pros": "It wasnt all that bad i guess", "Cons": "jUST kidding it really was that bad"}, "9": {"Date": " Jul 17, 2017", "Summary": "\"Cre member\"", "Pros": "Very flexible hours, nice manager", "Cons": "Not the best conworkers, a lot of rude people"}}