{"0": {"Date": " Jan 8, 2018", "Summary": "\"McDonald's\"", "Pros": "Free meal on every shift and will give you a small amount for college", "Cons": "Terrible management and coworkers. Rude customers. Unnacceptable hours."}, "1": {"Date": " Jan 7, 2018", "Summary": "\"Fine\"", "Pros": "Other crew members are nice too", "Cons": "Lack of proper training, they just kind of throw you into it."}, "2": {"Date": " Jan 8, 2018", "Summary": "\"Interesting job and I learned a lot\"", "Pros": "You learn important skills like patience, multi-tasking in a fast pace environment and problem solving. The job is usually easy and you get to meet some nice people. It is nice seeing people come in the store in a bad mood and leave in good mood and all you had to do was be nice to them.", "Cons": "The pay is not great I worked there 5 1/2 years and when I quit I was making 10.50 a hour. Every time there was an opportunity to get a raise by taking some lessons, I took it to get a pay raise. I worked every single position in the store except the general manager. Also, unfortunately in this job you realize just how mean people can be even when you don't do anything. They cap most employees off at 30 hours a week and managers work around 40 hours. If you are working as a crew member and you would like a raise, most of the time you have to ask for it."}, "3": {"Date": " Dec 23, 2017", "Summary": "\"Manager\"", "Pros": "Great experience and corporate involvement", "Cons": "Not many cons fro this job"}, "4": {"Date": " Jan 7, 2018", "Summary": "\"Crew\"", "Pros": "Get money easy to get the job", "Cons": "Bad work bad management you smell after about 3 hours"}, "5": {"Date": " Jan 8, 2018", "Summary": "\"its okay\"", "Pros": "they accept anyone as long as you want to work", "Cons": "minimum wage really really sucks for what you have to do"}, "6": {"Date": " Jan 6, 2018", "Summary": "\"Fine company\"", "Pros": "Flexible schedulingTuition reimbursementRoom for promotion", "Cons": "Low pay, especially for seasonal workers who might not get a raise every six months"}, "7": {"Date": " Jan 6, 2018", "Summary": "\"Working Here\"", "Pros": "Its good for a first job, but they[ management] can be difficult. they will always match your schedules. People really enjoy activities provided.", "Cons": "I hate that they can be extremely rude. By they I mean: customers, crew, and management. Customers who have never worked in fast food will never understand."}, "8": {"Date": " Dec 22, 2017", "Summary": "\"Good Job\"", "Pros": "Hard work, okay pay, not for everyone", "Cons": "It can be hard sometimes"}, "9": {"Date": " Jan 5, 2018", "Summary": "\"Good Job\"", "Pros": "Free food and decent family discounts", "Cons": "low Pay which turns people away"}}