{"0": {"Date": " Jan 23, 2016", "Summary": "\"It isn't a terrible job. Most of the coworkers are nice but some are a bit rude at times.\"", "Pros": "Two breaks per shift with a paid meal. If you don't know how to do something you don't have to worry about asking.", "Cons": "Some of the managers are hard to deal with. Most are nice but you have to be careful if you don't want to get yelled at. Just try and do your job quickly and correctly."}, "1": {"Date": " Feb 5, 2016", "Summary": "\"Customer service\"", "Pros": "Meeting some folks who are patient and mannerly.", "Cons": "Some customers are unmannerly and can be threatening"}, "2": {"Date": " Feb 6, 2016", "Summary": "\"Shift manager\"", "Pros": "The best reason to work is because u can make money to help provide for your family and working makes you have less stress because u a really trying to stay focused and motivated to keep customers happy and also your self", "Cons": "Someone can give you a hard time but you have to stay strong and positive"}, "3": {"Date": " Feb 6, 2016", "Summary": "\"OKAY\"", "Pros": "Decent pay but really bad management. There was room to grow to manager. It is a good starting job for high schoolers.", "Cons": "You have to deal with a lot of angry customers all day. Pay is not very good for the amount of work you have to do unfortunately. It is fine to deal with."}, "4": {"Date": " Feb 6, 2016", "Summary": "\"Everything\"", "Pros": "Always hiring, hours are always available", "Cons": "No career advancement, just a job"}, "5": {"Date": " Feb 6, 2016", "Summary": "\"cashier drive thur cook\"", "Pros": "ran the store on my over night shifts", "Cons": "angry people and rude people its food it can be fixed"}, "6": {"Date": " Jan 21, 2016", "Summary": "\"Cook\"", "Pros": "Flexible hours for part time position", "Cons": "Lower pay than my current job"}, "7": {"Date": " Feb 26, 2016", "Summary": "\"go anywhere else\"", "Pros": "I literally can't think of anything", "Cons": "no respect, bad customers, always smells"}, "8": {"Date": " Feb 27, 2016", "Summary": "\"Bad\"", "Pros": "It was easy to sign up and it isn't really a difficult job to get to every single day.", "Cons": "The manager hung up on me when I called about my application. Just extremely awful customer service at the cash registers. Always mixing up orders."}, "9": {"Date": " Feb 5, 2016", "Summary": "\"Decent pay, decent hours\"", "Pros": "Easiest job to attain on short notice. The orientation process does not normally take very long. The schedules are very flexible as they hire more people to accommodate for periods with higher days requested off.", "Cons": "Most people here are lazy and make you work harder than you should. The pay is not the greatest and receiving a promotion normally yields a very low raise for the added responsibilities."}}