{"0": {"Date": " Oct 17, 2017", "Summary": "\"my review\"", "Pros": "nice to other people fliping", "Cons": "long hours but it can pay off"}, "1": {"Date": " Oct 2, 2017", "Summary": "\"Restaurant Experience\"", "Pros": "They offer great benefits for the position I had at the restaurant. You work in a team with the rest of the management and the supervisors are always around to support and point you in the right direction.", "Cons": "Change is constant because of the nature of the business, therefore there is always uncertainty about job security and/or job location."}, "2": {"Date": " Oct 2, 2017", "Summary": "\"McDonald's review\"", "Pros": "Nice crew members, helps with customer service experience", "Cons": "Not good for disabilities, stressful"}, "3": {"Date": " Oct 2, 2017", "Summary": "\"Former cook\"", "Pros": "Great staff, close to all the big cities, and great plaza to work in! It has a kroger and has not to mention other commodities close by including pizza", "Cons": "Secluded city if you don't have a car, daily good pay only there are no employee benefits other than pay!"}, "4": {"Date": " Oct 3, 2017", "Summary": "\"Good entry level job for a teen\"", "Pros": "Meal Discounts, room to grow with the company, good training", "Cons": "High turnover rate. Very routine job."}, "5": {"Date": " Oct 16, 2017", "Summary": "\"Okay\"", "Pros": "A Flexible work scheduleNice people depending on locationCleanFree foodBreaks", "Cons": "Poor PayNo Health InsuranceNo dentalLow raisesPoor help"}, "6": {"Date": " Oct 16, 2017", "Summary": "\"Not the best, but it's not as bad as you'd think\"", "Pros": "Can make friends of co-workers quickly, you can only go through so many rushes together before everyone is close, flexible scheduling, great for someone working/going to school full time.", "Cons": "Pay isn't outstanding for the stress of the job, corporate owned McDonalds start higher."}, "7": {"Date": " Oct 16, 2017", "Summary": "\"Cook\"", "Pros": "Good Starter job but can't live on it", "Cons": "Bad managementMinimum wage, can barely survivehorrible customers"}, "8": {"Date": " Oct 16, 2017", "Summary": "\"General manager\"", "Pros": "Always something new. Opportunity to grow", "Cons": "Long hours upset guess on your feet"}, "9": {"Date": " Oct 16, 2017", "Summary": "\"Okay\"", "Pros": "FoodLearning in a fast-paced environment", "Cons": "Shifts are unpredictableManagement was not as friendly and did not communicate well"}}