{"0": {"Date": " Sep 21, 2017", "Summary": "\"Part-Time Employee\"", "Pros": "Worked around my hours and was able to allow me time off when needed", "Cons": "I felt like I was given the opportunity to move up in the company"}, "1": {"Date": " Sep 21, 2017", "Summary": "\"Not very good\"", "Pros": "Free food sometimes which is a plus", "Cons": "High pressure, customers rude to you"}, "2": {"Date": " Sep 21, 2017", "Summary": "\"Shift Manager\"", "Pros": "Stability, and plenty to learn if you apply yourself. Flexible hours, should never be a lack of full time hours as long as you apply yourself. You can always transfer to a different area, mist areas are always hiring.", "Cons": "Repetitive, stressful, low pay, high employee turn over in most areas. You always need a shower if you work here, both before and after work, mornings are early, most areas don't pay much above minimum wage."}, "3": {"Date": " Sep 21, 2017", "Summary": "\"Cashier\"", "Pros": "Flexible hours and good manager", "Cons": "Good place to work part time only"}, "4": {"Date": " Sep 21, 2017", "Summary": "\"Low level, fairly easy, can be gross, sometimes frustrating\"", "Pros": "Doesn't require that much skill, if your good at your job then plenty of hours, half off food, free soft drinks", "Cons": "Very greasy, not the smartest people, weight gain, customers can be mean, you have to deal with a lot of gross stuff and get your hands dirty"}, "5": {"Date": " Sep 22, 2017", "Summary": "\"Overall an ok place to work\"", "Pros": "Flexibility in schedule, perfect for parents, can call out as needed usually plenty of coverage", "Cons": "Large work load that is shared inconsistently among who is on shift depending upon when your shift is. They expect 3 employees to do the work of 7+. Results in unhappy customers and long wait times."}, "6": {"Date": " Sep 22, 2017", "Summary": "\"Crew Member\"", "Pros": "McDonalds had a decent training program and the job wasn't that difficult. They were flexible with my schedule since I was still in school.", "Cons": "Many of the employees were not fluent in English which posed a language barrier. They rarely gave out raises and when they did it was like 10 cents."}, "7": {"Date": " Sep 6, 2017", "Summary": "\"Cashier\"", "Pros": "I loved the crew I worked with and we all got along", "Cons": "Some things would be left undone for the next shift to do and I didn't like it"}, "8": {"Date": " Sep 6, 2017", "Summary": "\"crew member\"", "Pros": "Friendly crew and flexible schedule", "Cons": "hard to get days off and busy hours"}, "9": {"Date": " Sep 6, 2017", "Summary": "\"they were pretty awesome\"", "Pros": "i took breaks literally whenevs, they let me eat.", "Cons": "they trip about punching in and out. you cant ride no clock"}}