{"0": {"Date": " Jan 27, 2016", "Summary": "\"server\"", "Pros": "to make sure the customers get their best of food the request for", "Cons": "seeking dirt on the floor annoys me"}, "1": {"Date": " Jan 11, 2016", "Summary": "\"Manager\"", "Pros": "Customers, Leading, and Smiles. The best part was getting to know each of your customers and having great relationships with your employees.", "Cons": "There wasn't any cons. Mcdonald's i a great place to grow."}, "2": {"Date": " Jan 11, 2016", "Summary": "\"Guest Service manager\"", "Pros": "Great benefits, 401k,bonus, vacations,flexible schedule", "Cons": "none it is what it is"}, "3": {"Date": " Jan 12, 2016", "Summary": "\"Wonderful\"", "Pros": "They have Great managers and great it has a great working environment. The staff is friendly and well trained and the store is always clean.", "Cons": "This store is Busy busy busy busy busy busy. So if you or your family are in a hurry try to make it before lunch rush"}, "4": {"Date": " Feb 17, 2016", "Summary": "\"Cook\"", "Pros": "Food was good. Only thing good about the place", "Cons": "Horrible work conditions. Sad sad sad place"}, "5": {"Date": " Jan 26, 2016", "Summary": "\"Job is well, but not what I'm looking for.\"", "Pros": "Best reasons to work here are my salary, and the respect I get from my coworkers on the job, daily.", "Cons": "There are no challenges with this job. I need a more challenging job, and more pay. Most people who work there do not care for others."}, "6": {"Date": " Jan 27, 2016", "Summary": "\"crew\"", "Pros": "Good crew for the most partpart", "Cons": "Bad management and poor employees on some days"}, "7": {"Date": " Jan 11, 2016", "Summary": "\"Crew Member\"", "Pros": "Really great place to make new friends and learn the responsibility of having a job and what comes with having a job.", "Cons": "Don't always get treated equally with other employees"}, "8": {"Date": " Jan 11, 2016", "Summary": "\"Fries\"", "Pros": "It was a fun experience", "Cons": "It was fast passed, and the managers can be not patient."}, "9": {"Date": " Jan 11, 2016", "Summary": "\"cook\"", "Pros": "a overall good place to work at, very flexible hours, room to move up", "Cons": "low pay, fast pace, low respect"}}