{"0": {"Date": " Jun 2, 2016", "Summary": "\"McDonalds\"", "Pros": "Entry-level, no experience necessary, got job on day of interview, some friends worked there.", "Cons": "They don't really treat their employees well, there's always managers that push off their work onto you, and it can be unsafe sometimes. Also very low pay and high hours."}, "1": {"Date": " Apr 27, 2016", "Summary": "\"Not bad\"", "Pros": "Good start for working career", "Cons": "Min wage dealing with people"}, "2": {"Date": " May 12, 2016", "Summary": "\"Mcdonalds Warren MI\"", "Pros": "Great experience for people just starting out.", "Cons": "Pay isn't great. Management needs to hire more disabled people."}, "3": {"Date": " May 12, 2016", "Summary": "\"Cashier\"", "Pros": "easy job fun coworkers to work with.", "Cons": "not enough room to advance in this industry"}, "4": {"Date": " May 12, 2016", "Summary": "\"hours\"", "Pros": "free meals...paid training...co workers...when not rushing fun", "Cons": "hours...pay rate...some co workers...less break time"}, "5": {"Date": " May 11, 2016", "Summary": "\"Worst place ever to work\"", "Pros": "Free food overnights is very laid back free coffee free drinks see and hear crazy things", "Cons": "This place is nothing but drama it's high school all over again blamed stuff on over nights witch is the shift I work you will have no days off make you work 12 hours days only one break overnight didn't get a break"}, "6": {"Date": " Apr 26, 2016", "Summary": "\"cashier\"", "Pros": "I truly love the collard greens at lunch even though they gave me the bubble guts.", "Cons": "Staff is sometimes grouchy and like to disrespect the managers."}, "7": {"Date": " Apr 27, 2016", "Summary": "\"Cashier\"", "Pros": "The staff makes you feel at home!", "Cons": "I dont have anything bad to say but they could at least do direct deposit."}, "8": {"Date": " Apr 27, 2016", "Summary": "\"Store Manager\"", "Pros": "Pay is great and owners respect your judgment", "Cons": "Long hours no time for self."}, "9": {"Date": " Apr 27, 2016", "Summary": "\"Food\"", "Pros": "Delicious and i always com happy back home i just love it its just so nice and the service is also nice", "Cons": "Hard work and we have to work long but it pays off good colleges its fun fun fun fun fun"}}