{"0": {"Date": " Mar 19, 2016", "Summary": "\"Crew Member\"", "Pros": "Had great workmates, flexible hours", "Cons": "Have to work with unmotivated high school students"}, "1": {"Date": " Mar 19, 2016", "Summary": "\"its a job\"", "Pros": "Nothing reall got the bills paid", "Cons": "Everything over worked under paid"}, "2": {"Date": " Mar 20, 2016", "Summary": "\"Recommend for someone who just wants something simple when they're going to school\"", "Pros": "Nice people and great customers. Easy job.", "Cons": "Depending on management it can be stressful if they yell at you and say rude stuff under their breath."}, "3": {"Date": " Mar 4, 2016", "Summary": "\"Great\"", "Pros": "The best part about working in McDonalds is you get discounted food", "Cons": "There's no downside about working at McDonalds"}, "4": {"Date": " Mar 5, 2016", "Summary": "\"Special thanks to my former GM and info that can help improve work( it's long but worth reading)\"", "Pros": "I have worked for McDonald's for almost 4 years, started when I was a 18 yrs old high school student. When I started everything was knew to me obviously, but I was a fast learner. Here I meet Sev my GM who was a great boss (most of the time) and a great mentor. He taught me lots of things not just work related but life lessons that made me see things differently. He always tried to put his employees first which not many GMs or managers do or even care about, and you know that's true . He was concerned about the well being of the crew, he would sit down with us how we are doing, if there was anything he could do to help you if you were having personal problems. Any ways with in the first year of working there I became a manager which usually required you to have been working for multiple years. Hard work, dedication and lots of patience towards customers and managers who were lazy -most will know what I mean- and only knew complain and yell. Well those managers learned their lesson, me being the youngest manager I was one of the very few who was a legitimate certified Manager not an appointed crew given Manager status and I was also getting paid more than them as well. That was a bit off topic but I want to thank Sev for all he has done and will continue on doing.", "Cons": "There are many cons that I think applies at many McDonald's. 1-understaffing. 2- Managers who often yell at crew for x reasons and are most like not doing much themselves. 3- low Productivity crew who go to put in hours but complain when they are asked to do something and most likely do it at their own pace, these people usually irritate the hard working crew members who are usually up and down the store working 3x more. 4- low moral and unappreciated crew and efforts"}, "5": {"Date": " Apr 9, 2016", "Summary": "\"First job\"", "Pros": "Good first job.. Learn how to move fast take orders and serve food in a good amount of time", "Cons": "You don't make enough money the mangers make job harder then it needs to be"}, "6": {"Date": " Mar 19, 2016", "Summary": "\"Past employer\"", "Pros": "Flexible environment and easy to get a job there. Flexible scheduling and part time or full time available when needed", "Cons": "Management and pay increases are nonexistent or none at all don't expect management to be on your side for anything if you get into trouble"}, "7": {"Date": " Mar 19, 2016", "Summary": "\"skewed\"", "Pros": "the people you work with are great", "Cons": "promotional and gratitude toward employess are terrible"}, "8": {"Date": " Mar 4, 2016", "Summary": "\"McDonald's Crew Member\"", "Pros": "Great first job! Great learning experience! Great advancement opportunities! Good benefits and training. If you stay working, they also have their own business school to train you for running your own McDs restaurant franchise.", "Cons": "Burns from the grill and or fryer, on feet all day, fast paced - which can also be a pro."}, "9": {"Date": " Mar 4, 2016", "Summary": "\"none\"", "Pros": "RecommendsPositive OutlookProsTo provide Great Customer service to customers, to satisfy each and every want that they have.", "Cons": "Fast paced, didn't always have the best managements. Can get frustrating working with employees who do not take their job seriously"}}