{"0": {"Date": " Mar 14, 2017", "Summary": "\"crew member\"", "Pros": "fastness people interaction customer service responsibility happy", "Cons": "not enough pay hard work rude people"}, "1": {"Date": " Mar 28, 2017", "Summary": "\"Management was great and considerate\"", "Pros": "Got to get time off when I needed it.", "Cons": "The pay and benefits are low"}, "2": {"Date": " Mar 28, 2017", "Summary": "\"Working at Mcdonalds\"", "Pros": "It is very structured and professional. My branch employed a lot of students so the manager had to change the managing style. It was very efficient.", "Cons": "It was tiring. Very labor intensive. I smelled like grease and coffee when I came home. I made minimum wage."}, "3": {"Date": " Mar 28, 2017", "Summary": "\"You have a great time to get your clan to win this clan\"", "Pros": "You have a great time to get your clan to war with me the way we do both and I hope they", "Cons": "You have to find out what about the game is not much better for your game though it was still a fun night and it would have nice if there"}, "4": {"Date": " Mar 28, 2017", "Summary": "\"Good for kids to work on holydays\"", "Pros": "not so hard job, not so much thinking, no big stress", "Cons": "long hours, standing all day, boring managers"}, "5": {"Date": " Mar 28, 2017", "Summary": "\"Shift Manager\"", "Pros": "Worked with good people, free food.", "Cons": "High stress environment, bad pay"}, "6": {"Date": " Mar 27, 2017", "Summary": "\"Swing shift manager\"", "Pros": "Insurance benefits are great and affordable. You have the ability to move up within the company rather quickly. Flexible schedule.", "Cons": "I would have to say that the only real cons i would have with this job is that Being short on staff has its down falls and can become very stressful and overwhelming."}, "7": {"Date": " Mar 27, 2017", "Summary": "\"Management.\"", "Pros": "It's very simple. Once you get everything down, it's sometimes fun to compete and make yourself better. I worked for Acosta in San Antonio and it was a good experience besides a few managers.", "Cons": "It's fast pace & if you're working with lazy employees it sucks. It just so happens that the McDonalds I worked for had bad managers."}, "8": {"Date": " Mar 27, 2017", "Summary": "\"Work Culture\"", "Pros": "- flexible hours- easy work/requirements", "Cons": "- pay rate was low- bad working conditions"}, "9": {"Date": " Mar 27, 2017", "Summary": "\"good first job\"", "Pros": "hire anyone, work with school schedule", "Cons": "hire anyone, expect too much from high school kids, favoritism from management"}}