{"0": {"Date": " Sep 30, 2016", "Summary": "\"Kitchen Department Manager\"", "Pros": "Fairly easy once you memorize all of the reports and responsibilities you have.", "Cons": "Rude coworkers, crappy vacation hours, no time and a half for holidays, no weekends off"}, "1": {"Date": " Sep 30, 2016", "Summary": "\"Supervisor\"", "Pros": "There really is nothing positive at all", "Cons": "Customers are so very rude"}, "2": {"Date": " Sep 30, 2016", "Summary": "\"Swing manager\"", "Pros": "Lots of hours, quick moving up", "Cons": "little job security and sketchy promoting practices, bad training"}, "3": {"Date": " Oct 1, 2016", "Summary": "\"Manager\"", "Pros": "McDonald's has a great training program available that teaches you a variety of skills that are easily transferable to any job. The benefits package, profit sharing and bonus structure are definitely a bonus.", "Cons": "The culture is toxic and is based too much on relationships and not enough on talent. People have worked there for their entire lives and they are resistant to new people and more importantly to new ideas. They keep recycling the same underperformers throughout the company to different roles."}, "4": {"Date": " Sep 15, 2016", "Summary": "\"wondful\"", "Pros": "I learn alot from McDonald's and how to be a team player", "Cons": "you just had to work hard and make sure the guess is happy"}, "5": {"Date": " Sep 29, 2016", "Summary": "\"Gotta Start Somewhere\"", "Pros": "- Perfect for learning basic time management and customer service skills", "Cons": "- Much bureaucracy, often unclean work environment"}, "6": {"Date": " Sep 29, 2016", "Summary": "\"Co workers can be shady.\"", "Pros": "You can connect with other people & find them to he really interesting. Also a lot of them are funny", "Cons": "Dealing with so much negativity and rudeness from customers. Having to deal with fake co workers. Managers not liking you because theyre racist"}, "7": {"Date": " Sep 13, 2016", "Summary": "\"Cashier Lifestyle\"", "Pros": "Decent amount of pay for very easy work, free food every now and then when the manager was feeling nice.", "Cons": "During high-traffic hours, people could get impatient and things could go badly very quickly. Have to learn to be patient and not to get involved into any conflicts."}, "8": {"Date": " Sep 14, 2016", "Summary": "\"Manager\"", "Pros": "Great culture and work environment. I enjoy working with my GM and Area Supervisor", "Cons": "I have none at this time"}, "9": {"Date": " Sep 28, 2016", "Summary": "\"You know what you're getting yourself into\"", "Pros": "Worked here over the summer. They are always hiring which is a plus.", "Cons": "Cut my hours when I put in my two weeks"}}