{"0": {"Date": " Sep 13, 2016", "Summary": "\"I had to do this to stay a member\"", "Pros": "great starting job for the restaurant industry, not hard work just busy and time consuming.", "Cons": "Customers could be real pains, low starting salary."}, "1": {"Date": " Aug 29, 2016", "Summary": "\"Awesome\"", "Pros": "Love mcdonalds great job, time goes by quick, good pay", "Cons": "No cons, can get very busy as such"}, "2": {"Date": " Aug 29, 2016", "Summary": "\"Great experience\"", "Pros": "Best jobs for people needing help", "Cons": "Work hours but they are manageable"}, "3": {"Date": " Aug 30, 2016", "Summary": "\"Register\"", "Pros": "Well for the one the free food is great, but the statt is really great too. i enojyed my time. I liked the food also", "Cons": "It gets really busy so if your not up for the high pace invironment it may not be the best job for one indisal more or less"}, "4": {"Date": " Oct 4, 2016", "Summary": "\"McDonalds.... need I say more.\"", "Pros": "There are only a handful of good things about working at McDonald's and they are:- Free Food- Opportunity for Advancement- Some good laughable moments", "Cons": "There are a million of bad things about working at McDonalds, but just to name a few:- Angry Customers, daily... possibly hourly.- Managers who talk behind your back, change your hours without telling you, and throw food at you when you try to defend yourself- District Managers who act like they are billionaires and basically spit on you."}, "5": {"Date": " Oct 4, 2016", "Summary": "\"I hated every minute of it\"", "Pros": "Great people to work withEasy to move up", "Cons": "Horrible management and upper management"}, "6": {"Date": " Oct 5, 2016", "Summary": "\"No\"", "Pros": "Never got the chance to encounter a pro", "Cons": "Everything about working here is a con"}, "7": {"Date": " Sep 14, 2016", "Summary": "\"This company suckkkk\"", "Pros": "50% discount.Sometime you may qualify for a free promo,it rarely happen", "Cons": "manager are rude to employees,pay suck"}, "8": {"Date": " Aug 29, 2016", "Summary": "\"hours has been cut, need something else to pick up the slack\"", "Pros": "I'm a people person, and I love working in a busy environment", "Cons": "When business is very slow it seems like u are at work all day."}, "9": {"Date": " Aug 29, 2016", "Summary": "\"swing manager\"", "Pros": "Great opportunity within the company", "Cons": "Language barriers, sometimes it's hard to communicate to employees as well as customers"}}