{"0": {"Date": " Jul 6, 2016", "Summary": "\"Oh McDonalds\"", "Pros": "Lots of great opportunities to meet new people and wear a smile all day. I like the fact that flipping fries makes me happy.", "Cons": "Sore feet, angry customers, management has a 9th grade education. I should have finished gaining my high school education."}, "1": {"Date": " Jul 6, 2016", "Summary": "\"Cashier\"", "Pros": "Good food good customers meet ripple all the time good hours good everything I guess just wasting time right not", "Cons": "Low pay not clean fake food minimum wage no growth in the company that is all I have to say about it"}, "2": {"Date": " Jun 15, 2016", "Summary": "\"Worst ever\"", "Pros": "Avoid ghetto locations...team members were a pleasure to be around. Absolutely loved the workers. Manafment sucked", "Cons": "Don't do it...just don't do it. I couldn't even work a year without going crazy. Pay raises are a joke"}, "3": {"Date": " May 31, 2016", "Summary": "\"Director\"", "Pros": "Great place to work. Friendly people.", "Cons": "Commute. Takes a long time to get things done."}, "4": {"Date": " May 31, 2016", "Summary": "\"good first job\"", "Pros": "flexible scheduling, fun work atmosphere", "Cons": "boring work, low pay, barely ever get a raise"}, "5": {"Date": " Jun 14, 2016", "Summary": "\"Cashier\"", "Pros": "Good place to begin with no experience, Also has a lot of room for personal growth since you see and deal with all types of people", "Cons": "Sometimes can get packed with people. Also management can get get a little lackluster at times."}, "6": {"Date": " Jun 15, 2016", "Summary": "\"cashier\"", "Pros": "great company to work for the atmosphere is great the shifts are good if you are a hard worker and the people that work with you are good", "Cons": "not enough pay for what you do and the people are very rude to you from time to time. also you get micromanaged depending on what position you hold"}, "7": {"Date": " May 31, 2016", "Summary": "\"manager\"", "Pros": "I liked beinging able to help people with there orders", "Cons": "My main con is that I miss working there I loved bringing a manager"}, "8": {"Date": " Jul 5, 2016", "Summary": "\"Pay\"", "Pros": "Company needs to take care of ALL EMPLOYEES", "Cons": "Crappy pay for hard work"}, "9": {"Date": " Jun 14, 2016", "Summary": "\"Not worth it\"", "Pros": "You take on more responsibility, if that is pleasurable", "Cons": "Very stressful for the pay rate"}}