{"0": {"Date": " Oct 16, 2016", "Summary": "\"It doesn't suck.\"", "Pros": "Good first job for young kids. You get to learn to deal with idiots and people that are almost impossible to understand. You also learn what its like to work. Plenty of breaks.", "Cons": "Employee meals only for 4+ hour shifts. Not that many hours for part time. Closing is a pain in the everywhere."}, "1": {"Date": " Oct 16, 2016", "Summary": "\"swing manager\"", "Pros": "best place to be a very good customer representative server.nice place to work with incredible people to share", "Cons": "the salary always was a concern with all the benefits that a company can provideisuess about the tools and machinery very old and never updated"}, "2": {"Date": " Oct 30, 2016", "Summary": "\"Crew\"", "Pros": "Normal job, good benefits, good work", "Cons": "Not a great place to make a career"}, "3": {"Date": " Oct 31, 2016", "Summary": "\"Crew Chief\"", "Pros": "Co workersFast paced environment", "Cons": "Poor treatment of workershard hours"}, "4": {"Date": " Oct 31, 2016", "Summary": "\"After High School job\"", "Pros": "McDonalds had a very fun atmosphere. Most of the employees are very young, immature, and fun to be around. It's not a job you have to take serious at all. Nobody really expects much out of you.", "Cons": "You don't make any money. If you work on the grill or fryer, you are gonna be sweaty and gross. Your coworkers will not take their job serious, and then there is that one manager that takes their job way too serious and does more harm than good. People would constantly quit."}, "5": {"Date": " Oct 30, 2016", "Summary": "\"Cashier\"", "Pros": "my coworkers were for the most part very nice. Most of them were reasonably normal. And it was actually a very clean environment.", "Cons": "Literally everything else. But I have to use sixteen more words. Management was sexist and creepy and generally the invironment is stressful and chaotic."}, "6": {"Date": " Oct 15, 2016", "Summary": "\"Great training process Overall good company\"", "Pros": "Discounted or free meals,great training,flexible schedule, if you have a good Gm everything runs smoothly and upper management is always willing to help", "Cons": "Young kids coming in and out. Ask if you can work longer and get mad if you get even a second of overtime"}, "7": {"Date": " Oct 29, 2016", "Summary": "\"Not lovin' it\"", "Pros": "Good hours and a lot of overtime", "Cons": "Managment does not know how to discipline misbehavior of the crew."}, "8": {"Date": " Nov 18, 2016", "Summary": "\"Ageism at its best\"", "Pros": "Not much anymore. Keeping promotions to a minimum and workloads increasing. Moral is low yet management does not care and unwilling to change", "Cons": "Used to be a great company to work for. If you are under 30 you are valued. Over 30 good luck! No one willing to take risks."}, "9": {"Date": " Nov 19, 2016", "Summary": "\"meh\"", "Pros": "free food, get to meet people, put smiles on peoples faces", "Cons": "not clean, fattening food, not good pay for hours"}}