{"0": {"Date": " Feb 19, 2016", "Summary": "\"General manager\"", "Pros": "Flexibility, make your own schedule, decent pay, ability to move up to higher positions. Could be .pretty active in development", "Cons": "Restrictions on decision making, doesn't target the demographic that are more suited to our company. That hurts us."}, "1": {"Date": " Feb 19, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Great staff, very good hours and the environment is good. If you like to work fast food, then Mcdonalds is the place to be.", "Cons": "Hours lost in winter. Not enough promotions opportunities. Management might just overlook all your efforts."}, "2": {"Date": " Feb 19, 2016", "Summary": "\"Cashier\"", "Pros": "Free food, coworkers were pretty good. It was better than nothing especially for someone who really wants a job that doesn't require too much time commitment or qualification.", "Cons": "Pay was not very good, if you work in the drive thru the quality of your equipment can make a huge difference. If something is supposed to be fixed it is always going to be your fault that it wasn't fixed yesterday, at least according to many customers."}, "3": {"Date": " Feb 4, 2016", "Summary": "\"Great\"", "Pros": "I love working there and working with such amazing people.", "Cons": "Pay is low, but price may increase."}, "4": {"Date": " Feb 5, 2016", "Summary": "\"love working for mcdonalds\"", "Pros": "You meet new people in this company", "Cons": "None at all no bad comment"}, "5": {"Date": " Feb 4, 2016", "Summary": "\"McDonalds crew member\"", "Pros": "Great fist job to gain experience", "Cons": "hard to make a living off salary"}, "6": {"Date": " Feb 4, 2016", "Summary": "\"Eh..\"", "Pros": "This job has:Flexible hoursEasy JobOvertime", "Cons": "Unfortunately there are:Low wagesShort StaffedFavoritism"}, "7": {"Date": " Feb 18, 2016", "Summary": "\"It was fun exiting and very friendly\"", "Pros": "About the food and the speed of the customers and the amount of mistakes in a day.", "Cons": "There are always new employees and allot have attitudes. And keeping up the pace"}, "8": {"Date": " Feb 18, 2016", "Summary": "\"It was an okay experience, one really good thing was that most of my friends worked with me\"", "Pros": "Free food, and the fact that at my job you were able to pick your hours for the most part and they worked with you", "Cons": "Rude customers, and I hated the fact that if Someone accidently put a piece of lettuce on a sandwich that said no lettuce we had to throw away the food and make another one! I hated wasting food"}, "9": {"Date": " Feb 18, 2016", "Summary": "\"Company Review\"", "Pros": "- flexible scheduling- Good standards/company culture", "Cons": "- Customers are irrational- Management may request overtime without any warning"}}