{"0": {"Date": " Jan 16, 2018", "Summary": "\"Crew\"", "Pros": "Good team work and show that you love working for your company not just working for a check", "Cons": "Management not on the same page as the employee"}, "1": {"Date": " Jan 29, 2018", "Summary": "\"Cashier\"", "Pros": "Flex ScheduleGood Starting Point for Beginning workers", "Cons": "Customer's based on area of store"}, "2": {"Date": " Jan 29, 2018", "Summary": "\"Not a job you should keep long term\"", "Pros": "Flexible hours, most people here are student working part time so they are very flexible.", "Cons": "this job will not sustain if you have a family to raise."}, "3": {"Date": " Jan 29, 2018", "Summary": "\"mcdonalds\"", "Pros": "Free food, , good coworkers, flexible hours", "Cons": "Awful customers,dumb employees, pay sucks"}, "4": {"Date": " Jan 14, 2018", "Summary": "\"Can't reach 10$ an hour\"", "Pros": "None there are no pros about working at McDonald's besides if your smart you'll do more of other people's work for them because you can't stand un tidy people.", "Cons": "Baby sitting uneducated imature crew who don't show up for shifts but you can't fire them because you need them. Then end up doing a 3 person job every shift for 9.50 an hour"}, "5": {"Date": " Feb 19, 2018", "Summary": "\"Worst Place\"", "Pros": "Help you get experienceEasy to get", "Cons": "Managers really don't care if you're sick or notSometimes you don't get paid correctly"}, "6": {"Date": " Feb 19, 2018", "Summary": "\"Very unprofessional\"", "Pros": "You get 1 free meal during your shift.", "Cons": "Unprofessional, greedy, and unhealthy. They will try anything they can to get out of paying you for hours you work. In the last pay period, I worked 9 days and only got paid for 8. When I asked for confirmation that the problem had been rectified, my manager jumped down my throat, insulted me, and called me a liar when I told him I did not in fact mean to make him look stupid."}, "7": {"Date": " Jan 29, 2018", "Summary": "\"Poor Management\"", "Pros": "- Free shift meals and half off food when not working there.- Can call out anytime you need to as long as you don't do it last minute.- Relaxed environment.", "Cons": "- Very shady practices, some of which are health concerns.- Depending on location, pay is not equal to the amount of stress caused.- Depending on location, can be very understaffed."}, "8": {"Date": " Jan 29, 2018", "Summary": "\"Poorly Managed\"", "Pros": "Staff get along well. Hours aren't bad. Easy job to learn.", "Cons": "Management is suffering. Theres no respect towards staff and management could stand to take some courses in proper communication and team building."}, "9": {"Date": " Jan 30, 2018", "Summary": "\"Not great\"", "Pros": "Free burgers are good to eat.", "Cons": "McDonalds is not that great"}}