{"0": {"Date": " Jan 19, 2016", "Summary": "\"Human Resources Manager\"", "Pros": "Good flexibility for a working mom.", "Cons": "Business uncertainty leading to lots of restructuring and layoffs."}, "1": {"Date": " Jan 19, 2016", "Summary": "\"Pay was not good, too many hours,\"", "Pros": "It was overall a very simple and easy job that anyone can do. Just don't plan on making it a career choice.", "Cons": "Rude staff, fake people, selfish workers, made fun of customers behind their backs, workers didn't have respect for management and even called the owner greedy."}, "2": {"Date": " Jan 18, 2016", "Summary": "\"bonuses\"", "Pros": "you get amazing bonuses for work as an employee of mcdonalds", "Cons": "you get no kind of respect in the work place as a crew member."}, "3": {"Date": " Jan 18, 2016", "Summary": "\"Cashier\"", "Pros": "No really any pros at all aleast I can't think of one.", "Cons": "Low pay and not any good working hours for a hectic job"}, "4": {"Date": " Jan 18, 2016", "Summary": "\"Don't\"", "Pros": "Regular customers seem to be mostly friendly", "Cons": "Awful treatment by customers and advisers alike,"}, "5": {"Date": " Jan 17, 2016", "Summary": "\"It's a pretty easy job.\"", "Pros": "It's easy to do and not really anything wrong with it so I'm fine I eat here every day and I'm really fat", "Cons": "There is nothing wrong with the job other than the factThat the actual restraint is gross but I wat"}, "6": {"Date": " Jan 17, 2016", "Summary": "\"crew trainer\"", "Pros": "Its a friendly environment. And the workers make the job fun.", "Cons": "The employee's dont like to work. And text on there phones for there whole shift."}, "7": {"Date": " Jan 17, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Employees are able to receive flexible hours.", "Cons": "The job is unorganized and unprofessional."}, "8": {"Date": " Jan 18, 2016", "Summary": "\"Cashier\"", "Pros": "Positive Environment, flexible hours, room for promotions", "Cons": "High employee turnover rate, challenging"}, "9": {"Date": " Jan 3, 2016", "Summary": "\"relazing\"", "Pros": "its not a stressful job at all", "Cons": "have to deal with a lot of mean customers"}}