{"0": {"Date": " Mar 6, 2016", "Summary": "\"grill and stock\"", "Pros": "Flexible hours meet nice people", "Cons": "I need more hours than what I'm getting"}, "1": {"Date": " Mar 10, 2016", "Summary": "\"Good Place\"", "Pros": "Occasional food, good team, good growth (if you want it)", "Cons": "Not a fan of the uniform"}, "2": {"Date": " Mar 10, 2016", "Summary": "\"It's a great\"", "Pros": "It's amazing people to work with m. Yum my food lol you meet a lot of people's don't all it very nice place to be.", "Cons": "Nothing at all. Very amazing place to be. If you don't work at at McDonald's then I feel sorry for you"}, "3": {"Date": " Mar 10, 2016", "Summary": "\"Overall I liked working there\"", "Pros": "I guess it depends where you work, but we created a family atmosphere.", "Cons": "Extremely fast paced at timesStressful customers"}, "4": {"Date": " Mar 10, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Free break food was the best, interacting with customers were cool too", "Cons": "Coworkers mad life so hard. They were rude to customers and didnt care"}, "5": {"Date": " Mar 10, 2016", "Summary": "\"Good Opportunities Await!\"", "Pros": "This job is a good, entry-level position. If you want to learn at a fast pace and get some experience in hands on, customer-oriented service, then this is the right pick for you. You will be required to multi-task, anticipate the customer's needs, and always, always, offer service with a smile. Must be quick, correct, and congenial. Check your feelings at the door, and keep it professional.", "Cons": "This job is fast paced, and high stress. Yes, you learn alot of new things, and yes, you meet alot of new people. BUT. If you cannot handle the customers when they are not being polite and you are, if you cannot handle doing your job, plus some extra stuff, and if you cannot handle needing to stay on your toes and get it done Fast + Right, then this is not the job for you."}, "6": {"Date": " Mar 10, 2016", "Summary": "\"Swing Manager\"", "Pros": "they have great benefits for employees", "Cons": "To move up in the company is getting harder because of the restructuring of the business"}, "7": {"Date": " Apr 13, 2016", "Summary": "\"Not loving it\"", "Pros": "Decent compensation and benefits package", "Cons": "Everything that was great about McD as it relates to how people are treated, culture and values is non existent."}, "8": {"Date": " Mar 9, 2016", "Summary": "\"Department Manager\"", "Pros": "Pay is nice, flexible hours", "Cons": "Can be a pain being salary."}, "9": {"Date": " Mar 9, 2016", "Summary": "\"Smile\"", "Pros": "Flexible scheduling for current students", "Cons": "Lower pay and hard to get increase"}}