{"0": {"Date": " Apr 16, 2016", "Summary": "\"Its ok if you cant get any other job\"", "Pros": "Very flexible and can work around your schedule especially if you are in school.", "Cons": "Customers look down on you and make can be very rude."}, "1": {"Date": " Mar 31, 2016", "Summary": "\"It was a decent job\"", "Pros": "Much free times than companies", "Cons": "Salaries were fairly low and it was not a stable job"}, "2": {"Date": " May 6, 2016", "Summary": "\"Terrible\"", "Pros": "Free meal once per shift, though of course the food is pretty terrible", "Cons": "-another employee stole money from my personal wallet-managers did not know how to treat new employees-I did not get trained on anything besides dishes, burgers, and front counter"}, "3": {"Date": " May 6, 2016", "Summary": "\"Soul Crushing\"", "Pros": "Co-workers were fun to be around and were friendly.", "Cons": "Rude customers, Horrible working hours, Low pay, No benefits"}, "4": {"Date": " Apr 15, 2016", "Summary": "\"I hated it\"", "Pros": "Once you get the hang of all of the tasks you have to do, it is pretty easy to grasp", "Cons": "management suckseveryone is rude(employees&customers)doesn't pay well"}, "5": {"Date": " Apr 15, 2016", "Summary": "\"Low Pay High Volume\"", "Pros": "free meals... thats about it", "Cons": "coming from a franchise store. was way better at my old store which was corporate but due to moving had only franchise to pick from."}, "6": {"Date": " Apr 16, 2016", "Summary": "\"Crew\"", "Pros": "a great place to learn and grow", "Cons": "the staff and co workers can be really unprofessional"}, "7": {"Date": " Apr 16, 2016", "Summary": "\"Good\"", "Pros": "Fairly clean food was prepared nice", "Cons": "Bugs were on the floor"}, "8": {"Date": " Apr 1, 2016", "Summary": "\"Store manger\"", "Pros": "It's good to work for them", "Cons": "I don't like the 24 hours store open"}, "9": {"Date": " Apr 14, 2016", "Summary": "\"Crew Member\"", "Pros": "Learn how to work in fast paste environment, learn customer service skill. Good for a first time job.", "Cons": "The pay isn't that good, work hours are irregular, sometimes stressful"}}