{"0": {"Date": " May 14, 2017", "Summary": "\"crew member\"", "Pros": "friendly environment, great people to get to know and work with", "Cons": "had to wear a bright red shirt"}, "1": {"Date": " Jun 19, 2017", "Summary": "\"It's not worth it.\"", "Pros": "Nothing. Even the discounts are horrible.", "Cons": "The managers are horrible. They cant keep track of breaks and they really enjoy giving you about an hour or two of work after the time that you're supposed to get out, a lot of the customers are horrible people, the franchise owner in my town isnt the friendliest person(he is only friendly to the customers of course), the workers are really immature, the discounts aren't even real discounts, they give you 8 hour shifts with only a day off a week, and minimum wage isn't worth all work and time you put in to the restaurant. You only get one day off a week."}, "2": {"Date": " May 29, 2017", "Summary": "\"Cashier\"", "Pros": "They gave us a free meal and soft drink per shift, not much else, flexible schedules, decent pay, slow at times", "Cons": "Terrible manager, poor advancement, fast pace, the manager was honestly incompetent, hated a lot about working there"}, "3": {"Date": " May 30, 2017", "Summary": "\"MANAGEMENT SUCKS\"", "Pros": "Free food and drinks", "Cons": "Didn't work with your schedule"}, "4": {"Date": " May 14, 2017", "Summary": "\"High school student\"", "Pros": "Easily promoted as long as you're willing to learnHours were very flexibleKind of free meals during shift", "Cons": "Managers don't really like to do their jobsMy supervisor was a horrible person and corporate did nothing to address employee or customer complaints"}, "5": {"Date": " May 15, 2017", "Summary": "\"Crew Member\"", "Pros": "I worked with many different people and there were a variety of customers. Use to working under fast-paced and stressful conditions. It's where I discovered how important teamwork is.", "Cons": "Lack of discipline or motivation is easily contagious and working overnights resulted in no recognition."}, "6": {"Date": " May 15, 2017", "Summary": "\"Shift Manager\"", "Pros": "You gain invaluable management experience, learning to delegate and put crew members in positions. The hours go by quickly because it's a lot of work and responsibility.", "Cons": "It is a lot of hard work and stress at times. Sometimes you will end up staying later than expected due to unforeseeable circumstances."}, "7": {"Date": " May 28, 2017", "Summary": "\"Cashier\"", "Pros": "Friendly, fast paced work environment. Well informed management.", "Cons": "Unreliable hours of work from week to week."}, "8": {"Date": " May 28, 2017", "Summary": "\"ok\"", "Pros": "flexible schedule, convenient for high school student", "Cons": "low pay, some co-workers were hard to get along with"}, "9": {"Date": " May 13, 2017", "Summary": "\"Employment\"", "Pros": "All aspects of the job", "Cons": "To me there are no down sides"}}