{"0": {"Date": " May 4, 2016", "Summary": "\"Store manager\"", "Pros": "advancenent opportunities are good. The trading is also top notch. If you are in a good store the people that you work with is a positive.", "Cons": "Long hours, sometimes 60+ hours a week.The job is also very high stress. Sometimes expectations are very high and difficult to achieve."}, "1": {"Date": " May 6, 2016", "Summary": "\"HR\"", "Pros": "Friendly and fast pace environment.", "Cons": "No cons at this point."}, "2": {"Date": " May 3, 2016", "Summary": "\"Cook\"", "Pros": "I'm a very competitive, team leader, and motatived to can make McDonald's a clean and safe happy environment.", "Cons": "I think McDonald's could use some friendly employees."}, "3": {"Date": " May 6, 2016", "Summary": "\"Good\"", "Pros": "Flexible schedule, friendly co workers", "Cons": "Have to wake up early"}, "4": {"Date": " May 7, 2016", "Summary": "\"good for a part-time job\"", "Pros": "Flexible scheduling, at my McDonald's you just put a note in for the scheduling manager if you needed a day off or wanted to change your availability and he would switch it for you, it was really easy.50% discounts on food or free if you come in on a day off or agree to stay later/come in earlier than your original shiftHad fun at times with my coworkers and managers, night shift in my experience was more relaxed because the GM wasn't there, but also could be more chaotic because of that too", "Cons": "Frustrating at times when you're working with coworkers who don't know what they're doing and you have to pick up their slackCustomers rude and unnecessarily demanding at timesif the kitchen crew is slow or making things wrong and you are in a service position then customers will blame and get mad at youSuper busy at peak business times which could be stressful and tiring"}, "5": {"Date": " May 20, 2016", "Summary": "\"Hard work\"", "Pros": "As an employee and you work hard you do get recognized for the hard work that you do sometimes", "Cons": "The the bad thing is we don't get that much races because of the rent that we have to pay is so high"}, "6": {"Date": " May 5, 2016", "Summary": "\"Starter job\"", "Pros": "McDonalds is a great work environment and starter job for young teens trying to branch into adult life.", "Cons": "Skin will get oily and burns and cuts can occur. As well as bad hours sometimes"}, "7": {"Date": " May 6, 2016", "Summary": "\"Great Way to Learn about how to handle difficult hungry customers\"", "Pros": "Good to gain money and experience while at school.", "Cons": "Some managers are not good at managing people.Exhausting Mentally"}, "8": {"Date": " Jun 10, 2016", "Summary": "\"Crew\"", "Pros": "The pros of the job are flexible schedules.", "Cons": "Downside is limited yearly income. The workload is that of two or more people. Management and the organization unprofessional."}, "9": {"Date": " May 5, 2016", "Summary": "\"Meh.\"", "Pros": "Flexible ScheduleLots of overtime opportunitiesClimb the corporate ladder", "Cons": "Bratty and rebellious teensLow pay ($1 above min. wage for management)Too much overtime (I was doing 48+ hrs a week)Most of the time understaffed"}}