{"0": {"Date": " Jun 28, 2016", "Summary": "\"Cashie\"", "Pros": "McDonalds was my 1st job during my 2nd year in High School. I learned customer service skills, and how to work in a team environment.", "Cons": "Low Pay, and sometimes dealing with rude customers."}, "1": {"Date": " Jun 28, 2016", "Summary": "\"Crazy workplace\"", "Pros": "Discounts on food 30 min breaks sent home early sometimes", "Cons": "Understaffed rude mangers rude coworkers"}, "2": {"Date": " Jul 20, 2016", "Summary": "\"Crew trainer\"", "Pros": "They had free employee meals co workers were easy to work with some management were cool", "Cons": "They were always wanting you to do more than they pay you"}, "3": {"Date": " Jun 28, 2016", "Summary": "\"Being a front end cashier means doing everything\"", "Pros": "Cool crew membersInteresting to meet new people at the counterFree foodLearning how to make cappuccinos and Mcafe items", "Cons": "Lots of task to do at one time.Staying over after your shift has ended.Having to do stuff the shift before you didn't do"}, "4": {"Date": " Jun 28, 2016", "Summary": "\"Corporate Policy Problem\"", "Pros": "Flexible hours, easy to ask off work, opportunity for promotion", "Cons": "Doesn't give merit raises only length of employment ones, terrible employee retention, chronic understaffing due to low pay and frequent call outs."}, "5": {"Date": " Jun 28, 2016", "Summary": "\"McDonalds Crew Trainer\"", "Pros": "Flexible Schedule, okay pay, and a good place to start getting experience", "Cons": "inconsistent management makes it hard to keep motivated, little benefits, a lot of favoritism,"}, "6": {"Date": " Jun 13, 2016", "Summary": "\"Great Training\"", "Pros": "Good training, good managers, Flexible hours, they were willing to help you move up in the company if you wanted it", "Cons": "Coworkers were difficult to work with at times"}, "7": {"Date": " Jun 13, 2016", "Summary": "\"Mcdonalds cashier\"", "Pros": "its an easy job, you just have to learn about the cashier system. drink making is very straight forward.", "Cons": "drive through requires quicker pace"}, "8": {"Date": " Jun 26, 2016", "Summary": "\"McDonald's is ok/Booty\"", "Pros": "You get long hrs... Pretty much have freedom to talk or play if you wanna... Really easy job", "Cons": "Hot Hot Hot!!! Smells of food all dayConstant beeping all dayAlot of childish workers including management"}, "9": {"Date": " Jun 27, 2016", "Summary": "\"Advancement??\"", "Pros": "It was a great beginner job, most of the other employees were great to be around, customers get to know you and are friendly, flexible while continuing college.", "Cons": "No room for advancement if they know you have potential. For example, they knew I was going to college, so they wouldn't \"waste\" their time on giving me a raise or promotion."}}