{"0": {"Date": " Jan 17, 2016", "Summary": "\"My experience was great\"", "Pros": "Good companion ship and good teamwork also it has good customer service,challenging, diverse, and problem solving, good with people, children play house always kept together, good manager", "Cons": "Demanding and slow sometimes, cold, bad attitudes sometimes, bad, Bathrooms smell, to overbearing, crazy, no alarm, and too messy, dosent clean messes, and never warms food"}, "1": {"Date": " Jan 17, 2016", "Summary": "\"Satisfied\"", "Pros": "This was an amazing experience i wish that i can continue working her as of today. It was as i said before , amazing", "Cons": "there was honestly nothing bad about working her it was very pleasant and i would love to work here again"}, "2": {"Date": " Feb 2, 2016", "Summary": "\"cook\"", "Pros": "a great company to work for and the benefits were excellent as well. I feel that the company has a great future ahead of itself .", "Cons": "Hard, long hours and the pay isn't that good. Usually have to work extremely late and most of the time on the weekends as well. I wouldn't recommend this position to anyone else."}, "3": {"Date": " Jan 18, 2016", "Summary": "\"Manager\"", "Pros": "Food was free for management", "Cons": "Pay was lower than other restaurants"}, "4": {"Date": " Jan 18, 2016", "Summary": "\"Hey give me a job now\"", "Pros": "I can cook I'm fast and I can count so just in case we need someone else on the registers I'm there", "Cons": "I'm impatient and I have bi polar issues so I can't dbz dndn didn a sjbdhxjd end S bend n j"}, "5": {"Date": " Jan 31, 2016", "Summary": "\"Not recommended\"", "Pros": "being around customers and making them happy", "Cons": "management is not organized and treat their employees like dirt"}, "6": {"Date": " Jan 16, 2016", "Summary": "\"Really great\"", "Pros": "Good food and shakes. Very tasty and very cheap. I love this place suck nice people too", "Cons": "There are none. It pays well and is amazing. I love people who work there with tongue piercings and stuff."}, "7": {"Date": " Jan 17, 2016", "Summary": "\"Good to get your feet of the ground.\"", "Pros": "Clean working conditions and friendly employees, staff and management, especially at the location that I worked at. The customers were also quite kind.", "Cons": "Sometimes gets busy because we get so much business but this also means that we were making considerable profit. Mixed bag of goods."}, "8": {"Date": " Jan 31, 2016", "Summary": "\"Cashier\"", "Pros": "Flexible and good management, able to advance", "Cons": "Low pay, high school workers, short on staff"}, "9": {"Date": " Jan 16, 2016", "Summary": "\"Good for college\"", "Pros": "Good for high school or college students looking to work part time to have a little spending money on the side", "Cons": "Customers are terrible and are not always right. People get so angry about their food that its almost not worth the minimum wage"}}