{"0": {"Date": " Sep 15, 2017", "Summary": "\"Crew cook\"", "Pros": "I love to cook and clean", "Cons": "Some times hours get cut"}, "1": {"Date": " Oct 20, 2017", "Summary": "\"Crew\"", "Pros": "The customers are go to you as long as you greet them and make sure there food is right", "Cons": "does pay enough and they need to treat the employee with more respect"}, "2": {"Date": " Sep 29, 2017", "Summary": "\"crew\"", "Pros": "people that you work with are fun", "Cons": "everything else about working there"}, "3": {"Date": " Sep 14, 2017", "Summary": "\"Area Management\"", "Pros": "I enjoyed meeting new people. I like learning new experiences and interacting with people. I also like training new co workers.", "Cons": "The big downside is trying to please the customers when they get rude with me. When someone calls in sick and can't get a replacement soon enough. You are stuck short handed badly. Trying to be able to keep up with the speed and quality."}, "4": {"Date": " Sep 15, 2017", "Summary": "\"Loved my job.\"", "Pros": "You advance very quickly if you show up to work everyday. It's a very fast paced environment so you gotta keep up the pace.", "Cons": "I was a department head manager and I got paid very low for all the qualifications I had and all the extra jobs I did. I never got compensated for staying late and working from home."}, "5": {"Date": " Sep 28, 2017", "Summary": "\"Good first job.\"", "Pros": "When you take a lunch break you get a free burger and fries.", "Cons": "Rush hours could be confusing sometimes. When you run out of stock the wait time can become a hassle."}, "6": {"Date": " Sep 28, 2017", "Summary": "\"McDonalds Crew Trainer employee review\"", "Pros": "Got a lot of experience working in a fast paced environment. Learned customer service skills, learned to deal with stress better.", "Cons": "Never left on time."}, "7": {"Date": " Sep 28, 2017", "Summary": "\"Interesting\"", "Pros": "Flexible and worked around my schedule.", "Cons": "Management was not consistent or understanding"}, "8": {"Date": " Sep 28, 2017", "Summary": "\"eh\"", "Pros": "easy job and fast money", "Cons": "would take advantage of workers bcs they barely had employees"}, "9": {"Date": " Oct 20, 2017", "Summary": "\"Awful\"", "Pros": "I got free food and that was nice.", "Cons": "My paychecks always bounced which made working pointless."}}