{"0": {"Date": " Jan 13, 2016", "Summary": "\"Good\"", "Pros": "A wonderful serenity has taken possession of my entire soul, like these sweet mornings of spring which I enjoy with my whole heart. I am alone, and feel the charm of existence in this spot, which was created for the bliss of souls like mine.", "Cons": "I am so happy, my dear friend, so absorbed in the exquisite sense of mere tranquil existence, that I neglect my talents. I should be incapable of drawing a single stroke at the present moment; and yet I feel that I never was a greater artist than now."}, "1": {"Date": " Jan 14, 2016", "Summary": "\"n/a\"", "Pros": "Meet new people an learn new things. Mcdonalds could help you with customer service skills", "Cons": "Some people can try ang bring you out your charater team member or customer"}, "2": {"Date": " Jan 14, 2016", "Summary": "\"adawd\"", "Pros": "i enjoyed working with my coworkers", "Cons": "I didnt like some of the customers"}, "3": {"Date": " Jan 14, 2016", "Summary": "\"Generally a goid company to work for but pay raises have been less frequent over the past few years.\"", "Pros": "Teamwork emphasizedLearn lots of management conceptsSend management to classes to strengthen their knowledge of becoming a good leaderLearn how to control variables in Profit & Loss statementsCan be promoted pretty easily with hard work", "Cons": "Working with young kidsGenerally thought down upon because you' re only a McDonald' s managerContinually not compensated with much of a compression raise when minimum wage goes up"}, "4": {"Date": " Jan 14, 2016", "Summary": "\"Good Place\"", "Pros": "Free food. I really like cheeseburgers.", "Cons": "a little bit boring, but nobody ever got hurt."}, "5": {"Date": " Jan 15, 2016", "Summary": "\"It was ok\"", "Pros": "Great hours good benefits if you are higher up. Good place to start out at", "Cons": "Bad manager she is horrible has no people skills. Ask that you do more than your job title"}, "6": {"Date": " Dec 31, 2015", "Summary": "\"Corporation\"", "Pros": "Flexible hours and great pay", "Cons": "Need to focus on crew happiness"}, "7": {"Date": " Jan 14, 2016", "Summary": "\"Mcdonalds\"", "Pros": "Only reason if you cant get a job", "Cons": "They pay less and expect to much"}, "8": {"Date": " Jan 14, 2016", "Summary": "\"It was a job\"", "Pros": "My customers became like my family", "Cons": "Boss had no idea how to talk to any one favouritism like crazy"}, "9": {"Date": " Jan 15, 2016", "Summary": "\"Shift Manager\"", "Pros": "Satisfying the Customers and employees, New products and addition, Raises", "Cons": "Poor management, Doesn't communicate with changes in the store, Gossiping"}}