{"0": {"Date": " Jan 15, 2016", "Summary": "\"Cashier\"", "Pros": "The job was enough for me to make some sort of income while living with parents, liked it there and the staff treated me good :)", "Cons": "A challenge I encountered a lot were rude customers for the most part, but other than that there's not much to complain about"}, "1": {"Date": " Jan 16, 2016", "Summary": "\"crew customer service\"", "Pros": "Meet people multi task very busy makes time go by quickly down to earth people would very much like to be part of the best fast food business", "Cons": "Down sides grease oil heat rude and nasty customers people that just cannot be pleased"}, "2": {"Date": " Jan 16, 2016", "Summary": "\"Good job\"", "Pros": "Very good job pays well for not working a whole bunch and you get very good working skills from it", "Cons": "Not really into getting my hands really dirty and I don't really like working cash register and getting those customers that are rude"}, "3": {"Date": " Jan 29, 2016", "Summary": "\"Whatever\"", "Pros": "I made money during high school.", "Cons": "Customers were rude and threw tantrums at me if someone got their order wrong."}, "4": {"Date": " Jan 29, 2016", "Summary": "\"Tahesha's title\"", "Pros": "To gain more customer service and order taking skills.", "Cons": "Not enough hours and not enough different positions."}, "5": {"Date": " Jan 29, 2016", "Summary": "\"Good\"", "Pros": "This job was good. Basic Assistant stuff. Management can be annoying sometimes. But overall it was all okay.. I guess", "Cons": "Management was some times a bit annoying, but it was all okay... I guess. Management could be weird sometimes"}, "6": {"Date": " Jan 29, 2016", "Summary": "\"I'm loving it\"", "Pros": "A very Nice place to work", "Cons": "There is Not enough money"}, "7": {"Date": " Jan 30, 2016", "Summary": "\"Valuable management training\"", "Pros": "The training and experience gained as an assistant/General manager can be used to land better paying jobs if you sell the experience properly.", "Cons": "Typically low pay, and unaffordable health insurance when it's offered at all. Assistant managers are usually hourly, but are expected to always be on call and available to handle issues as if they were salaried."}, "8": {"Date": " Jan 12, 2016", "Summary": "\"Tough outlook, good environment\"", "Pros": "Good benefits, favorite brand of many", "Cons": "Inconsistent policies dependent on manager or department, red tape"}, "9": {"Date": " Jan 14, 2016", "Summary": "\"I had a really good time working at McDonald's.\"", "Pros": "Things were serious but fun at the same time. Everybody worked as a team, from the GM all the way down to the crew.", "Cons": "The money was not very good and the hours were bad. Customers weren't always the nicest people in the world either."}}