{"0": {"Date": " Jun 5, 2017", "Summary": "\"Would Never Work There Again\"", "Pros": "Always something to do.Never boring.", "Cons": "Hectic work hours.Not at all willing to work with student schedules.Frequently late paycheck."}, "1": {"Date": " Jun 6, 2017", "Summary": "\"Front end cashier day shift\"", "Pros": "Good friend good food good hours", "Cons": "Pay rate is the worst"}, "2": {"Date": " May 15, 2017", "Summary": "\"Hard worker....\"", "Pros": "Becoming a manager... starting out", "Cons": "Always short handed..... hiring young people"}, "3": {"Date": " Apr 30, 2017", "Summary": "\"Department Head\"", "Pros": "The flexibility is wonderful, there's an abundant amount of opportunities for a better future including free college credits through their management program.", "Cons": "Consistent change can make it a stressful work inviroment. Language barriers can be difficult(there's a lot of only Spanish speaking individuals within my franchise). I've also found there can be substantial amount of favoritism."}, "4": {"Date": " May 14, 2017", "Summary": "\"not a bad place really\"", "Pros": "learn how to make burgers", "Cons": "people look down on you"}, "5": {"Date": " May 14, 2017", "Summary": "\"Crew\"", "Pros": "Interesting customers provide entertainment and free sociology course.", "Cons": "Low pay, inconsistent hours allowed to work vis a vis scheduled hours, fretful corporate management"}, "6": {"Date": " Apr 29, 2017", "Summary": "\"I have experience at cleaning\"", "Pros": "I want to work here to get money and get a job because I don't have a job please let me work here", "Cons": "It is hard working here but I can do what ever the job is I can take the challenge and"}, "7": {"Date": " Apr 29, 2017", "Summary": "\"Crew Member\"", "Pros": "You make great connections with the customers, they love a friendly attitude and sharing achievements about their life as much as they love listing to yours.", "Cons": "Waking up for a shift that starts at 6 a.m."}, "8": {"Date": " Apr 29, 2017", "Summary": "\"Good benefits\"", "Pros": "You can make great connections and friendships.", "Cons": "Customer service really has to be an easy thing for you."}, "9": {"Date": " Apr 30, 2017", "Summary": "\"Honestly not that bad\"", "Pros": "Kept me busy and once the training was over you didn't need much help everything usually runs like a well oiled machine", "Cons": "Having to deal with the stigma behind working at mcdonalds"}}