{"0": {"Date": " Aug 9, 2017", "Summary": "\"Crew Member at McDonalds\"", "Pros": "Kind staff, enjoyable environment, decent starting pay", "Cons": "Tedious tasks, Customers are not often in a good mood, Too many rule changes that make the job even more tedious"}, "1": {"Date": " Aug 10, 2017", "Summary": "\"Fun, Exiciting, Fast-Paced\"", "Pros": "Flexible Schedule, good for people looking for their first job. Great teammates, great people and good working environment . Good luck", "Cons": "i can not think of a bad thing about working in this place. maybe just pay being a little bit higher"}, "2": {"Date": " Aug 23, 2017", "Summary": "\"why you should apply? one\"", "Pros": "meet new peoplemoney!get to be commutative and talk to a lot of costumers", "Cons": "co- workersrude costumers"}, "3": {"Date": " Aug 23, 2017", "Summary": "\"It was not for me.\"", "Pros": "The best reason to work here is helping people and making people smile. Another wonderful reason to work here is the fact that they have some awesome managers.", "Cons": "I did not get along with my coworkers and they didn't train me right. I wasn't happy there and only got two days a week."}, "4": {"Date": " Aug 8, 2017", "Summary": "\"Department Manager\"", "Pros": "Great benefits, flexible hours, GREAT job training that applies to many aspects of all management jobs", "Cons": "Lower Salary, Long hours, little performance review"}, "5": {"Date": " Aug 8, 2017", "Summary": "\"A Great Beginner's Job\"", "Pros": "McDonald's Provides Great Paychecks In Most Areas, Paying At Least Minimum Wage In Your State. Flexible Work Hours. Very Kind Crew/Staff. Easy Work.", "Cons": "Takes Two Weeks To Update Schedule/Work Hours. Customer's Are Angry Most Of The Time. Most Of The Time Busy And Very Hard To Keep Up."}, "6": {"Date": " Aug 8, 2017", "Summary": "\"Cashier\"", "Pros": "Liked the people and management", "Cons": "Customers could be very difficult"}, "7": {"Date": " Sep 13, 2017", "Summary": "\"Mc Donald's\"", "Pros": "Get free fooood from people", "Cons": "annoying people bosss annoying people"}, "8": {"Date": " Aug 23, 2017", "Summary": "\"Cook\"", "Pros": "Free food. Chicken McNuggets and french fries galore.", "Cons": "Pay was not enough to buy french fries galore. Customers are rude."}, "9": {"Date": " Aug 24, 2017", "Summary": "\"Crew member\"", "Pros": "Fast pace great place to start off.as a first job", "Cons": "They don't treat every one the same"}}