{"0": {"Date": " Sep 7, 2016", "Summary": "\"crew member\"", "Pros": "people are nice to be around with", "Cons": "food is bad for health"}, "1": {"Date": " Oct 13, 2016", "Summary": "\"Stupid\"", "Pros": "Nothing is positive about McDonald's", "Cons": "Rat ran across burger, still served the hamburger"}, "2": {"Date": " Oct 13, 2016", "Summary": "\"Entry Job\"", "Pros": "Easy entry job to obtain", "Cons": "Unsanitary, management wasn't the best, no training"}, "3": {"Date": " Sep 23, 2016", "Summary": "\"Shift Manager\"", "Pros": "It's a job that pays you.", "Cons": "The pay is terrible, everybody there is miserable, no room for advancement."}, "4": {"Date": " Sep 21, 2016", "Summary": "\"Cashier\"", "Pros": "Ability to gain experience in customer service and multi-tasking. Opportunities to meet new people and become a member of a team.", "Cons": "Often under-scheduled shifts which lead to slowdowns and back ups. High-turnover which leads to a lot of inexperienced employees at one time."}, "5": {"Date": " Sep 21, 2016", "Summary": "\"Cashier\"", "Pros": "Nice coworkers, nice manager, relatively easy things to do. Flexible hours and very understanding in terms of school and extracurriculars.", "Cons": "Not very good training at all, sometimes it's confusing on what you're supposed to do each day. Notification of scheduling is horrible."}, "6": {"Date": " Sep 21, 2016", "Summary": "\"Cashier\"", "Pros": "Free soda. Free food. Friend discount. I loved the cook sometimes clean I loved the cool customers that would make my life easy", "Cons": "I hate the annoying management no one really trained well overall a lot of cheap people the homeless always found there way into the place at the 24 joint easy job"}, "7": {"Date": " Sep 21, 2016", "Summary": "\"Department Manager\"", "Pros": "Good benefits, room for growth,", "Cons": "long stressful days with little or no support"}, "8": {"Date": " Sep 6, 2016", "Summary": "\"great place to be\"", "Pros": "Great TrainingBenefitsPaid time offRunning ProThey give you free food which is incredible if you like diabetes and early on set dementia .", "Cons": "There are typically no CONS. If you like to be challenged and work hard"}, "9": {"Date": " Sep 6, 2016", "Summary": "\"It was ok\"", "Pros": "It was very fun to work with my co workers. Also learned a lot about being a cashier as it was my first time.", "Cons": "A lot of noise and the rest of the day before the end of this year to the point of the best of luck."}}