{"0": {"Date": " Jun 16, 2017", "Summary": "\"Register/FOH\"", "Pros": "Great work atmosphere. Management was very helpful and reliable. I also liked the people that I worked with.", "Cons": "The pay could be more but it was an easy job so I couldn't expect too much more."}, "1": {"Date": " Jul 22, 2017", "Summary": "\"Unbiased Truthful Review - Short Version\"", "Pros": "Awesome and Hard Working Co-Workers!", "Cons": "Company doesn't care about their employees, lack of raises and raise amount is proof. If I could give a lower rating I would. People bust their backs and care about this company and they wont promote you but if they do it's a insignificant amount. Maybe a lack of communication from corporate to franchise? I couldn't get a new and better fitting uniform after 6-8 months of asking. Couldn't get a promotion after practically begging, and I deserve a management position to be honest and so do many other people I work with. \"Crew Members\" have more value than what is seen."}, "2": {"Date": " Jul 22, 2017", "Summary": "\"Constructive Feedback\"", "Pros": "Good for first-time employment experience.", "Cons": "Management performance is poor, positive reinforcement and employee recognition are virtually non-existent."}, "3": {"Date": " Jul 23, 2017", "Summary": "\"Crew Member\"", "Pros": "Using team work to accomplish tasks.", "Cons": "Using team work with uncooperative employees."}, "4": {"Date": " Jun 16, 2017", "Summary": "\"Been working on service for about 4 months...\"", "Pros": "No experience requiredEasy interviewFlexible schedulingGood job experienceYou learn to deal with the stressEasygoing work environment", "Cons": "Training is limitedManagers are often overburdened and it can be difficult to get helpStore is consistently understaffed, chronic absenteeism/no-call-no-showVery stressful during rush hoursRude Customers"}, "5": {"Date": " Jun 30, 2017", "Summary": "\"Maintenance Lead\"", "Pros": "nice co-workers, some kind managers , some what peaceful work place, not much accidents", "Cons": "not enough workers over night shifts , lack of managers helping out"}, "6": {"Date": " Jun 30, 2017", "Summary": "\"crew\"", "Pros": "dollars menu if the real mvp", "Cons": "lazy co-workers are on every shift"}, "7": {"Date": " Jul 1, 2017", "Summary": "\"Kdo\"", "Pros": "Clean envi ron ment nice place", "Cons": "Co wor kers were la zy"}, "8": {"Date": " Jun 15, 2017", "Summary": "\"Great company\"", "Pros": "Love the environment and other employees", "Cons": "Never get off at exact time"}, "9": {"Date": " Jul 21, 2017", "Summary": "\"Dysfunctional\"", "Pros": "The nicest coworkers around. Almost everyone tries really hard to help managers reach their stated objectives.", "Cons": "Management often abusive, berating workers with negative personal comments. Sometimes. Sometimes this workplace was fraught with racial tensions."}}