{"0": {"Date": " Nov 26, 2016", "Summary": "\"As you would expect\"", "Pros": "Easy work for decent pay", "Cons": "Revolving door of new people"}, "1": {"Date": " Nov 10, 2016", "Summary": "\"Cashier\"", "Pros": "They were a great employer. It was a lot of hard work, but they were a fair employer and I enjoyed working for the company.", "Cons": "It was a lot of hard work. The pay was minimum wage, but that was what the skill level required."}, "2": {"Date": " Nov 10, 2016", "Summary": "\"pretty good\"", "Pros": "they always keep you busy, and you learn how fast food is made", "Cons": "some of the employees take it for granted and get snooty"}, "3": {"Date": " Dec 16, 2016", "Summary": "\"D\"", "Pros": "Do loved the food there", "Cons": "I hated everything about it"}, "4": {"Date": " Nov 10, 2016", "Summary": "\"WacDonalds\"", "Pros": "Discount meals were great if you wanted to punish your body even more than just standing next to a deep fryer all day.", "Cons": "Poor management skills and co workers who make you uncomfortable were pretty lame and I wouldn't go back if you asked me to."}, "5": {"Date": " Nov 10, 2016", "Summary": "\"Great for teenagers\"", "Pros": "Flexible schedule, reasonable hours, definitely many opportunities to move up,management is fun to work with as long as there are enough employees working", "Cons": "Call outs galore, hard to balance school and work life"}, "6": {"Date": " Nov 10, 2016", "Summary": "\"Great company\"", "Pros": "I really enjoyed working for McDonald's. Flexible schedule and supportive employees.", "Cons": "low pay for working long"}, "7": {"Date": " Nov 25, 2016", "Summary": "\"Depends which location\"", "Pros": "fun stafflayback attitudeeasy learning curvesuper super easy", "Cons": "Awful payawful managers(typically)a lot of mind-numbing repetitiveness...                    if you are not okay with constantly repeating the same/similar phrases for your entire shift, and constantly doing the same thing, then by all means this is a great location for you."}, "8": {"Date": " Nov 9, 2016", "Summary": "\"I like to work alot.\"", "Pros": "It's good to get a night job. It has good hours to work with. It's close to my house.", "Cons": "Not much hours to work."}, "9": {"Date": " Dec 15, 2016", "Summary": "\"cashier\"", "Pros": "free food and the uniforms are free", "Cons": "rude management and the customers are not pleasant"}}