{"0": {"Date": " Aug 29, 2017", "Summary": "\"Associate\"", "Pros": "There is work to be had.", "Cons": "Training is not done well."}, "1": {"Date": " Aug 30, 2017", "Summary": "\"Great place to start!\"", "Pros": "Generally fun environment, forces you to learn to be both efficient AND produce quality work.", "Cons": "My location was perpetually understaffed and ALWAYS training new people, forcing employees with more experience into doing the jobs of 3-4 people to compensate."}, "2": {"Date": " Aug 30, 2017", "Summary": "\"crew member\"", "Pros": "it built customer service skills", "Cons": "working in this particular one there was a lot of confusion , disfunctional"}, "3": {"Date": " Aug 30, 2017", "Summary": "\"What its like working at McDonalds\"", "Pros": "Working for here is fun and most of the customers are wonderful to service. Most of your co workers are very helpful and your nervous feeling starts to go away fairly quickly. You also get unlimited free wifi which is a huge plus to you if you are on your break or lunch because you can enjoy your time on the enternet instead of just sitting there bored. So if your house/apartment searching you will definently enjoy that.", "Cons": "You will have to deal with some rude customers but the wonderful enjoyable customers will make you have a better day and smile that's for sure. You get short breaks but lunch breaks are better just make sure that you keep on your manager to know when your breaks and lunchs are or you wont one half the time. Be prepared to deal with some pretty crazy and uncomfortable situations to happen in the restaurant because that's just part of working for there but on the god side its not that often and it usually doesn't get too bad."}, "4": {"Date": " Aug 14, 2017", "Summary": "\"i want access to the rest of the site\"", "Pros": "i liked it a lot so good", "Cons": "the food was really cheap"}, "5": {"Date": " Aug 14, 2017", "Summary": "\"Great\"", "Pros": "Fun, exciting, an overall great experience", "Cons": "High expectations can cause stress to some"}, "6": {"Date": " Aug 15, 2017", "Summary": "\"Satisfactory\"", "Pros": "Very flexible schedule, great management", "Cons": "Not enough hours, no.performance reviews"}, "7": {"Date": " Sep 19, 2017", "Summary": "\"Prep\"", "Pros": "Good hours, employee discounts, 30 minute breaks", "Cons": "Nasty, Unorganized, Sloppy, Employees play too much"}, "8": {"Date": " Sep 19, 2017", "Summary": "\"Crew\"", "Pros": "Nice people to talk to.", "Cons": "Endless food that will make you gain weight. Nothing wrong with that"}, "9": {"Date": " Aug 29, 2017", "Summary": "\"Mcdonalds\"", "Pros": "Nice pays and a very nice crew", "Cons": "Horrible managers. They got away with everything and they were never organized with the schedules."}}