{"0": {"Date": " Jan 23, 2017", "Summary": "\"Not worth your time, especially for students\"", "Pros": "If you're reliable and a good worker, you will definitely get hours.", "Cons": "Always under staffed, crew members are over-worked, had one floor manager who always sexually harassed the crew members and when someone confronted her about it, she got mad and tried to make working difficult."}, "1": {"Date": " Jan 23, 2017", "Summary": "\"Cashier and Fryer\"", "Pros": "Free food because I'm a crew trainer.", "Cons": "The pay is not equal to the work i put in."}, "2": {"Date": " Feb 12, 2017", "Summary": "\"Great Place\"", "Pros": "Big work environment, great mentors", "Cons": "Professional but fun, lots of laughs"}, "3": {"Date": " Feb 13, 2017", "Summary": "\"They do not rotate job duties, they don't train you, they don't follow their own rules\"", "Pros": "-Great hours. - Food is good", "Cons": "-Management is lazy. -They do not train you in any other area but one area. -They call you in repeatedly on your days off. -They yell at you if you're not doing the job \"To the letter\""}, "4": {"Date": " Jan 22, 2017", "Summary": "\"It's okay\"", "Pros": "Flexible, Good Work Life Balance", "Cons": "Management, No Training, Poor Customer Service"}, "5": {"Date": " Jan 8, 2017", "Summary": "\"Great For future job experience\"", "Pros": "You'd definitely learn patience working hereIt's important for your customer service career done the line", "Cons": "Dealing with angry customers easnt easy but as you grow and time goes by you become more experienced on how to handle these situations"}, "6": {"Date": " Jan 22, 2017", "Summary": "\"Department manager\"", "Pros": "If you are starting off as a new manager, you will gain excellent experience", "Cons": "Lates hours and needs a better evulation system"}, "7": {"Date": " Jan 22, 2017", "Summary": "\"Certified shift manager\"", "Pros": "McDonald's is a good place to work at especially if you are going to school", "Cons": "Some of the customers can get rude and nasty so you kill them with kindness"}, "8": {"Date": " Jan 7, 2017", "Summary": "\"Cashier\"", "Pros": "Well, it's a good company, the inside is excellent, and its close to where i live.", "Cons": "There's really no bad things about it i love it the way it is."}, "9": {"Date": " Feb 11, 2017", "Summary": "\"cashier and customer service\"", "Pros": "easy money but mean people", "Cons": "bad and angry people...hard to work for"}}