{"0": {"Date": " Feb 5, 2018", "Summary": "\"Prep\"", "Pros": "All about fun and meeting new people...", "Cons": "Everything is in a rush..."}, "1": {"Date": " Mar 12, 2018", "Summary": "\"Employee\"", "Pros": "Flexible hours and low commitment", "Cons": "low pay and gross food"}, "2": {"Date": " Feb 19, 2018", "Summary": "\"Over worked and underpaid.\"", "Pros": "I liked the flexible hours and that it didnt matter if I was late sometimes. I enjoyed the people that make up the crew and the fast paced environment.", "Cons": "They run you into the ground. Expect you to do all for them but they rarely do things to help you out. Its hard to get raises and you are usually understaffed because of these reasons. Also the meanest customers I have ever encountered in my life."}, "3": {"Date": " Feb 4, 2018", "Summary": "\"A learning experience.\"", "Pros": "Very flexible schedule. Fun crew and managers. Provides an amazing place to learn and manage stress and micro manage all in all it’s quite the learning experience", "Cons": "When you do your job there and do it well you really don’t feel like your being paid enough for the things you do and have to deal with. There also aren’t all that many bennifits"}, "4": {"Date": " Feb 4, 2018", "Summary": "\"Shift Management\"", "Pros": "Great scheduling, easy staff to work with", "Cons": "Fast pace, must keep up"}, "5": {"Date": " Feb 18, 2018", "Summary": "\"Crew Member - Covington, WA\"", "Pros": "Easy to learn , nice first job, most employees here can speak Spanish.", "Cons": "Can get very tedious and monotonous, a big reason why I left."}, "6": {"Date": " Feb 18, 2018", "Summary": "\"Working as a Teen at McDonald's\"", "Pros": "I was a teenager and it was a fun way to make spending money for myself. I think it would be difficult to live on the wage for a living, but it was a good high school part-time job. I liked working in the drive thru.", "Cons": "The environment could often be stressful. It was not the most sanitary as well. I had a significantly negative experience with a manager and had to get things worked out."}, "7": {"Date": " Feb 3, 2018", "Summary": "\"Good work environment but low pay\"", "Pros": "You get a free lunch there and you get to meet many nice people", "Cons": "Low pay and mean customers"}, "8": {"Date": " Feb 3, 2018", "Summary": "\"McDonalds -great for a first time job only\"", "Pros": "It is a good way for teens to gain experience with customer service and to learn multiple responsibilities.", "Cons": "Speed overrides customer satisfaction. Conversely, saving costs forces management to keep the number of employees to a bare minimum. Since a minimum number of employees is forced to take and fill orders, customers are often dissatisfied and they frequently complain. When employees respond with, at best, a nonchalant attitude, it produces a vicious cycle of dissatisfaction between customer and employees."}, "9": {"Date": " Feb 3, 2018", "Summary": "\"Good place to work of da munt\"", "Pros": "Cash money in da bank", "Cons": "Hard work for dat money"}}