{"0": {"Date": " Jul 26, 2016", "Summary": "\"Manager\"", "Pros": "Literally no pros besides it looks okay on my resume. There was also free food while I was working and that was nice.", "Cons": "Pay was terrible for an outrageous amount of work. Constantly promised raises and received nothing."}, "1": {"Date": " Jul 26, 2016", "Summary": "\"Working at McDonald's USA\"", "Pros": "Working with the owner operators and learning about the restaurant operations was a great experience. The amount of support for your job McDonald's offers helps through the busy days. The health benefits are the best.", "Cons": "The length and quantity of meetings you are required to attend is obsessive and can hold you back from being the best at your job."}, "2": {"Date": " Jul 27, 2016", "Summary": "\"Great Starter job\"", "Pros": "Great environment, learn customer service skills, learn cash handling experience", "Cons": "Low pay, management, and demanding schedules at times"}, "3": {"Date": " Jul 11, 2016", "Summary": "\"Awesome and cool\"", "Pros": "It was really cool with cool employees. Good benefits also", "Cons": "Did not like being around food. Bad customer service"}, "4": {"Date": " Aug 16, 2016", "Summary": "\"Ugh\"", "Pros": "I don't have any pros.", "Cons": "Everything is a nightmare working there"}, "5": {"Date": " Aug 17, 2016", "Summary": "\"Manager\"", "Pros": "My employees were great! No real positives about this location.", "Cons": "Franchise owner was outdated. Didn't keep up with new McDonald's technology. Forced changes in inventory against system recommendations and ended up buying nuggets and bunsecured from walmart!!"}, "6": {"Date": " Jul 26, 2016", "Summary": "\"Ok\"", "Pros": "Hours, no free food other stuff that they don't like you to fo", "Cons": "Paid, use money buy stuff and chill"}, "7": {"Date": " Jul 11, 2016", "Summary": "\"Crew Member\"", "Pros": "It's easy to get days off, and works with my school schedule so that I get decent hours for the week.", "Cons": "Rushes are bad and frequent, and the work ethic of your coworkers will make or break how well your shift goes."}, "8": {"Date": " Jul 11, 2016", "Summary": "\"cashier\"", "Pros": "Mcdonalds was good as a first job and i think that the pay was decent, would onyl consider for first job", "Cons": "the food kind of started to gross me out after a while but it was good while it lasted"}, "9": {"Date": " Jul 12, 2016", "Summary": "\"It's a great first job!\"", "Pros": "Teaches you how to deal with people, & teaches you good customer service! It's a very good first job. Plus you get 50% off everything! You can spend up to $20", "Cons": "Some customers are really rude lol just don't let your emotions get the best of you, keep a positive attitude no matter how difficult the customer! & Also sometimes it could get really messy in the Kitchen kind of gross.You may also gain weight if you eat a lot lol"}}