{"0": {"Date": " Oct 13, 2017", "Summary": "\"Table worker\"", "Pros": "Paid 8.25/per hour and free food", "Cons": "Hated the environment and Disfunction business"}, "1": {"Date": " Sep 27, 2017", "Summary": "\"McDonald's\"", "Pros": "It is a fast pace and friendly environment. The managers are very nice and understanding. The food is all fresh and the cooks are all very clean.", "Cons": "There are way too many employees. There is not enough hours to work. They start you off with minim wage."}, "2": {"Date": " Sep 27, 2017", "Summary": "\"Just a typical job at Mcdonalds\"", "Pros": "Easy work, flexible schedule, and free food", "Cons": "It's Mcdonald's. The people their are unpleasant."}, "3": {"Date": " Sep 27, 2017", "Summary": "\"Working here was great I loved it!\"", "Pros": "Discounted food and good hours", "Cons": "Rude customers and late work nights."}, "4": {"Date": " Oct 11, 2017", "Summary": "\"Working for the big M\"", "Pros": "Interaction with customers/ learn about your tolerance levels.", "Cons": "Can cause you to ponder your existence depending on managers."}, "5": {"Date": " Oct 11, 2017", "Summary": "\"Crew\"", "Pros": "you got free food discounts", "Cons": "Was always understaffed and mangers was no help"}, "6": {"Date": " Oct 11, 2017", "Summary": "\"Good first job, NOT a career\"", "Pros": "It teaches you important life skills such as counting money, cleaning, etc. It develops character. There are frequent pay raises.", "Cons": "Terrible upper-management. Managers treat crew very poor. Seemingly always understaffed. Dealt with crew not showing up for shifts for no reason ALL THE TIME."}, "7": {"Date": " Oct 12, 2017", "Summary": "\"McDonald's\"", "Pros": "I got a free meal every time I worked, very flexible schedule.", "Cons": "You have terrible management, and disrespectful staff."}, "8": {"Date": " Sep 26, 2017", "Summary": "\"HELLLLO\"", "Pros": "I literally love McDonalds so fricking much", "Cons": "No cons go McDonalds everyday"}, "9": {"Date": " Sep 26, 2017", "Summary": "\"Good place to work nice people to work with.\"", "Pros": "The hours and pay are decent the staff is chill and layed back. A few of the managers are very easy to get along with.", "Cons": "When it's time for their bonus they start to understaff and overwork their good employees they start to order less products ."}}