{"0": {"Date": " Aug 3, 2016", "Summary": "\"I Love Mcdonalds\"", "Pros": "When everyone is worjing together as a team and the customers always thank you and comes back.", "Cons": "When everyone is arguing, suppose to be Woking together."}, "1": {"Date": " Aug 4, 2016", "Summary": "\"Truck driver\"", "Pros": "Long runs devent equipment average pat rate", "Cons": "Lot of loads with not much time on them. If you are1 to 2 hrs from del and don't have hrs they will fire you if don't make del.. They will call you early in the morning, even on a Sunday and ask you why your not moving. They micro manage heavily.The owner is iranian. I have heard employees call him God. Yes seriously. I have over 20 experience otr and don't think was ever treated with such disrespect."}, "2": {"Date": " Jul 19, 2016", "Summary": "\"Good\"", "Pros": "Nice job, nice coworkers, a kind manager", "Cons": "lack of consistency and work ethic at times"}, "3": {"Date": " Jul 19, 2016", "Summary": "\"6 months at mcdonalds\"", "Pros": "The good side of working at mcdonalds was the location of the restaurant, close to my home. Luckily it wasn't a McDonalds that got ever crowded with highschool kids or homeless people. So work was easy, it was fun socializing with the staff and I felt like it was easy money, late night shifts, perfect for a student like me, who's busy in the day.", "Cons": "The smell of oil, oil getting on you, unpatient/unprecise customers.Small space to move around in, lack of cultured people, and pretty much an uninspiring work"}, "4": {"Date": " Jul 19, 2016", "Summary": "\"cashier review\"", "Pros": "good pay and free food.", "Cons": "smell bad and work long hours"}, "5": {"Date": " Jul 19, 2016", "Summary": "\"Cashier\"", "Pros": "It was a very clean place, good people to work with.", "Cons": "Very busy, I didn't get enough hours. Didn't pay that much."}, "6": {"Date": " Jul 20, 2016", "Summary": "\"Crew\"", "Pros": "Fun environment and co workers", "Cons": "Smell of grease. Often short staffed."}, "7": {"Date": " Jul 20, 2016", "Summary": "\"Food Technician\"", "Pros": "It's a clean environment and with the right management, it is a great place to work.", "Cons": "As stated earlier, it all depends on management. The food rush can be hard if not properly managed."}, "8": {"Date": " Aug 3, 2016", "Summary": "\"Use to love my job\"", "Pros": "Meet great people. Food discount including family and friends.", "Cons": "Very fast paced. Alot of work for very little money."}, "9": {"Date": " Aug 23, 2016", "Summary": "\"Not good\"", "Pros": "Free Food is fun to eat all day", "Cons": "People are rude at the window"}}