{"0": {"Date": " Mar 7, 2016", "Summary": "\"Not to good\"", "Pros": "meeting new people is always good", "Cons": "The service is not always very good"}, "1": {"Date": " Mar 7, 2016", "Summary": "\"Cashier\"", "Pros": "Good part time hoursCo-workers were nice", "Cons": "High turnoverNot good trainingJob responsibilities not well defined"}, "2": {"Date": " Mar 7, 2016", "Summary": "\"McDonalds Cashier\"", "Pros": "Hires at 15, Flexible hours", "Cons": "long shifts, rude customers, horrible wages"}, "3": {"Date": " Mar 8, 2016", "Summary": "\"Good start\"", "Pros": "Good hours if you're willing to work them, learn to handle all types of customers.", "Cons": "Low respect from customers. Dirty working enviorment."}, "4": {"Date": " Mar 7, 2016", "Summary": "\"Okay\"", "Pros": "great uniform, cool mascot, fun people, free french fries", "Cons": "smells, hard to move up, long hours"}, "5": {"Date": " Mar 7, 2016", "Summary": "\"Bad\"", "Pros": "Good for high school students.", "Cons": "Too much labor for too little pay. No respect"}, "6": {"Date": " Mar 7, 2016", "Summary": "\".... It was my first job\"", "Pros": "Easy startup\"training\"Become great at multitasking50% discount", "Cons": "Always busyAlways on your feetHaving to eat McDonald's all the time... gaining weight (ha)Free soft drinks equals sugar for days"}, "7": {"Date": " Feb 21, 2016", "Summary": "\"Maintenance\"", "Pros": "If your into manual labor and like to work solo this is for you. You answer only to your District, Store, and General Managers(Sometimes).", "Cons": "Individuals seem to attempt to take advantage. As a new employee I was generous at lending helping hands to all crew members when food preparations and things were needed. Yet, whenever I asked for help as far as Stocking the freezer when the truck drops, repairs around the store that needed an extra pair of legs or a back. Each said I am busy when they clearly were not. Others have even told me that is not my job. I stopped being so helpful at that point only when approached politely and it would not affect my work."}, "8": {"Date": " Mar 6, 2016", "Summary": "\"Crew member\"", "Pros": "When I was in college, this was an awesome part time job..great with flexibility..", "Cons": "Raise not givin on time"}, "9": {"Date": " Feb 20, 2016", "Summary": "\"Good Pay for Fry Cook\"", "Pros": "Rewarding learning experience being a fry cook at Mcdonald's. Lot of upward momentum when cooking the fries. Learned a lot.", "Cons": "If you can not take the heat then get out of the kitchen. that is the motto for a fry cook to have when working at mcdonalds."}}