{"0": {"Date": " Mar 8, 2016", "Summary": "\"Great employer\"", "Pros": "Great customer service experience. Good team work environment.", "Cons": "Long hours on your feet."}, "1": {"Date": " Mar 22, 2016", "Summary": "\"Lacks Employee Respect\"", "Pros": "It's an awesome new job opportunity which includes chance for advancement.", "Cons": "But only if you are able to get with an independent owner that allows you to be placed where you best fit. The overtrained higher management lacks interest in new ideas or ways. Its a one way no other way process. Which I feel is a cut throat issue. I feel this is one reason employee turnover rate is so high."}, "2": {"Date": " Mar 22, 2016", "Summary": "\"Mcdonalds review\"", "Pros": "Flexible hours and time off.", "Cons": "Customers could be unfair to employees."}, "3": {"Date": " Mar 22, 2016", "Summary": "\"cashier\"", "Pros": "i enjoyed every minute of it working and always having something to do was great", "Cons": "i was only able to work weekends, and not to my full potential"}, "4": {"Date": " Mar 23, 2016", "Summary": "\"Cooker\"", "Pros": "Pays well, gets the day by, nice people, good workers", "Cons": "You come home smelling like a burger"}, "5": {"Date": " Mar 23, 2016", "Summary": "\"loves\"", "Pros": "very fast and all of hand on", "Cons": "alot of standin in gettin burn"}, "6": {"Date": " Mar 22, 2016", "Summary": "\"Analyst\"", "Pros": "Fortune 1000 Company, well known", "Cons": "Highly Political. POS Vendor is not held accountable therefore the escape goat is the PM or Analyst"}, "7": {"Date": " Apr 12, 2016", "Summary": "\"My First Job, was taken advantage of\"", "Pros": "They were one of the only companies willing to hire me with no experience when I was still only 16, and many of the people who worked there were nice. The experience helped me get another job as a waitress later on.", "Cons": "They would only give me a few hours a week, usually 8-10 in 4 hour shifts or less. Several times I was called in for a three or four hour shift and then sent home early without pay, even though I was only making minimum wage. As a newer employee, I was also given the least desirable shifts."}, "8": {"Date": " Apr 13, 2016", "Summary": "\"awful to work for and if you knew what they did to your food you would not eat there\"", "Pros": "none all bad about them", "Cons": "all cons nothing good about any of them"}, "9": {"Date": " Mar 22, 2016", "Summary": "\"Crew trainer\"", "Pros": "I like the job but would like to advance into something much better and something I can build in and progress.", "Cons": "Not a very friendly work environment favorites are defiantly picked and least favorites are singled out not enough pay for the job"}}