{"0": {"Date": " Jan 20, 2018", "Summary": "\"Experience\"", "Pros": "Flexible scheduledecent payFun coworkers", "Cons": "unorganizationstressful at timeslack of training"}, "1": {"Date": " Feb 9, 2018", "Summary": "\"Not a job I recommend\"", "Pros": "It’s a job. So you get money.", "Cons": "The managers are almost all rude and sarcastic. I was insulted for not knowing how to do tasks that they never trained me on. There is no reward/ positivity for working very hard, but the moment you accidentally mess up management is very harsh and insulting (and mistakes are common due to the fact that it’s so fast pace). They don’t respect my religion or my request to have Sunday’s off. Hours aren’t flexible. I get called in almost every day off I have. The crew is rude and sexually inappropriate and when the management is informed they don’t do anything. It is not an enjoyable job at all and nobody likes the management."}, "2": {"Date": " Jan 20, 2018", "Summary": "\"Mcd\"", "Pros": "It was always a friendly environment", "Cons": "Management never communicate and if your not a minor good luck to getting a break"}, "3": {"Date": " Jan 4, 2018", "Summary": "\"Great First Job\"", "Pros": "I started out at the bottom, but was promoted quickly and earned management position after one year. Though the work environment is ever changing due to a high turn over rate, the management was friendly, encouraging, and held me accountable. I learned a lot of people skills and hard work with long hours and hard work ethic. If you are dependable, personable, and eager to work, you will go far!", "Cons": "The cons are really up to you. Lots of workers I saw were treating the job poorly because they were not applying themselves fully due to the fact that it is MacDonalds. But if you show up on time, do your tasks quickly and with intention to do them well, and respect management and others, you won't find it hard to succeed. But if you come with a bad attitude, come late often, don't put in the hours when asked, or treat customers/fellow employees with rudeness, you're not going to last long and will likely see newer employees promoted before you."}, "4": {"Date": " Jan 18, 2018", "Summary": "\"Good Place to work\"", "Pros": "staff was nice and helpful", "Cons": "had to be available to work over night"}, "5": {"Date": " Jan 18, 2018", "Summary": "\"Cashier\"", "Pros": "Co-workers are amazing. You get to choose your own hours. They’re very flexible.", "Cons": "You get stuck doing one job your entire shift. The managers are selfish; want you to stay later than what you’re supposed to and if you don’t they get angry."}, "6": {"Date": " Jan 18, 2018", "Summary": "\"Good place\"", "Pros": "Fun coworkers and smells good", "Cons": "Not enough benefits for the work"}, "7": {"Date": " Jan 18, 2018", "Summary": "\"Crew members. Working the grill station. Making sandwiches quickly. Trying to keep the area neat and organized.\"", "Pros": "Good pay good hours meet a lot of people also get discounted meals on your breaks. Get a raise after 6 months.", "Cons": "Constantly being rushed. Sometimes you may not get a break. Work schedule is always changing if they are short staffed you’ll do a lot running around"}, "8": {"Date": " Jan 19, 2018", "Summary": "\"Good place for young people\"", "Pros": "Fast-paced, organized and efficient. Friendly atmosphere", "Cons": "Not enough hours, no real benefits"}, "9": {"Date": " Jan 3, 2018", "Summary": "\"Bomb is good for you\"", "Pros": "Great ppl and staff cooks", "Cons": "Hot burgers steam nasty pits"}}