{"0": {"Date": " Jun 30, 2016", "Summary": "\"McDonalds Restaurants\"", "Pros": "I had a great boss in an organized company. Great insurance", "Cons": "The neighborhood was a tough one"}, "1": {"Date": " Jun 30, 2016", "Summary": "\"Company Review\"", "Pros": "The crew that I worked with was great, even when things didn't go well. The crew made work fun and enjoyable.", "Cons": "Air conditioning not working, machines breaking down a lot."}, "2": {"Date": " Jul 14, 2016", "Summary": "\"Cashier/Crew Trainer\"", "Pros": "I enjoy the enthusiastic, upbeat work environment! I also enjoy the opportunity to meet new people on a regular basis. I enjoy delivering customer satisfaction!", "Cons": "My specific work location is a 20 year old store with all the original equipment that breaks down constantly. This results in extended wait time and a lot of needless customer complaints as we are not able to deliver all products on a daily basis. The AC unit is also 20 years old and it fails to work properly in the summer months. This results in both customers and employees Sweating Profusely in the restaurant. Not only is this miserable for everyone concerned, it calls into question how much SWEAT is falling onto the product and customers' change as they receive it. I used to work for Mc Donalds in my teens and it was a Far Better Store with everything working properly all the time. What a disappointment to work at this location which customers routinely tell me is The Worst Mc Donalds they have ever been too!!!"}, "3": {"Date": " Jul 14, 2016", "Summary": "\"Not good\"", "Pros": "Good customers that come through", "Cons": "Coworkers don't care about working"}, "4": {"Date": " Jul 14, 2016", "Summary": "\"Worked as a cook and cashier.\"", "Pros": "You get to experience a lot of new things and meet new people. Great first job for high school students.", "Cons": "Some days are hard and stressful, but in the end it pays off. Pay is not as good (minimum wage)."}, "5": {"Date": " Aug 4, 2016", "Summary": "\"First Job\"", "Pros": "Source of income, Had the chance to meet new people, and learned that closed mouths don't get fed.", "Cons": "Not enough hours and Felt disposable"}, "6": {"Date": " Jun 29, 2016", "Summary": "\"cook/crew member\"", "Pros": "Very fast paced and up beat place to work. Generally they treat their employees great.", "Cons": "Physically demanding so if your not used to or comfortable with working in a fast paced environment that probably not for you. Multiple managers so if you don't get along with certain personalities then you wont do well."}, "7": {"Date": " Jun 29, 2016", "Summary": "\"Mcdonalds crew trainer\"", "Pros": "It's fun, really busy, most management is nice, and get to learn a lot of stuff to do to past time.", "Cons": "Management can be mean at times. When you a crew trainer or manager they will be more hard."}, "8": {"Date": " Jun 30, 2016", "Summary": "\"Decent job\"", "Pros": "Coworkers were pretty friendly and helpful. They were pretty fun a lot of the time. Definitely kept work from becoming boring.", "Cons": "There were some rude customers. Although that isn't really the company's fault. Minimum wage isn't that great but I suppose it's good for a first job."}, "9": {"Date": " Jul 13, 2016", "Summary": "\"good first job to make you appreciate money\"", "Pros": "Friendly crew, Drive thru, Up front", "Cons": "Night managers, move you around a lot."}}