{"0": {"Date": " Feb 1, 2018", "Summary": "\"Messy and disorganized\"", "Pros": "You can meet some decent people.", "Cons": "The management is disorganized, and there is no respect for any employees from corporate, up to and including management."}, "1": {"Date": " Jan 17, 2018", "Summary": "\"Its fine\"", "Pros": "The place is ok. great firstj ob", "Cons": "Smells really bad i dont like it"}, "2": {"Date": " Jan 31, 2018", "Summary": "\"It was Horrible\"", "Pros": "The hours are good so good checks at leastFree food and friendly people are always willing to lend a hand when needed", "Cons": "Poor Management , They Have 14 Year olds making more than a 27 year oldThey don’t clean very well"}, "3": {"Date": " Feb 1, 2018", "Summary": "\"Employee\"", "Pros": "People are fun to work with", "Cons": "Weekends are long and busy"}, "4": {"Date": " Feb 1, 2018", "Summary": "\"work here if you are desperate...\"", "Pros": "good first job, good for gaining work experience", "Cons": "the job pays minimum wage"}, "5": {"Date": " Jan 16, 2018", "Summary": "\"Good First Job\"", "Pros": "Good for high school students that need work experience.", "Cons": "Smells bad and it was always super hot and humid in the back."}, "6": {"Date": " Jan 10, 2018", "Summary": "\"I just signed up for an account\"", "Pros": "I'm trying to look at this website and see salaries. To get through these screens I have to enter some information here.", "Cons": "What are the cons of working here? I don't know. You should ask someone that fills out this sheet."}, "7": {"Date": " Feb 1, 2018", "Summary": "\"Crew member\"", "Pros": "Some friendly faces love working by myself on over nights", "Cons": "Poor management not the best place to work at of my location need a better job"}, "8": {"Date": " Jan 16, 2018", "Summary": "\"Decent part-time company\"", "Pros": "The job itself was easy and I was able to get as many shifts as I needed. I got what I expected to get out of it.", "Cons": "There was a ceiling and there was no way I could make a career out of it."}, "9": {"Date": " Jan 16, 2018", "Summary": "\"Crew member\"", "Pros": "There was good teamwork, good pay, good food", "Cons": "Some coworkers built bad relations with one another, hard to get hours the first couple of months"}}