{"0": {"Date": " Jun 10, 2016", "Summary": "\"Customer service\"", "Pros": "Best hours available you could make as much as you need. You get to meet and work with all sorts of different people", "Cons": "They don't offer much it's a dead end job I know people that's been working there for 20 years yes the make 13$ hour but that's not enough to live and save a little"}, "1": {"Date": " Jun 24, 2016", "Summary": "\"McDonald's\"", "Pros": "It is a good starting point job that didn't need any prior experience. It was my first job when I was in high school.", "Cons": "It's a fast pace work day. Your work is not easy and your under appreciated by customers and sometimes employees."}, "2": {"Date": " Jun 24, 2016", "Summary": "\"Not a bad place to work\"", "Pros": "Flexible hours, nice coworkers and managers, discounts on food, good benefits, the pay isn't that bad", "Cons": "A lot of the customers can be really rude, you are on your feet the whole shift so it can be tiring"}, "3": {"Date": " Jun 24, 2016", "Summary": "\"Experience at McDonald's\"", "Pros": "I learned a lot and worked well with everyone. I had good managers and co workers. Most customers were nice.", "Cons": "I wish I learned more about grill and the back of the house. I got stuck in one position most of the time. Doing single booth was very hectic."}, "4": {"Date": " Jul 15, 2016", "Summary": "\"Downfall of restaurant mangers\"", "Pros": "After being there 5 years there was no pros. Other than getting to meet new people.", "Cons": "The list is very long. After being a manager for 5 years I could no longer find a restaurant management job anywhere else. Other companys saw McDonalds and would say no on the spot. Even though I have a degree in restaurant management. The store managers are forced to pick people to throw into management training. Most that are picked have no business being in a manager position."}, "5": {"Date": " Jun 25, 2016", "Summary": "\"Fair\"", "Pros": "The pros of working for this company is that everything is relativeley easy with flexible schedules and is an overall good work expirience with everything that you learn", "Cons": "The biggest cons of this jobs is that the pay is very mediocre in correlation to the amount of work you actuall do"}, "6": {"Date": " Jun 23, 2016", "Summary": "\"Teen job\"", "Pros": "+ it more fast pace than the average job+ being able to eat there ( if you like fast food)+ Location friendly ( they are everywhere)+ meeting young workers", "Cons": "+dealing with rude customers+ dealing with untimely workers and slackers+ odd hours+ The get used to the food and would not want to eat there outside of work."}, "7": {"Date": " Jun 24, 2016", "Summary": "\"Not That Bad But Still...\"", "Pros": "1.)I'm generally a happy people person so working with others was a pro for me2.) Opportunity for raises3.) Easy to get accepted", "Cons": "1.) Every manager has a different going about things like techniques or the way you are cleaning something.2.) Little to no training"}, "8": {"Date": " Jun 24, 2016", "Summary": "\"Good\"", "Pros": "I love the people I work with. They are so nice and funny. That is the only reason I survive.", "Cons": "The customers are so rude. It's just a job to get a few bucks, I won't do it for the rest of my life."}, "9": {"Date": " Jun 8, 2016", "Summary": "\"crew\"", "Pros": "Great experience working at this location", "Cons": "none, I don't have any"}}