{"0": {"Date": " Jul 23, 2016", "Summary": "\"HR\"", "Pros": "flexible hours for full time employees", "Cons": "low pay for part time employees"}, "1": {"Date": " Jul 22, 2016", "Summary": "\"Crew trainer\"", "Pros": "Made some good friends, worked around my availability", "Cons": "Mis treated under paid for what I had to do"}, "2": {"Date": " Jul 22, 2016", "Summary": "\"eh. it put me through school\"", "Pros": "The only thing I could possibly say was that it was a good introduction to a past pace environment", "Cons": "working nights are a breeze, however depending on the location, after school will be hectic!! Lines pile up like no other, and no one is in a good mood when hungry."}, "3": {"Date": " Jul 22, 2016", "Summary": "\"Cashier\"", "Pros": "Great start to enter the work field, gain experience in cash handling", "Cons": "low pay, busy environment, management can be stressful"}, "4": {"Date": " Jul 23, 2016", "Summary": "\"Mangers perspective\"", "Pros": "Some of the coworkers are nice people to work with.The positions themselves can be pretty fun to do.It's nice to get a discount every day and a free meal every time you work.", "Cons": "When you're a manger and you work a 9 hour shift or more and you don't get a break because you're a manger \"and they don't get breaks\" especially terrible when you're 9 months pregnant...They rarely let you sit down even if you are hugely pregnant.Customers can be really rude for no reason, even if you're super polite to them and help them to the best of your abilities.Some store managers are great but some don't give a crap about you or your opinions.It's quite often that you are short staffed and when you tell the store manager rather than help you try and find people he tells you to run the dinner shift with 5-6 people which is not enough!!"}, "5": {"Date": " Jul 7, 2016", "Summary": "\"Crew\"", "Pros": "No experience needed, easy to learn, good working environment, with a good team you'll feel proud of your work..", "Cons": "Too much time standing-up... which is makes the shift pretty tired..."}, "6": {"Date": " Jul 8, 2016", "Summary": "\"Biscuit/Prep Person\"", "Pros": "I love working independently,. I love offering support to the Grill Team and the responsibilities that came along with the position.", "Cons": "There are not cons that I would like to speak about. I was happy with the position that I held."}, "7": {"Date": " Aug 13, 2016", "Summary": "\"Never again\"", "Pros": "Free food, nice coworkers and customers.", "Cons": "Long hours and barely any pay"}, "8": {"Date": " Jul 7, 2016", "Summary": "\"Great!\"", "Pros": "It was a wonderful experience. I learned a lot about customer relations.", "Cons": "Different stores implament different types of standards for raises."}, "9": {"Date": " Jul 22, 2016", "Summary": "\"McDonald's\"", "Pros": "It was pretty good when I had worked there. Everyone was nice managers were always repectful!", "Cons": "It was something until I could get far for school. The pay I already knew I was getting into but school came first"}}