{"0": {"Date": " Sep 14, 2017", "Summary": "\"Not a terrible experience\"", "Pros": "Fine for a part time job, very low commitment", "Cons": "Dealt with a lot of people who just weren't too nice etc"}, "1": {"Date": " Sep 14, 2017", "Summary": "\"Shift Manager\"", "Pros": "Got to work with friends. Fast-paced environment, so I wasn't often bored. Some regulars are really sweet, and you get to know your team really well. Can be fun to go into work.", "Cons": "Some customers are not so great, and are aggressive or condescending. Yes, I work at McDonald's, but no, that doesn't make me a second class punching bag. Also, there were times when it was impossible to please to store manager.Sometimes management seemed to care more about food service times than the human beings working the shift."}, "2": {"Date": " Sep 14, 2017", "Summary": "\"Cashier\"", "Pros": "I Learned many working experience through this job.", "Cons": "Pay rate is low, and the workload is kind heavy."}, "3": {"Date": " Sep 14, 2017", "Summary": "\"My Experience\"", "Pros": "It was amazing, they helped you out alot", "Cons": "Customers were rude at times"}, "4": {"Date": " Sep 14, 2017", "Summary": "\"What you would expect\"", "Pros": "My first manager was great, my second manager not so much. That really made a world of difference for me. The work's not great, but if the environment is OK, that can go a long way.", "Cons": "Pay is basically minimum wage. Customers are generally rude."}, "5": {"Date": " Sep 14, 2017", "Summary": "\"Cashier\"", "Pros": "Fast paste job with lots of nice people and owners are nice. Will learn lots of different things while working.", "Cons": "It's a bit of an unclean old building and you have to be able to deal with food if you can't then it's not the job for you."}, "6": {"Date": " Sep 14, 2017", "Summary": "\"Average\"", "Pros": "Paid, I was a teenager needing money, easy work", "Cons": "Poor Management, difficult customers, boring work"}, "7": {"Date": " Sep 15, 2017", "Summary": "\"I liked working there in the beginning but now I can't wait to leave.\"", "Pros": "They are very education oriented and my coworkers are very easy to work with. The positive feedback from customers makes the work easier to do.", "Cons": "They aren't accommodating of my medical issues and the general manager is very difficult to work for. There's not much of an opportunity to expand your experience."}, "8": {"Date": " Sep 15, 2017", "Summary": "\"Cashier\"", "Pros": "The pay is decent for a fast food job", "Cons": "You get what you expect out of a fast food job"}, "9": {"Date": " Sep 15, 2017", "Summary": "\"swing shift manager\"", "Pros": "meet different people.make choices,can work by yourself", "Cons": "can be stressful, sometimes you dont want to go to work"}}