{"0": {"Date": " May 21, 2016", "Summary": "\"Crew trainer\"", "Pros": "Every member was part of a team.", "Cons": "I always seemed to get trash detail."}, "1": {"Date": " May 21, 2016", "Summary": "\"Cashier\"", "Pros": "I loved all the food you can eat and the flexible hours.", "Cons": "Lousy benefits for part time workers."}, "2": {"Date": " Jun 26, 2016", "Summary": "\"cashier\"", "Pros": "i dont know i guess you get experience in fast paced enviroment.", "Cons": "they expect you to know how to do everything without training you. they treat you bad and say hurtful things."}, "3": {"Date": " Jun 4, 2016", "Summary": "\"Ok starter job\"", "Pros": "Learn a ton of skills. Learn how to work under pressure and in a fast paced environment. Chances to move up in the company. Meet tons of people. Sometimes develop friendships.", "Cons": "Legitimately the only pro to being a certified swing manager is a small raise, and you get whatever you want for an employee meal. No vacation time. Really no benefits at all. Training new crew is such a struggle because sometimes you get stuck with multiple new people and no crew trainers to help you. People consistently call in so you're almost always shorthanded, so be prepared to get yelled at by customers. Oh and big time favoritism between certain managers and crew."}, "4": {"Date": " Jun 4, 2016", "Summary": "\"overall okay\"", "Pros": "good salary and flexible hours", "Cons": "cranky management and exhausting work"}, "5": {"Date": " May 19, 2016", "Summary": "\"Crew Member\"", "Pros": "Good and friendly co-workers. Professional shift managers.", "Cons": "No cons I can think of."}, "6": {"Date": " Jun 2, 2016", "Summary": "\"OK job\"", "Pros": "FlexibilityFun environmentOpportunity for advancementThere is always room for growth and they have programs that will help you get your GED. Ongoing training programs", "Cons": "Long hoursNo benefitsWork life balance"}, "7": {"Date": " Jun 3, 2016", "Summary": "\"Finding a job\"", "Pros": "Great customer service skills with the customers.", "Cons": "Management is very poor and lack involvement."}, "8": {"Date": " Jun 23, 2016", "Summary": "\"McDonald's is the worst\"", "Pros": "Free lunch for working over 3 hours.", "Cons": "little hours and no room for promotion."}, "9": {"Date": " Jun 24, 2016", "Summary": "\"When I call they are rude. I'm a General Manager at another location. It's not what you say is how you say it.\"", "Pros": "The benefit and the pay and the customer that come in everyday. To spend money and to have QSC&V in place. All smile on deck and neat uniforms.", "Cons": "The attitudes and it's not worth it if the manager have attitude with the customer and the employees. The store be dirty when you work in its bad when the store is there. Walk right by the trash in the lobby and outside."}}