{"0": {"Date": " Dec 26, 2015", "Summary": "\"Great First Job but its Fast Food\"", "Pros": "Great starter Job, meet longtime friends, Free food", "Cons": "The pay, no benefits, unbelievable amount of work for nothing"}, "1": {"Date": " Dec 11, 2015", "Summary": "\"Any time\"", "Pros": "Being able to take care of your family and your responsibilities.", "Cons": "There is no bad reason for working"}, "2": {"Date": " Dec 12, 2015", "Summary": "\"Drive thru cashier\"", "Pros": "The job is pretty easy most of the time and easy to learnPeople around you want to help you get better because it makes their job easier", "Cons": "I worked at one of the larger locations and it can be pretty stressful at timesI smell like grease constantly"}, "3": {"Date": " Jan 16, 2016", "Summary": "\"Crew\"", "Pros": "Nope, there are no pros.", "Cons": "Everything. If you can think of it, it applies."}, "4": {"Date": " Dec 11, 2015", "Summary": "\"Not bad\"", "Pros": "Lots of hours , nice benefits", "Cons": "Dealing with very angry customers"}, "5": {"Date": " Dec 11, 2015", "Summary": "\"McDonalds\"", "Pros": "I get to meet new people.", "Cons": "I have to deal with angry people."}, "6": {"Date": " Dec 25, 2015", "Summary": "\"McDonalds\"", "Pros": "50% off discountSimple workEasy to learn", "Cons": "Incompetent leadershipNo benefitsPromise a pay raise and never received it"}, "7": {"Date": " Jan 14, 2016", "Summary": "\"Low Wages\"", "Pros": "None that I can think of", "Cons": "Bad hours and pay. I was constantly sent home after a couple hours due to being the newest person hired and management putting too many employees on the schedule"}, "8": {"Date": " Dec 9, 2015", "Summary": "\"mind over matter\"", "Pros": "mcopco gives excellent benefits, weekly pay, company car program and excellent tuition reimbursementthe", "Cons": "the overall store environment is pretty crappy, if you can wrap your head around not stressing about the little things. itll be okay and you make it through."}, "9": {"Date": " Dec 9, 2015", "Summary": "\"Manager In Training\"", "Pros": "Opportunity to advance, great training program", "Cons": "You have to take the bad with the good. Not all employees are there for the customers."}}