{"0": {"Date": " Sep 3, 2016", "Summary": "\"Good company to start with\"", "Pros": "Good work life balance eith school", "Cons": "None that I can think of"}, "1": {"Date": " Sep 3, 2016", "Summary": "\"It was nice but i did not like what i was getting payed at was too low $8.10\"", "Pros": "It is easy if you are at school, you can work certain hours and get payed close to the amount you need if you are not graduted", "Cons": "In certain mc donalds you get payed very low and can very affort to pay your bills and it is too much drama"}, "2": {"Date": " Sep 4, 2016", "Summary": "\"Great customers and area\"", "Pros": "The customers and crew were amazing they brought so much joy to the work day.", "Cons": "The high end managers knew there were problems with staffing and kept saying we are hiring which happened rarely and didn't want to pitch in and he'll would put it all on you."}, "3": {"Date": " Sep 17, 2016", "Summary": "\"Cashier\"", "Pros": "Good managers. Also a clean placr that has a decent background story.", "Cons": "Bad hours and machine areas"}, "4": {"Date": " Sep 17, 2016", "Summary": "\"Hard Worker\"", "Pros": "Great and hard worker. Dedicated. Ambitious. Reliable. What i don't know I'm willing to learn fast", "Cons": "I can be nervous at times from messing up... I like to be on top of my job so if i have no knowledge of what i have to do then i will feel clueless"}, "5": {"Date": " Sep 2, 2016", "Summary": "\"Shift manager\"", "Pros": "They work with your schedule. You get to meet amazing people", "Cons": "Having to deal with upset customers is not as easy as you would think."}, "6": {"Date": " Sep 3, 2016", "Summary": "\"Great Part-Time Job\"", "Pros": "This McDonald's has very flexible hours, a great environment, and gives all employees a discount on any food that he or she orders.", "Cons": "The only cons are that sometimes, not-so-great customers give nasty attitudes, there is always a greasy smell, and I receive low raises."}, "7": {"Date": " Sep 14, 2016", "Summary": "\"Ejoyable for a dead end job, I suppose\"", "Pros": "Enjoyed the team I worked with, was given work when I wanted, didn't have to work too much and newer had the problem of not being able to work enough", "Cons": "Pay is minimum wage, obviously, little to no room for advancement, very hot most of the time"}, "8": {"Date": " Sep 16, 2016", "Summary": "\"MCD\"", "Pros": "The money is great for those who work", "Cons": "Can be very demanding of you."}, "9": {"Date": " Sep 16, 2016", "Summary": "\"McDonald's the world's largest fast food joint.\"", "Pros": "Some of the best reasons to work at mcdonalds is that you get to work with people and learn how to survive working fast food. Mcdonalds is one of the faster paced fast food restaurants out there, if you can handle that job, and keep up wih your customers, you can work just about any fast food joint.", "Cons": "One of the cons of working there is that the salary sometimes differs per store. Also that because it is so fast paced, the job can get really stressful."}}