{"0": {"Date": " Aug 30, 2016", "Summary": "\"Intern\"", "Pros": "Good work environment, Bi-annual bonuses, good benefits, 401k, company parties", "Cons": "advancement, minimal raises, old building, small office space, low number of employees"}, "1": {"Date": " Aug 30, 2016", "Summary": "\"If you can, work somewhere else\"", "Pros": "Flexible hours, steady pay, great starting job", "Cons": "Rude customers, poor pay, very stressful"}, "2": {"Date": " Aug 30, 2016", "Summary": "\"McDonalds\"", "Pros": "McDonalds can be a good way to build career skills. As well it has it fun moments. Free meals for management.", "Cons": "Customers can be really rude. Employees can be difficult to deal with or train. Insurance isn't that good."}, "3": {"Date": " Aug 31, 2016", "Summary": "\"Mcdonald's Crew\"", "Pros": "Easy job to obtain. Mostly flexible hours. Discount on foods. Can find a McDonald's anywhere across the US to work in. Little problem solving required.", "Cons": "Manual labor. Not the greatest experience to add to a resume for entry level professional positions. Only two actual promotion positions available."}, "4": {"Date": " Aug 15, 2016", "Summary": "\"Great\"", "Pros": "Loved it to be honest this isn't such a bad place to learn how a business is run and the basics of management and teamwork.", "Cons": "Just the overall quality of the product being sold - it isn't high end food! And it can be a bit gross."}, "5": {"Date": " Aug 30, 2016", "Summary": "\"Ehhh\"", "Pros": "Easy work, fast money, good friends", "Cons": "Horrible pay, hard to move up"}, "6": {"Date": " Aug 30, 2016", "Summary": "\"Crew Member\"", "Pros": "Received customer service experience and multi-tasking", "Cons": "Rude customers, work too hard for what you are getting paid for."}, "7": {"Date": " Aug 30, 2016", "Summary": "\"McDonald's\"", "Pros": "Quick Paced, very friendly, team environment, easy, our number one goal is to make every customer leave with a smile.", "Cons": "Co workers are often mad or in a bad mood because they are working a at McDonald's. Also the managers won't let you get training to further your career."}, "8": {"Date": " Aug 11, 2016", "Summary": "\"Manager\"", "Pros": "A lot of hours free food", "Cons": "Can be cut if they don't need you to work"}, "9": {"Date": " Sep 20, 2016", "Summary": "\"Not great\"", "Pros": "Nothing. Nada. Not a single thing. Your early morning elderly customers have conversations about how Obama needs to \"go back to Africa.\" I hope their families dump them in a nursing home and never look back. : )", "Cons": "Worst kind of customer service job. I hope my \"managers\" stay there and rot : ) In the end I chose to work this job to make a little extra money. Life is all about choices. I recommend no one choose to work here."}}