{"0": {"Date": " May 2, 2016", "Summary": "\"McDonald's\"", "Pros": "A place to grow with", "Cons": "Not family orientated .all about money"}, "1": {"Date": " Apr 16, 2016", "Summary": "\"Good company\"", "Pros": "nice people,good managers, clean, efficient", "Cons": "same stuff everyday, not exactly an exciting job"}, "2": {"Date": " Apr 30, 2016", "Summary": "\"shift manager\"", "Pros": "Customer Service, good people and nice enviroment to work on.", "Cons": "Alot of stress with people giving you attitude"}, "3": {"Date": " Apr 30, 2016", "Summary": "\"Working at Agawam McDonald's\"", "Pros": "This is a job where you will keep busy, as the location's proximity to the Eastern States Exposition and Six Flags New England means that this is a high traffic and high energy location. You will work with good people, and many of the managers are fun to work with as well.", "Cons": "The General Manager can be difficult to work with, and she can be rather abrasive at times. While she does help out and does her best to accommodate any scheduling needs, she is currently doing both hiring and scheduling herself, so mistakes are made, and when they are made, she will expect that you find coverage for those shifts."}, "4": {"Date": " Apr 30, 2016", "Summary": "\"Potential\"", "Pros": "Great fast pace environment where you can learn about business and people.", "Cons": "Management could be vetted somewhat better."}, "5": {"Date": " Apr 30, 2016", "Summary": "\"My experience there\"", "Pros": "You get to see the smiles on adults and children faces and experience the love people have for McDonalds food. Having great customer service is everything.", "Cons": "You may have some guests who get reckless at times."}, "6": {"Date": " Apr 15, 2016", "Summary": "\"store manager\"", "Pros": "This job was great for learning basic aspects of business. Payroll was okay, workload was manageable.", "Cons": "This job will keep you running. Customers have high expectations. It is very difficult to achieve numbers and give great service simultaneously."}, "7": {"Date": " May 21, 2016", "Summary": "\"terrible place\"", "Pros": "easy to get in, flexible worktime", "Cons": "very low salary, no bonus"}, "8": {"Date": " Apr 10, 2016", "Summary": "\"Something to help pay off my tuition\"", "Pros": "The application and interview process is pretty simple. There are many locations, so chances are the company will always be hiring with many locations to choose from in a particular area. They provide uniform so you don't have to worry about what to wear just provide slip resistant shoes. When it's busy, the hours go by faster. You get a free employee meal everyday. The hours can be flexible sometimes.", "Cons": "The hours aren't fixed, a new schedule is made every week with varying hours and days. You start off part time meaning you work under 30 hours. They pay minimum wage. But it's McDonald's, not really a career for me but something to do in my free time to gain customer service experience at the least."}, "9": {"Date": " Apr 15, 2016", "Summary": "\"department mgr\"", "Pros": "excellent company to work for. very systematic, very busy and great upper leadership", "Cons": "hard to move up, as most gms stay"}}