{"0": {"Date": " Feb 1, 2017", "Summary": "\"good and friendly environment\"", "Pros": "Very flexible schedule, there is some room for improvement, room for raises if earned, easy to learn job.", "Cons": "No down sides really I just feel that more is expected of you then what you are payed."}, "1": {"Date": " Feb 14, 2017", "Summary": "\"review\"", "Pros": "nice people to work with", "Cons": "customer service positions aren't always the most rewarding"}, "2": {"Date": " Feb 14, 2017", "Summary": "\"Cashier\"", "Pros": "I liked the working environment.", "Cons": "Management was not very organized."}, "3": {"Date": " Feb 14, 2017", "Summary": "\"Average part time paid job for anyone with little or no experience\"", "Pros": "Very flexible schedule, free meal", "Cons": "low paid part time job"}, "4": {"Date": " Feb 14, 2017", "Summary": "\"Lies\"", "Pros": "Flexible hours. I met some of the coolest people while working there.", "Cons": "Terrible pay. No benefits. They lie to the good employees and tell them they will make them supervisors so they will stay. I was stuck doing the supervisors job without the pay."}, "5": {"Date": " Feb 14, 2017", "Summary": "\"Server\"", "Pros": "Not a hard job it's easy work", "Cons": "Pretty bad pay bad hours"}, "6": {"Date": " Feb 15, 2017", "Summary": "\"mcdonalds suck as a job\"", "Pros": "got burned alot. some bosses dont car", "Cons": "got to eat everything half off"}, "7": {"Date": " Jan 31, 2017", "Summary": "\"It was a horrible experience.\"", "Pros": "THe way they make fast food is disgusting", "Cons": "Do not work here it is not worth it."}, "8": {"Date": " Feb 11, 2017", "Summary": "\"Tech for MCD\"", "Pros": "high rate of change, CEO working to disrupt failure to deliver tech projects", "Cons": "All IT projects are late, no rigor around tracking finance or objective metrics of projects, 'old boy network'"}, "9": {"Date": " Feb 14, 2017", "Summary": "\"Franchise dependent\"", "Pros": "Flexible with work hours, easy work", "Cons": "So this would all depend on which franchise you were in but management was poor and pay was minimum. Where there are so many McDonalds i can understand why McDonalds global would not spend much time correcting this but I think it hurts there reputation when a series of stores could be so poorly run. Also depending on your store pay can be good or bad."}}