{"0": {"Date": " Feb 7, 2017", "Summary": "\"I am a good and hard worker i put my all into everything i do to go far in life.\"", "Pros": "It was a good job when i started everyone was friendly and if i didn't know something they helped me.", "Cons": "At the end the supvisor didn't tell me the reason I was being let go."}, "1": {"Date": " Jan 22, 2017", "Summary": "\"Flexible Hours and Scheduling\"", "Pros": "Best thing would be the flexible hours, and the ability to swap shifts with another employee by talking to a manager. Also nice to have 50% food discount while working.", "Cons": "The work can become monotonous, it can also get hot because of all the cooking equipment. You end your shift smelling of fast food."}, "2": {"Date": " Feb 5, 2017", "Summary": "\"Glad I'm Gone\"", "Pros": "Can apply for raise 6 months in", "Cons": "Managers don't help new employees transition in smoothly, they have other new people teach them"}, "3": {"Date": " Feb 5, 2017", "Summary": "\"Eh\"", "Pros": "Food is good; and good benefits like 401k and free food", "Cons": "Its macdonelds and the place is dirty"}, "4": {"Date": " Feb 5, 2017", "Summary": "\"Part Time at MCDS\"", "Pros": "-Working as a team was emphadized. People were nice as long as you did your work", "Cons": "Manager changes schedule so I didn't have set schedule"}, "5": {"Date": " Jan 22, 2017", "Summary": "\"Cashier\"", "Pros": "Its easy to catch on to, more easy to focus on. I like it because its something i know i can be succesful with.", "Cons": "Sometimes there will be rude customers, but you must keep calm and stay manorable at all times."}, "6": {"Date": " Feb 26, 2017", "Summary": "\"horrible\"", "Pros": "none, it sucks really bad", "Cons": "everything is bad about this job"}, "7": {"Date": " Feb 26, 2017", "Summary": "\"Horrible\"", "Pros": "There are no pros it sucks the people were rude management didn't care about anything I was pregnant and they made me work more then my body could", "Cons": "Pay sucked work hours sucked management didn't even know how to do their job no one listened when there was a problem"}, "8": {"Date": " Feb 5, 2017", "Summary": "\"Table Service/Cashier\"", "Pros": "Since I worked in a corporate store, I could get a free meal if I worked at least 4 hours. The salads and some other food items were delicious. The majority of customers were very nice. Two-thirds of the staff were nice to work with.", "Cons": "I couldn't get enough hours or regular hours. I was scheduled when I said I wasn't available. Training was almost non-existent. Floor managers changed constantly -- each with a different way of doing things. The cash register user interface would suddenly change and I had no idea where the products had moved to on the multiple screens. I never received the required work shoes although I would get yelled at for not wearing them. After a month I was given non-slip rubbers to put over my shoes. Procedures were confusing, not explained, and management played favorites. I was promised I could get 20-25 hours a week but I actually would get 0-6 hours every 2 weeks. The store manager would yell at me over the front counter, in front of customers and staff, regarding tasks that had already been done -- very disrespectful. Many employees were unhappy and quitting for the same reasons I did. I was hired for one job and switched to a different job I didn't like after a month there. I was doing great at my original job. They hired an alcoholic to replace me; she showed up for work drunk all the time but they didn't put her on notice or get after her or let her go. They gave her M-F, 8am-5pm -- the slot everyone wanted. The managers were difficult and unnecessarily dictatorial in their attempts to look serious and competent. They had a dysfunctional system for getting people to cover for you if you became ill or had a conflict...and for picking up extra hours."}, "9": {"Date": " Jan 21, 2017", "Summary": "\"Flexible\"", "Pros": "I liked working at McDonald's because they were super flexible with my schedule. When I was in high school, my scheduling manager was more than willing to work around my busy schedule to give me hours. During college, she would let me work for 4 hours before class and day shift on the weekend! It's a tight knit community once you've been working there for a few months. The management and other workers truly care about each other and looking out for one another.", "Cons": "If you don't have an extremely open availability, there is no room for growth. Raises don't happen too often. I was told I'd get one every 6 months when I was hired, but after my initial raise, I didn't get one for 2 years. When management shifted, I received them more often than originally."}}