{"0": {"Date": " Dec 30, 2015", "Summary": "\"pretty decent for part time work\"", "Pros": "free foodflexible schedulegood for no experience anywhere", "Cons": "greasyhot environmentcan't survive off of 7.50"}, "1": {"Date": " Feb 3, 2016", "Summary": "\"Sweatshop\"", "Pros": "Employee discount on food, flexible hours", "Cons": "Smell like food when you get home. Pay is horrible."}, "2": {"Date": " Jan 13, 2016", "Summary": "\"Why I don't want to work here again\"", "Pros": "Employee meal discounts and free manager meals. They did work with my changing school schedule.", "Cons": "Benefits aren't that great when you have them. Pay isn't that great. Communication is lacking at times. Upper management sets unrealistic food, labor, and sales goals which causes schedules to suffer. Sometimes good work goes unnoticed."}, "3": {"Date": " Jan 13, 2016", "Summary": "\"Cashier/runner\"", "Pros": "Nothing nice to say at all", "Cons": "Low pay lousy managers that's all"}, "4": {"Date": " Dec 30, 2015", "Summary": "\"Cashier\"", "Pros": "Environment was great because the workers working there worked really hard and I loved learning from them . Great staff and the am stance was nice and the hard workers influenced me a greatly lot.", "Cons": "Environment was rough and the manager did not like me much for some reason I do not know but I guess I have to move on and so I did I just quit and found work some where else since that was all I could do."}, "5": {"Date": " Jan 12, 2016", "Summary": "\"You'll learn a lot about the workforce at this job, that's for sure...\"", "Pros": "The work isn't complicated, but it's not easy either. All the food prep, order taking, and window service tasks are fairly simple on their own, but you'll need to do them quickly and precisely and be able to do them as part of a team. Much like an internship, most of what you get out of this job will be in terms of experience. You'll be building foundational skills such as workplace etiquette, professional presentation, and getting your butt out of bed to go make some money.", "Cons": "Just don't stick with it for too long or your sanity will be sucked straight out of your skull like a brain smoothie. The work environment is very high pressure and tension tends to ramp up steeply during peak hours. Working an eight hour shift at this job will leave you feeling both physically and mentally exhausted. Do not stay at this type of job for more than a year or it will begin to warp you."}, "6": {"Date": " Jan 12, 2016", "Summary": "\"Store manager\"", "Pros": "None this company is no good", "Cons": "Horrible company. Bad food. Not good"}, "7": {"Date": " Jan 13, 2016", "Summary": "\"Don't stay too long, just enough to develop decent work ethics.\"", "Pros": "As a first job to introduce you to the fundamentals of working hard and listening to management It is a good start. Most of the employees are young so if you're young, getting along with other crew is easy, similar to making friends in school.", "Cons": "Like I said earlier relating this work environment to school, it does have it's downsides. Most of the High School drama is brought into the work environment which can be distracting and quite annoying. Moving up in this company is hardly worth pursuing, if you start as crew and make your way to crew trainer then you manage to make it to management, you accumulate a total of $1.10 in raises. And every year you get a chance to get a $.10 raise for being an exemplary worker. Overtime is virtually non-existent, if you manage to work over 40 hours in a week it's the manager's job to cut your hours the next week before paychecks come in. OK in conclusion why are you even reading this far you should know the stereotypes of working in fast food, disrespectful customers, airheaded manager's and crap pay. This is just a starting job, don't stay more than a year. Again why are you reading reviews of McDonald's, everything you hear is true."}, "8": {"Date": " Jan 12, 2016", "Summary": "\"Title\"", "Pros": "There were many people to talk to and make connections with. This led to me making many friends in Plainsboro.", "Cons": "I really did not feel that I was reaching my full potential. There were a lot of customers and it was difficult."}, "9": {"Date": " Jan 12, 2016", "Summary": "\"McDonald's\"", "Pros": "It's a school and you have to take the time here as that", "Cons": "Don't think you are joining to stay"}}