{"0": {"Date": " May 1, 2017", "Summary": "\"Customers Service\"", "Pros": "Good managers and flexible shift work", "Cons": "Stress from shift workers and satisfaction"}, "1": {"Date": " May 21, 2017", "Summary": "\"Yes, the employment experience is as bad as the service\"", "Pros": "-Easy to get hired. Like REALLY easy.-You can meet some cool people and network really well", "Cons": "-High turn-over rate-no chance for career advancement-Doesn't care about customer service-Will hire ANYONE so you won't know if your coworker or supervisor is a convict-Manager will tell you not to eat fries out of the pit, but will proceed to eat fries out of the pit-You find out how unsanitary McDonald's really is"}, "2": {"Date": " May 21, 2017", "Summary": "\"pay\"", "Pros": "none there are no pros", "Cons": "minimum wage is not enough"}, "3": {"Date": " May 21, 2017", "Summary": "\"McSlaver\"", "Pros": "Flexible, food at all times if you know the right ways to sneak it.", "Cons": "Sometimes I wanted to kill myself when working"}, "4": {"Date": " Apr 29, 2017", "Summary": "\"Each restaurant varies dramatically\"", "Pros": "I worked at two different restaurants in Maine, one located in a small city and the other located in a very rural small town.--very flexible schedule, you can decide and change your availability and they will respect it--it is very fast-paced and lots of multitasking (if you work during the day, the night shift is very slooow)", "Cons": "--your experience will completely depend on the management and who works with you, if you have mean scary managers and rude coworkers, then it is going to be a rough experience but if you are lucky enough to have cool people to work with, it'll be great--it is tiring standing on your feet all day long--some customers really treat you horribly"}, "5": {"Date": " Apr 29, 2017", "Summary": "\"Worker\"", "Pros": "Good first job for young person", "Cons": "Not the best place to be long term"}, "6": {"Date": " Apr 30, 2017", "Summary": "\"Cashier\"", "Pros": "Flexible schedule and they pay your meals", "Cons": "Too busy and most of the time you ended don't over time"}, "7": {"Date": " Apr 14, 2017", "Summary": "\"Crew\"", "Pros": "Awesome people and great atmosphere!!", "Cons": "To many rude costumers witch sucks because it's hard to get a good review."}, "8": {"Date": " Apr 15, 2017", "Summary": "\"None but if you give, me a chance ill show you what I can do\"", "Pros": "There food is so good and you will feel great by working with McDonald's", "Cons": "Come on time have fun,and have a positive attitude and be happy and also be greatful ,you got the job"}, "9": {"Date": " Apr 28, 2017", "Summary": "\"Working At McDonald's Is Okay\"", "Pros": "Gives lots of hours. And pay well which is $7.35", "Cons": "Overwork staff. Minor get off past 12"}}