{"0": {"Date": " Nov 9, 2017", "Summary": "\"wasn't bad\"", "Pros": "wasnt a bad minimum wage job", "Cons": "gross food but you don't have to eat it"}, "1": {"Date": " Nov 10, 2017", "Summary": "\"This place sucks\"", "Pros": "Some of the employees can be great. With the right team it could be a great place to work. .", "Cons": "The company has no idea what my store is like for the employees. Many people in charge shouldn't be have been promoted. ."}, "2": {"Date": " Oct 27, 2017", "Summary": "\"Crew Member\"", "Pros": "Flexible hours, good location, good management", "Cons": "There would be some very busy hours"}, "3": {"Date": " Nov 9, 2017", "Summary": "\"Smooth Beginnings and endings all around\"", "Pros": "It’s a easy enough job and knows it’s concerns with your time availability", "Cons": "Doesn’t pay well enough to really afford much"}, "4": {"Date": " Nov 30, 2017", "Summary": "\"First job\"", "Pros": "Nothing at all. It was a starting job.", "Cons": "Low pay. Bad hours. Didn't enjoy it."}, "5": {"Date": " Oct 25, 2017", "Summary": "\"Crew Member\"", "Pros": "Flexible hours and the work is easy.", "Cons": "If you close the restaurant you have to clean out the grills which is no fun."}, "6": {"Date": " Oct 25, 2017", "Summary": "\"Assistant Manager\"", "Pros": "Great environment to grow in leadership and organizational skills, customer service, and employee engagement. You make what you will of this job. If you are committed to personal growth and success, you can do well here. If it's \"just a fast-food job,\" and you complain a lot, you will hate it and they will learn to hate you.", "Cons": "Long hours, low pay."}, "7": {"Date": " Oct 25, 2017", "Summary": "\"Shift leader\"", "Pros": "fire foodmoneyfire coworkers", "Cons": "nasty foodnasty managementugly customers"}, "8": {"Date": " Oct 25, 2017", "Summary": "\"Really great company, easy going, no stress, flexibility is there, huge work like balance.\"", "Pros": "Great people, teamwork, flexibility, benefits are fantastic, huge bonus payout, working ours are great! Work is easy. No stressful month end closes.", "Cons": "No room for growth, lack of growth opportunities - you are stuck in one position for years, leadership is shady, people only manage up, wont allow to work from home one person but another one can do whatever they want."}, "9": {"Date": " Oct 25, 2017", "Summary": "\"great\"", "Pros": "good work experience in customer service", "Cons": "management, hours were at times not accomodating"}}