{"0": {"Date": " Jan 21, 2016", "Summary": "\"Crew Trainer\"", "Pros": "Great crew to work with and management was great!", "Cons": "Not a lot of room for opportunities to advance."}, "1": {"Date": " Jan 6, 2016", "Summary": "\"i like it\"", "Pros": "it is a great place", "Cons": "there is nothing bad here"}, "2": {"Date": " Jan 6, 2016", "Summary": "\"Great opportunities if you're willing to work\"", "Pros": "Plenty of opportunity for advancement. I worked here for three years in high school. Been back for about a month and they're working towards getting me into management.", "Cons": "Have to deal with jerks. Most people are great and friendly but every now and again you get a real moron."}, "3": {"Date": " Jan 7, 2016", "Summary": "\"It was good but the employee communication is terrible.\"", "Pros": "You make quit a bit of money if your in school and looking for a temporary job.", "Cons": "You might catch a lot of heat do to others mistakes."}, "4": {"Date": " Jan 20, 2016", "Summary": "\"it was ok\"", "Pros": "it was ok to work here", "Cons": "did not get paid enough"}, "5": {"Date": " Jan 20, 2016", "Summary": "\"cook\"", "Pros": "I don't have much to complain about its a job", "Cons": "downsides at working at mcdonalds not enough hours"}, "6": {"Date": " Jan 21, 2016", "Summary": "\"My experience was cool at first then died out but maybe because I was in school and wanted better.\"", "Pros": "Free food, free drinks. Some good consumers, some good co workers, flexible hours. Tips from customers. Sometimes there are managers who look out for u", "Cons": "Some bad managers and bad consumers! Working on national holidays. No paid time off. If sick or can't make it you're treated badly. Rush hour...drive thru window and the head set u can barely hear from at times."}, "7": {"Date": " Jan 21, 2016", "Summary": "\"Cook\"", "Pros": "You can get OT hours", "Cons": "Don't really show you much"}, "8": {"Date": " Jan 21, 2016", "Summary": "\"Worker\"", "Pros": "Easy to apply, not too difficult work", "Cons": "Customers are annoying, frying oil is gross, not a lot of pay"}, "9": {"Date": " Jan 21, 2016", "Summary": "\"crew member\"", "Pros": "the pay rate is good 9.25", "Cons": "dont get alot of hours and is not where i want a career"}}