{"0": {"Date": " Feb 12, 2016", "Summary": "\"It was okay but underpaid and stressful\"", "Pros": "Learn how to work in fast paced environment, forced to communicate, o.k. Start to learn about the food industry, can be really fun depending on who you work with", "Cons": "BusyRude customersDisorganized locationsMessyStressfulFast pacedUnderpaidOn your feet all dayHad to buy uniform besides shirt"}, "1": {"Date": " Feb 12, 2016", "Summary": "\"manager\"", "Pros": "love to work at mcdonalds, we got burgers, chicken nuggets, and other nice things.", "Cons": "not enough pay, long hours, customers complaints, other things"}, "2": {"Date": " Feb 13, 2016", "Summary": "\"Good for a first job\"", "Pros": "Coworkers can end up being familyGood hours", "Cons": "Low pay, Bad management, Rude customers"}, "3": {"Date": " Jan 29, 2016", "Summary": "\"Cook closer\"", "Pros": "Cook prep clean close clock in clock out break in an out", "Cons": "Poor employees and terriable management system from general manager"}, "4": {"Date": " Jan 28, 2016", "Summary": "\"Great\"", "Pros": "Ok pay great management overall", "Cons": "No real cons about the job"}, "5": {"Date": " Feb 9, 2016", "Summary": "\"First Job\"", "Pros": "Decent first job. Teaches responsibility.", "Cons": "Rude customers and late shifts"}, "6": {"Date": " Feb 11, 2016", "Summary": "\"shift Manager\"", "Pros": "Quick advancement and overtime pay.", "Cons": "Overworked for low pay and managers can be rude."}, "7": {"Date": " Jan 28, 2016", "Summary": "\"Great company to work for\"", "Pros": "There are lots of development opportunities at this company if you're willing to relocate. McDonald's also has great benefits, above average from what I've been exposed to.", "Cons": "There is a considerable amount of travel throughout the year, which can be hard to balance. Pressure to deliver results can also be stressful at times."}, "8": {"Date": " Mar 3, 2016", "Summary": "\"Salary\"", "Pros": "Flexibility with schedule and shifts, discount on food,", "Cons": "Stressful enviroment, not professional, cant take more than 15 mins break"}, "9": {"Date": " Mar 4, 2016", "Summary": "\"I give this and\"F\"\"", "Pros": "Free uniformsFree meals on Sunday-other thank that 50% off", "Cons": "everybody HATES you-no matter what"}}