{"0": {"Date": " Apr 1, 2017", "Summary": "\"Overall my experience was mediocre, the managers are very rude and GHETTO. Its not a team, its everyone for themselves.\"", "Pros": "There aren't too many pros, some of the employees are friendly and helpful and it is a fun place to work if you find the right environment.", "Cons": "Everyone is rude and talks about you, the managers get on you for every little mistake and refuse to teach anything. Your on your own from start. They tow every car they can if they can get away with it,they have managers watching parking lot and got tow truck on speed dial, regardless if you buy something I. There or not. Nothing but dope fiends and homeless people hanging in and around begging for money or food from customers or using bathroom to get high in and leave needles and such behind."}, "1": {"Date": " Mar 16, 2017", "Summary": "\"Crew Member\"", "Pros": "Flexible hoursMost co-workers are very nice to work with", "Cons": "On your feet a lotCustomers can be difficult to handle and managers do not do a lot to help"}, "2": {"Date": " Mar 16, 2017", "Summary": "\"It is what you make it\"", "Pros": "Opportunity for advancement. Training is computer learning and hands on.", "Cons": "Pay for shift management is too low."}, "3": {"Date": " Mar 17, 2017", "Summary": "\"A Customer Service Job\"", "Pros": "If you work your way up, it can become decent income if you have the ambition. Also depending on the store, such as mine, there are always opportunities for overtime.You can meet a lot of interesting people between both workers and customers. Being in management has perks here and there, including traveling for small events or the yearly holiday party!", "Cons": "Different shifts can be highly stressful. Earlier shifts tend to run smoother because there is generally older and more experienced staff. During the week this holds true during the morning and afternoon Nights and weekends can be a handful due to mostly minors working. They aren't as experienced and need more guidance in every thing they need to do.It is a customer service job and unfortunately here and there we get crazy customers. Some people get ridiculously mad over policies that we have no control over and blame is when there is absolutely nothing we can do"}, "4": {"Date": " Mar 30, 2017", "Summary": "\"Mac Daddy's\"", "Pros": "Shifts go fast with little downtimefree food nice management", "Cons": "Hire some bad employeesCustomers are rudeAppliances will be broken for weeks without repair"}, "5": {"Date": " Mar 15, 2017", "Summary": "\"Cash Register\"", "Pros": "Money.Communication.Verbal Speaking. Hard-Working. Customer Service. Multi-Tasking.", "Cons": "Transportation.Time management (Homework).Sports. Most shifts on weekends."}, "6": {"Date": " Mar 16, 2017", "Summary": "\"not too bad\"", "Pros": "experience, people, happy, nice, friendly", "Cons": "customers, food, break, annoying, lol"}, "7": {"Date": " Apr 20, 2017", "Summary": "\"Ok\"", "Pros": "Nice co workers, free food", "Cons": "Pay is bad, management is bad"}, "8": {"Date": " Apr 21, 2017", "Summary": "\"cashier\"", "Pros": "the benefits that comes with the job.", "Cons": "rude customers on a daily even when you are nice"}, "9": {"Date": " Apr 21, 2017", "Summary": "\"presenter\"", "Pros": "Every week pay was good", "Cons": "they were very unprofessional. It was​ the worst experience in the food industry for me"}}