{"0": {"Date": " Oct 18, 2016", "Summary": "\"Its a great first job\"", "Pros": "Easy once you get the hang of it. Able to learn how to deal with problems of all kinds in this place.", "Cons": "Very fast paced and can easily wear you out if you let it."}, "1": {"Date": " Oct 18, 2016", "Summary": "\"Manager\"", "Pros": "good hours, good people, free food", "Cons": "not worth the time if you are not getting paid to do a managers job"}, "2": {"Date": " Oct 18, 2016", "Summary": "\"good starting off job\"", "Pros": "learn how the value of the dollar, good starting job", "Cons": "alot of work for little pay"}, "3": {"Date": " Oct 18, 2016", "Summary": "\"JOb\"", "Pros": "Hours, decent pay, able to spend time with family, I liked my co-workers, I got some paid vacation too. Good breaks and benefits.", "Cons": "I didn't love the work environment. It was dirty and smelly and sometimes people are mean. I wish I could have earned more money sometimes."}, "4": {"Date": " Oct 19, 2016", "Summary": "\"Work is only made tolerable by good co-workers\"", "Pros": "Decent pay, sometimes fun, lots of learning opportunities", "Cons": "No benefits at all for anyone other than salaried managers, customers are ridiculous at times, work load is unbalanced"}, "5": {"Date": " Oct 3, 2016", "Summary": "\"General Manager\"", "Pros": "McDonald's is a great career. I was responsible for all aspects of the operation. Its a fast paced teamwork environment. I was very happy there.", "Cons": "The challenges of staffing were always something to stay 2 steps ahead of.Working and development of people was very fulfilling."}, "6": {"Date": " Oct 3, 2016", "Summary": "\"Very Great working place\"", "Pros": "It was a great experience and first job I've had.", "Cons": "Depending on what you do in the restaurant, the customers aren't the greatest 10% of the time."}, "7": {"Date": " Oct 4, 2016", "Summary": "\"Management\"", "Pros": "Great benefits and the knowledge that you receive in your development surpasses most other companies", "Cons": "Pay is definitely one of the downsides"}, "8": {"Date": " Oct 4, 2016", "Summary": "\"Awsome\"", "Pros": "felixble hours with great service", "Cons": "It was hard to call of holidays"}, "9": {"Date": " Nov 8, 2016", "Summary": "\"Terrible Place\"", "Pros": "I was new to Troy, MO so I gained some new friends and my amazing boyfriend from working there.", "Cons": "under staffeddidn't grow from the jobstressfullazy co-workerslazy managerslow pay"}}