{"0": {"Date": " Jun 26, 2017", "Summary": "\"Crew Member\"", "Pros": "Free lunch mealsFriendly coworkers", "Cons": "High customer trafficMore staff maintenance needed to fix"}, "1": {"Date": " Jun 26, 2017", "Summary": "\"Who would want to work at Mcdonald's ?\"", "Pros": "Co-workers where hilarious and made time go by faster", "Cons": "Rude customers, management was terrible"}, "2": {"Date": " Jun 26, 2017", "Summary": "\"Hreay\"", "Pros": "Great service great people great food good time love kids", "Cons": "Team work is awesome always room to grow"}, "3": {"Date": " Jun 7, 2017", "Summary": "\"Crew Member\"", "Pros": "Great customer service skills", "Cons": "There are no consensus in my opinion"}, "4": {"Date": " Jun 25, 2017", "Summary": "\"Some good benefits.\"", "Pros": "Great Benefits, 50% discount on food, Some Decent people to work with. Some of the managers were nice. My manager at the time was understanding of my situation at home.", "Cons": "Works you like a dog, or not at all. Some of the rudest people, Lazy. always had someone drunk or high working who stank to high heck."}, "5": {"Date": " Jun 26, 2017", "Summary": "\"Starts off strong, weeds you off at the end.\"", "Pros": "Flexible schedule, part time, great for a first job or something on the side, fast paced environment, works well around school", "Cons": "Management does not have to write you on the schedule each cycle, closing the store is pretty physical, the usual cons to any customer service job"}, "6": {"Date": " Jun 26, 2017", "Summary": "\"A Good First Job, Not For A Lifetime\"", "Pros": "You learn a lot of skills that will help you at other jobs. It gets you on your feet for getting other better jobs. They pay starting out a dollar above minimum wage. Hours are flexible and negotiable. You make good friends with lots of co workers. You meet fun people every day.", "Cons": "There is a lot of work that is strenuous on the body. Customers can be rude and very inconsiderate. You will have people above you that you do not like. The job itself is really very tedious and just not the place you'd want to stay forever."}, "7": {"Date": " Jun 10, 2017", "Summary": "\"Cashier\"", "Pros": "Posted schedulesCLEAR job expectationsClear protocallsResponsive management", "Cons": "I honestly can't think of any. This is the best job I've ever had and I still keep in touch with my old coworkers."}, "8": {"Date": " Jul 17, 2017", "Summary": "\"Crew member\"", "Pros": "Easy work something to work while in school", "Cons": "Won't give raises very rude to employees and just never work for again"}, "9": {"Date": " Jun 25, 2017", "Summary": "\"Cashier\"", "Pros": "They worked with my schedule", "Cons": "Their pay sucks very low"}}