{"0": {"Date": " Nov 6, 2017", "Summary": "\"A place-holder job\"", "Pros": "Likely to hire anyone, usually a lot of call outs so more hours if you’re willing to work them. Generally good at schedule flexibility.", "Cons": "Extremely fast paced, sometimes requires more multi tasking than humanly normal. If too many people call out, and you work back cash, you’re stuck until any one can come in."}, "1": {"Date": " Nov 6, 2017", "Summary": "\"Okay\"", "Pros": "Good place to work at", "Cons": "None at the current moment"}, "2": {"Date": " Nov 6, 2017", "Summary": "\"Shift Manager\"", "Pros": "Teaches you how to deal with unruly customers. It helps you learn how to manage effectively.", "Cons": "Not paid enough to babysit. Very stressful and very high paced."}, "3": {"Date": " Nov 6, 2017", "Summary": "\"Typical\"", "Pros": "Typical part time job. The experience varies depending on managers attitude.", "Cons": "Depending on manager the hours could be tricky"}, "4": {"Date": " Nov 6, 2017", "Summary": "\"Crew Member\"", "Pros": "Flexible, Convenient, Easy, Good starter job, Good advancement", "Cons": "Horrible management, long shifts (up to 10 hrs), no raises other than annually."}, "5": {"Date": " Nov 7, 2017", "Summary": "\"Less than satisfactory.\"", "Pros": "Great pay as a first minimum-wage job (11.75/hour). Very beneficial for HS students and even early college students who need a little extra money. Can be a comfortable working environment when enough people are scheduled to work.", "Cons": "My scheduling manager was very bad at creating a viable schedule, so every day at work when we were understaffed we had to pray it wouldn’t get busy (even though it always did at the same time every day). When it wasn’t busy is when all the people were scheduled to work, which has yet to be changed. New people are continually being hired and work the same shifts when we don’t need them whereas people who have experience and everyone was comfortable working with quit due to lack of employee satisfaction."}, "6": {"Date": " Nov 7, 2017", "Summary": "\"Cree trainer\"", "Pros": "Chance to grow and successor", "Cons": "No over time sometimes the managers can be rude."}, "7": {"Date": " Nov 7, 2017", "Summary": "\"Cashier\"", "Pros": "Flexible,fun,fast paced, bright future, good experience", "Cons": "Low pay, few hours, better manager, more workers,"}, "8": {"Date": " Oct 22, 2017", "Summary": "\"crew trainer\"", "Pros": "I like that they have flexable hours", "Cons": "I am not sure maybe they can pay more money."}, "9": {"Date": " Oct 23, 2017", "Summary": "\"Amazing\"", "Pros": "Lots of opportunities to move up in the industry", "Cons": "Looked down upon as a stable job"}}