{"0": {"Date": " Dec 10, 2016", "Summary": "\"Manager\"", "Pros": "People and customers. Love the regulars. Know them by name. Makes my job worth the trouble to see all the smiles. Crew is great and you meet so many different types of people.", "Cons": "Shorthanded and Stressful. Not enough pay for the cons. You can only get so far up on the chain and you are stuck. Extremely small raises, so small that they really don't make a difference."}, "1": {"Date": " Dec 10, 2016", "Summary": "\"Cashier\"", "Pros": "Free food per shift and co workers are usually nice and they're flexible with scheduling", "Cons": "Customers and manager was rude often"}, "2": {"Date": " Dec 9, 2016", "Summary": "\"mcdonalds\"", "Pros": "great co workers and schedule flexibilty", "Cons": "some of the conflicts and power trips among management trickles down to the crew and sometimes it becomes a stressful or awkward work environment. Hardly any benefits."}, "3": {"Date": " Dec 10, 2016", "Summary": "\"Crew member\"", "Pros": "Pay is low and they do nothing for their employee", "Cons": "Can choose your hours / days you want to work"}, "4": {"Date": " Nov 25, 2016", "Summary": "\"Great place to work\"", "Pros": "Lots of opportunities to move up", "Cons": "Seems impossible to open your own restaurant due to it costing about half a million dollars"}, "5": {"Date": " Dec 8, 2016", "Summary": "\"Assistant Manager\"", "Pros": "I enjoyed the people I worked with", "Cons": "We never had enough employees on our shift but the store manager had all the help and more so that would leave the other mangers with out help."}, "6": {"Date": " Dec 8, 2016", "Summary": "\"customer service\"", "Pros": "Great management and team atmosphere. Great part time job for a high school student. Flexible scheduling. Gave me great personable skills for life!", "Cons": "I wish the training was a little more in depth, and time allocated. I wish there was room for more growth. I do not have any other cons."}, "7": {"Date": " Dec 8, 2016", "Summary": "\"Opener\"", "Pros": "Great place to work. Friendly people", "Cons": "Stand in one place to long"}, "8": {"Date": " Dec 8, 2016", "Summary": "\"Eh\"", "Pros": "Its alright because salary and a lot of friend. I like the face paced work and everything also. YAAAAAS", "Cons": "This development in eating habits has enormous and serious consequences for relations between people and for human health. It has also catalysed a whole range of campaigns and movements dedicated to encouraging healthy eating and healthy lifestyles.Such efforts have forced food companies like McDonald's onto the defensive, and they have had to resort to producing propaganda to try and deflect public criticism. The debate over food choices and preferences has become one of the great controversial issues of our time."}, "9": {"Date": " Dec 8, 2016", "Summary": "\"Shift Manager\"", "Pros": "Great people, fun and loving environment! Wonderful hard workers all working together to keep our customers happy! Lots of nice perks to the job!", "Cons": "Sometimes we're very short staffed and everyone gets stretched thin. Not much pay for lots of very hard work. Highschool drama!"}}