{"0": {"Date": " Nov 21, 2016", "Summary": "\"Ok but not great\"", "Pros": "Friendly fast paced work environment", "Cons": "Employees not dependable, same with managers."}, "1": {"Date": " Nov 22, 2016", "Summary": "\"It was as expected\"", "Pros": "There were free meals for the employees.", "Cons": "A lot of complaining from management"}, "2": {"Date": " Nov 22, 2016", "Summary": "\"work\"", "Pros": "the management staff were very influential and they were honest. they also let me pick up shifts whenever i wanted.", "Cons": "dealing with other employees were awful. most of them were super lazy and did not work hard. they made me do everything because i was the only hard worker."}, "3": {"Date": " Nov 6, 2016", "Summary": "\"Accounts payable\"", "Pros": "Great global company to work for. Many opportunities to move up and take on more responsibility. Great environment, everyone is willing to help you out.", "Cons": "not the company it used to be. Declining sales but hopefully the new ceo can help out and change that."}, "4": {"Date": " Nov 21, 2016", "Summary": "\"Cashier\"", "Pros": "food , standards , not much to really was a pro besides a job. coworkers are rude", "Cons": "no room for advancement , low employee moral"}, "5": {"Date": " Nov 20, 2016", "Summary": "\"Crew Member\"", "Pros": "Flexibility, working as a team", "Cons": "sometimes holidays and late hours"}, "6": {"Date": " Nov 21, 2016", "Summary": "\"Business Analyst\"", "Pros": "Great experience, great people. This was a contract role", "Cons": "Nothing negative about this role or company"}, "7": {"Date": " Nov 5, 2016", "Summary": "\"Fun Job\"", "Pros": "Of all the jobs I've had before and after McD's it was by far the most enjoyable. It's a fast paced job, keeps you on your feet and with so much to do the days flew by.", "Cons": "The downsides of working at McD's are big ones. Part time hours so it's hard to make a living. Schedule varies drastically so it's hard to have a life. Low pay for the amount of work you do each day."}, "8": {"Date": " Nov 5, 2016", "Summary": "\"Okay\"", "Pros": "Very friendly people, very nice benefits. Nice way for teens to make an income in high school.", "Cons": "Has a huge turnover rate. Must be because most teens graduate tho."}, "9": {"Date": " Nov 19, 2016", "Summary": "\"A job is a job\"", "Pros": "- Flexible hours- Potential to move up- Grants for college I hope- Get to help Ronald McDonald's House of Charity- Discount off food- Build experience and skills for other jobs", "Cons": "- Too many problems with homeless people in the downtown Dallas area- Raises are small and rare- Majority of staff members could not speak English that well- Worked with lazy irresponsible people who was always late or calling off- Very limited benefits for employees- Always short-handed and high turnover rate- Slow promotions"}}